000100 IDENTIFICATION DIVISION.                                         00000100
000200 PROGRAM-ID.    EXWWB909.                                         00000200
000300 AUTHOR.        COLLEEN COOK.                                     00000300
000400 DATE-WRITTEN.  APRIL 2017.                                       00000400
000500 DATE-COMPILED.                                                   00000500
000600                                                                  00000600
000700******************************************************************00000700
000800* PROGRAM DESCRIPTION                                             00000800
000900*                                                                 00000900
001000* EXWWB909 IS A BATCH PROGRAM THAT IS DESIGNED TO EXTRACT VEHICLE 00001000
001100* DATA, CUSTOMER DATA AND DEALER DATA FROM VARIOUS DB2 TABLES     00001100
001200* WHICH ARE OWNED AND MAINTAINED BY GEVIS AND TO CREATE AN        00001200
001300* OUTBOUND BRIDGE FILE WHICH WILL BE USED BY VINCENT (NORTH       00001300
001400* AMERICAN INCENTIVE CLAIMING SYSTEM) TO RE-REVIEW ALL VRULES     00001400
001500* PROGRAMS AND COMPARE TO ALL VIN RECORDS.  VINCENT WILL REVIEW   00001500
001600* CHARGEBACK (AUTOMATIC POST CLAIM VALIDATION) ) AND AUTO CLAIM   00001600
001700* GENERATION WHEN THE BUSINESS REQUESTS A "FULL PASS" IN VRULES.  00001700
001800*                                                                 00001800
001900* PROGRAM PROCESSSING:                                            00001900
002000* THE PROGRAM WILL READ IN AN INPUT SYSPARM FILE WHICH WILL       00002000
002100* CONTAIN A LIST OF PRODUCERS TO BE PROCESSED.  IT WILL PROCESS   00002100
002200* ONE PRODUCER AT A TIME.  WHEN A PRODUCER IS FIRST READ IN, A    00002200
002300* DB2 CURSOR WILL BE OPENED WHICH DRIVES OFF OF TABLE MEXW001_    00002300
002400* VEH_ORDER AND SELECTS ROWS WHERE THE MODEL YEARS ARE 1 YEAR     00002400
002500* BACK AND 2 YEARS FORWARD.  ONLY ROWS THAT ARE ASSOCIATED WITH   00002500
002600* A CURRENT WDMO DEALER WILL BE FURTHER  PROCESSED AND OUTPUT     00002600
002700* TO THE OUTBOUND BRIDGE FILE.  THE BRIDGE FILE WILL CONTAIN      00002700
002800* STANDARD E & G HEADERS/TRAILERS ALONG WITH VINCENT HEADERS/     00002800
002900* TRAILERS.                                                       00002900
003000* NOTE:  THERE MAY BE INSTANCES WHERE SOME FIELDS EXTRACTED       00003000
003100* FROM THE GEVIS DB2 TABLES, MAY NOT BE POPULATED WITH DATA.      00003100
003200* IN THAT CASE, IF THE FIELD IS ALPHANUMERIC, SPACES WILL BE      00003200
003300* CONTAINED WITHIN THE CORRESPONDING OUTPUT FIELD AND IF THE      00003300
003400* FIELD IS NUMERIC, ZEROS WILL BE CONTAINED WITHIN THE COR-       00003400
003500* CORRESPONDING OUTPUT FIELD.                                     00003500
003510*                                                                 00003510
003520* THIS IS BASED ON LAST RUN TIMESTAMP OF THE PROGRAM.  THIS IS    00003520
003600* A CLONE OF EXWWB910 AND EXWWGEVP, IF THIS PROGRAM CHANGES THEN  00003600
003610* THE OTHER TWO SHOULD BE LOOKED AT FOR CHANGES.                  00003610
003700******************************************************************00003700
003800*                       REVISION LOG                              00003800
003900*                                                                 00003900
004000* DATE     PROGRAMMER REVISION                                    00004000
004100* -------- ---------- ------------------------------------------- 00004100
004200* 04/21/17 C COOK     ETRACKER# 14835713 - PROGRAM CREATION       00004200
004300*                                                                 00004300
004400******************************************************************00004400
004402* DATE    : 02/08/2018  PROGRAMMER: DAWN MAHN                    *
004403* ETRACKER: 15334234                                             *
004404* REASON  : CHANGE THE MODEL YEAR CRITERIA IN THE CURSORS        *
004405*           FROM -1 TO -4.                                       *
004406*                                                                *
004407*           CURSORS CHANGED: MEXW001_CSR, MEXW003_CSR,           *
004408*                            MEXW008_CSR AND SALE_CHK_CSR        *
004409*                                                                *
004410******************************************************************
004500 ENVIRONMENT DIVISION.                                            00004500
004600 INPUT-OUTPUT SECTION.                                            00004600
004700 FILE-CONTROL.                                                    00004700
004800                                                                  00004800
004900     SELECT AUDIT-FILE           ASSIGN TO AUDIT.                 00004900
004910     SELECT INPUT-PARM           ASSIGN TO PARM.                  00004910
004920     SELECT VINCENT-OUT          ASSIGN TO VINOUT.                00004920
005000                                                                  00005000
005100 DATA DIVISION.                                                   00005100
005200 FILE SECTION.                                                    00005200
005300                                                                  00005300
005400 FD  AUDIT-FILE.                                                  00005400
005500 01  AUDIT-RECORD.                                                00005500
005600     05  AUDIT-LABEL             PIC X(30).                       00005600
005700     05  AUDIT-DATA              PIC X(50).                       00005700
005800                                                                  00005800
005810 FD  INPUT-PARM.                                                  00005810
005820 01  PARM-RECORD.                                                 00005820
005830     05  PARM-DATA               PIC X(80).                       00005830
005841                                                                  00005841
005842 FD  VINCENT-OUT.                                                 00005842
005843 01  VINCENT-RECORD.                                              00005843
005844     05  VINCENT-DETAIL          PIC X(1000).                     00005844
005850                                                                  00005850
005900******************************************************************00005900
006000*                 W O R K I N G   S T O R A G E                  *00006000
006100******************************************************************00006100
006200 WORKING-STORAGE SECTION.                                         00006200
006300 77  PAN-VALET PICTURE X(24) VALUE "070PEXWWB909 07/25/06".       00006300
006400                                                                  00006400
006500******************************************************************00006500
006600* WORKING STORAGE COPYBOOKS                                       00006600
006700******************************************************************00006700
006800                                                                  00006800
006900 COPY CPEWD001.                                                   00006900
007000*MEXW001_VEH_ORDER                                                00007000
007100                                                                  00007100
007200 COPY CPEWD003.                                                   00007200
007300*MEXW003_VEH_STATUS                                               00007300
007400                                                                  00007400
007401 COPY CPEWD004.                                                   00007401
007402*MEXW004_VEH_WER_STRING                                           00007402
007403                                                                  00007403
007404 COPY CPEWD007.                                                   00007404
007405*MEXW007_VEH_WHS                                                  00007405
007406                                                                  00007406
007500 COPY CPEWD008.                                                   00007500
007600*MEXW008_VEH_RTL                                                  00007600
007700                                                                  00007700
007800 COPY CPESD016.                                                   00007800
007900*MEXS016_GENERIC2                                                 00007900
008300                                                                  00008300
008400 COPY CPEWD021.                                                   00008400
008500*MEXW021_SUBLVL_ASG                                               00008500
008600                                                                  00008600
008700 COPY CPEWD027.                                                   00008700
008800*MEXW027_CONV                                                     00008800
008900                                                                  00008900
009000 COPY CPEWD031.                                                   00009000
009100*MEXW031_CATMAP                                                   00009100
009200                                                                  00009200
009300 COPY CPEWD032.                                                   00009300
009400*MEXW032_CATALOG                                                  00009400
009500                                                                  00009500
009600 COPY CPEWD033.                                                   00009600
009700*MEXW033_BODY_TABLE                                               00009700
009800                                                                  00009800
009900 COPY CPEWD034.                                                   00009900
010000*MEXW034_VL_BRAND                                                 00010000
010100                                                                  00010100
010200 COPY CPEWD035.                                                   00010200
010300*MEXW035_DLR_MSTR                                                 00010300
010310                                                                  00010310
010400 COPY CPESGNTB.                                                   00010400
010500*GENERIC TABLE LAYOUTS - EXSE SYSTEM                              00010500
010600                                                                  00010600
010700 COPY CPEWGNTB.                                                   00010700
010800*GENERIC TABLE LAYOUT  - EXWW SYSTEM                              00010800
010900                                                                  00010900
011000 COPY CPESEBWS.                                                   00011000
011100*BMPSHELL WORKING STORAGE                                         00011100
011200                                                                  00011200
011210 COPY CPEWSSTK.                                                   00011210
011220*PARAMETERS EXWWSSTK                                              00011220
011221                                                                  00011221
011222 COPY CPESDB2.                                                    00011222
011223*SQLCA AND SQLCODES                                               00011223
011224                                                                  00011224
011230 01 VIN-HEADER-TRAILER.                                           00011230
011240 COPY CPEWVNCT.                                                   00011240
011250*VINCENT HEADER/TRAILER LAYOUT                                    00011250
011300                                                                  00011300
011400******************************************************************00011400
011500* WORKING STORAGE LITERALS                                        00011500
011600******************************************************************00011600
011700 01  WS-LITERALS.                                                 00011700
011800     05  LIT-00A                     PIC  X(03) VALUE "00A".      00011800
011810     05  LIT-00B                     PIC  X(03) VALUE "00B".      00011810
011900     05  LIT-001                     PIC  X(03) VALUE "001".      00011900
012000     05  LIT-010                     PIC  X(03) VALUE "010".      00012000
012100     05  LIT-10M                     PIC  X(03) VALUE "10M".      00012100
012200     05  LIT-20M                     PIC  X(03) VALUE "20M".      00012200
012300     05  LIT-20T                     PIC  X(03) VALUE "20T".      00012300
012400     05  LIT-30P                     PIC  X(03) VALUE "30P".      00012400
012500     05  LIT-30R                     PIC  X(03) VALUE "30R".      00012500
012600     05  LIT-30T                     PIC  X(03) VALUE "30T".      00012600
012700     05  LIT-40V                     PIC  X(03) VALUE "40V".      00012700
012800     05  LIT-80F                     PIC  X(03) VALUE "80F".      00012800
012801     05  LIT-80J                     PIC  X(03) VALUE "80J".      00012801
012802     05  LIT-80V                     PIC  X(03) VALUE "80V".      00012802
012803     05  LIT-90U                     PIC  X(03) VALUE "90U".      00012803
012900     05  LIT-90V                     PIC  X(03) VALUE "90V".      00012900
013000     05  LIT-025                     PIC  X(03) VALUE "025".      00013000
013100     05  LIT-185                     PIC  X(03) VALUE "185".      00013100
013200     05  LIT-190                     PIC  X(03) VALUE "190".      00013200
013300     05  LIT-600                     PIC  X(03) VALUE "600".      00013300
013400     05  LIT-800                     PIC  X(03) VALUE "800".      00013400
013500     05  LIT-801                     PIC  X(03) VALUE "801".      00013500
013600     05  LIT-999                     PIC  X(03) VALUE "999".      00013600
016810     05  LIT-INVALID-TIMESTAMP       PIC X(18)                    00016810
016820                                     VALUE "INVALID TIMESTAMP".   00016820
016900     05  LIT-D                       PIC  X(01) VALUE "D".        00016900
017000     05  LIT-E                       PIC  X(01) VALUE "E".        00017000
017100     05  LIT-EX                      PIC  X(02) VALUE "EX".       00017100
017200     05  LIT-Y                       PIC  X(01) VALUE "Y".        00017200
017300     05  LIT-N                       PIC  X(01) VALUE "N".        00017300
017400     05  LIT-STATUS                  PIC  X(06) VALUE "STATUS".   00017400
017500     05  LIT-NA                      PIC  X(02) VALUE "NA".       00017500
017600     05  LIT-EA                      PIC  X(02) VALUE "EA".       00017600
017700     05  LIT-VI                      PIC  X(02) VALUE "VI".       00017700
017800     05  LIT-WD                      PIC  X(02) VALUE "WD".       00017800
017900     05  LIT-SYSTEM-ID               PIC  X(04) VALUE "EXWW".     00017900
018000     05  LIT-VEHLINE                 PIC  X(08) VALUE "VEHLINE ". 00018000
018100     05  LIT-USD                     PIC  X(04) VALUE "USD ".     00018100
018200     05  LIT-WDMHAEXT                PIC  X(08) VALUE "WDMHAEXT". 00018200
018210     05  LIT-WDM                     PIC  X(03) VALUE "WDM".      00018210
018300     05  LIT-TABLE-ID                PIC  X(08) VALUE "SYSPARM ". 00018300
018400     05  LIT-KEY-DATA-TIMESTAMP      PIC  X(20) VALUE             00018400
018500                                     "EXWWB909TIMESTMP".          00018500
018600     05  LIT-KEY-DATA-BATCHCTL       PIC  X(20) VALUE             00018600
018700                                     "EXWWB909BATCHCTL".          00018700
019302     05  PL-PGM-NAME                 PIC  X(08) VALUE "EXWWB909". 00019302
019303     05  PL-SUBRTN-NAME              PIC  X(08) VALUE "EXWWSSTK". 00019303
019304     05  PL-SYSTEM-CD                PIC  X(04) VALUE  "EXWW".    00019304
019305     05  LIT-SPACE                   PIC  X(01) VALUE  " ".       00019305
020200                                                                  00020200
020300******************************************************************00020300
020400* WORKING STORAGE SWITCHES                                        00020400
020500******************************************************************00020500
020600 01  WS-SWITCHES.                                                 00020600
020700     05  WS-MEXW001-CSR-SW           PIC X(01).                   00020700
020800         88 MEXW001-CSR-FOUND        VALUE "Y".                   00020800
020900         88 MEXW001-CSR-NOT-FOUND    VALUE "N".                   00020900
021000     05  WS-MEXW003-FOUND-SW         PIC X(01).                   00021000
021100         88 MEXW003-FOUND            VALUE "Y".                   00021100
021200         88 MEXW003-NOT-FOUND        VALUE "N".                   00021200
021300     05  WS-MEXW003-CSR-FOUND-SW     PIC X(01).                   00021300
021400         88 MEXW003-CSR-FOUND        VALUE "Y".                   00021400
021500         88 MEXW003-CSR-NOT-FOUND    VALUE "N".                   00021500
022200     05  WS-MEXW003-40V-SW           PIC X(01).                   00022200
022300         88 MEXW003-FOUND-40V        VALUE "Y".                   00022300
022400         88 MEXW003-NOT-FOUND-40V    VALUE "N".                   00022400
022800     05  WS-MEXW008-90V-SW           PIC X(01).                   00022800
022900         88 MEXW008-FOUND-90V        VALUE "Y".                   00022900
023000         88 MEXW008-NOT-FOUND-90V    VALUE "N".                   00023000
023100     05  WS-MEXW003-40V-CSR-ROW-FOUND                             00023100
023200                                     PIC X(01).                   00023200
023300         88 MEXW003-40V-CSR-ROW-FOUND                             00023300
023400                                     VALUE "Y".                   00023400
023500         88 MEXW003-40V-CSR-ROW-NOT-FOUND                         00023500
023600                                     VALUE "N".                   00023600
023700     05  WS-MEXW007-SW               PIC X(01).                   00023700
023800         88 MEXW007-FOUND            VALUE "Y".                   00023800
023900         88 MEXW007-NOT-FOUND        VALUE "N".                   00023900
024000     05  WS-MEXW008-CSR-SW           PIC X(01).                   00024000
024100         88 MEXW008-CSR-FOUND        VALUE "Y".                   00024100
024200         88 MEXW008-CSR-NOT-FOUND    VALUE "N".                   00024200
024300     05  WS-MEXW021-SW               PIC X(01).                   00024300
024400         88 MEXW021-FOUND            VALUE "Y".                   00024400
024500         88 MEXW021-NOT-FOUND        VALUE "N".                   00024500
024600     05  WS-MEXW027-SW               PIC X(01).                   00024600
024700         88 MEXW027-FOUND            VALUE "Y".                   00024700
024800         88 MEXW027-NOT-FOUND        VALUE "N".                   00024800
024900     05  WS-MEXW027-MULTIPLE-SW      PIC X(01).                   00024900
025000         88 MEXW027-MULTIPLE-FOUND   VALUE "Y".                   00025000
025100         88 MEXW027-MULTIPLE-NOT-FOUND                            00025100
025200                                     VALUE "N".                   00025200
025300     05  WS-MEXW031-SW               PIC X(01).                   00025300
025400         88 MEXW031-FOUND            VALUE "Y".                   00025400
025500         88 MEXW031-NOT-FOUND        VALUE "N".                   00025500
025600     05  WS-MEXW032-SW               PIC X(01).                   00025600
025700         88 MEXW032-FOUND            VALUE "Y".                   00025700
025800         88 MEXW032-NOT-FOUND        VALUE "N".                   00025800
025900     05  WS-MEXW033-SW               PIC X(01).                   00025900
026000         88 MEXW033-FOUND            VALUE "Y".                   00026000
026100         88 MEXW033-NOT-FOUND        VALUE "N".                   00026100
026200     05  WS-MEXW034-SW                PIC X(01).                  00026200
026300         88 MEXW034-FOUND            VALUE "Y".                   00026300
026400         88 MEXW034-NOT-FOUND        VALUE "N".                   00026400
026500     05  WS-MEXW035-SW               PIC X(01).                   00026500
026600         88 MEXW035-FOUND            VALUE "Y".                   00026600
026700         88 MEXW035-NOT-FOUND        VALUE "N".                   00026700
026800     05  WS-END-OF-SYSPARM-FILE      PIC X(01).                   00026800
026900         88 END-OF-SYSPARM-FILE      VALUE "Y".                   00026900
027000         88 NOT-END-OF-SYSPARM-FILE  VALUE "N".                   00027000
027100     05  WS-BATCHCTL-FOUND           PIC X(01).                   00027100
027200         88 BATCHCTL-FOUND           VALUE "Y".                   00027200
027300         88 BATCHCTL-NOT-FOUND       VALUE "N".                   00027300
027400     05  WS-WDMO-DEALER              PIC X(01).                   00027400
027500         88 WDMO-DEALER              VALUE "Y".                   00027500
027600         88 NOT-WDMO-DEALER          VALUE "N".                   00027600
027700     05  WS-SEND-EMAIL               PIC X(01).                   00027700
027800         88 SEND-EMAIL               VALUE "Y".                   00027800
027900         88 NOT-SEND-EMAIL           VALUE "N".                   00027900
028000     05  WS-SALE-CHK-SW              PIC X(01).                   00028000
028100         88 SALE-CHK-FOUND           VALUE "Y".                   00028100
028200         88 SALE-CHK-NOT-FOUND       VALUE "N".                   00028200
028300     05  SW-WERS-STRING              PIC X(01).                   00028300
028400         88 WERS-STRING-FOUND-SW     VALUE "Y".                   00028400
028500         88 WERS-STRING-NOT-FOUND-SW VALUE "N".                   00028500
028600     05  WS-VALID-VARIABLES.                                      00028600
028700         10  WS-WERS-VL-C                PIC  X(02).              00028700
028800             88  WS-VALID-VEH-LINE-CDS   VALUE "KI", "K5", "DB".  00028800
028810     05  WS-ERROR-FOUND-SW           PIC X(01).                   00028810
028820         88 ERROR-FOUND              VALUE "Y".                   00028820
028830         88 ERROR-NOT-FOUND          VALUE "N".                   00028830
028900                                                                  00028900
029000******************************************************************00029000
029100* WORKING STORAGE COUNTERS                                        00029100
029200******************************************************************00029200
029300 01  WS-COUNTERS.                                                 00029300
029400     05  WS-NBR-ROWS-READ-MEXW001-CSR                             00029400
029410                                     PIC S9(9) COMP.              00029410
029500     05  WS-NBR-ROWS-READ-MEXW003-CSR                             00029500
029501                                     PIC S9(9) COMP.              00029501
029510     05  WS-NBR-ROWS-READ-MEXW008-CSR                             00029510
029511                                     PIC S9(9) COMP.              00029511
029520     05  WS-NBR-ROWS-READ-MEXW003    PIC S9(9) COMP.              00029520
029600     05  WS-NBR-ROWS-READ-MEXW004    PIC S9(9) COMP.              00029600
029700     05  WS-NBR-ROWS-READ-MEXW007    PIC S9(9) COMP.              00029700
029800     05  WS-NBR-ROWS-READ-MEXW008    PIC S9(9) COMP.              00029800
029900     05  WS-NBR-ROWS-READ-SALE-CHK   PIC S9(9) COMP.              00029900
030000     05  WS-NBR-ROWS-READ-MEXW021    PIC S9(9) COMP.              00030000
030100     05  WS-NBR-ROWS-READ-MEXW027    PIC S9(9) COMP.              00030100
030200     05  WS-NBR-ROWS-READ-MEXW031    PIC S9(9) COMP.              00030200
030300     05  WS-NBR-ROWS-READ-MEXW032    PIC S9(9) COMP.              00030300
030400     05  WS-NBR-ROWS-READ-MEXW033    PIC S9(9) COMP.              00030400
030500     05  WS-NBR-ROWS-READ-MEXW034    PIC S9(9) COMP.              00030500
030600     05  WS-NBR-ROWS-READ-MEXW035    PIC S9(9) COMP.              00030600
030700     05  WS-NBR-SYSPARM-RECS-READ    PIC S9(9) COMP.              00030700
030800     05  WS-NBR-EXWWSSTK-CALLS       PIC S9(9) COMP.              00030800
030900     05  WS-NBR-EXWWSSTK-NOTFOUND-CALLS                           00030900
031000                                     PIC S9(9) COMP.              00031000
031100     05  WS-NBR-MEXW027-NOTFOUND-CALLS                            00031100
031200                                     PIC S9(9) COMP.              00031200
031300     05  WS-NBR-MEXW035-NOTFOUND-CALLS                            00031300
031400                                     PIC S9(9) COMP.              00031400
031500     05  WS-NBR-OUTPUT-RECS-WRITTEN  PIC S9(9) COMP.              00031500
031600     05  WS-COUNT-DTL-NBR            PIC S9(9) COMP.              00031600
031700     05  WS-COUNT-LINE-NBR           PIC S9(9) COMP.              00031700
031701     05  PV-COUNT-DISPLAY            PIC Z(09)9.                  00031701
031710******************************************************************00031710
031720* WORKING STORAGE VARIABLES                                       00031720
031730******************************************************************00031730
031800 01  WS-VARIABLES.                                                00031800
031810     05  WS-VST-VEH-ORD-ID-C         PIC X(25).                   00031810
031820     05  WS-VST-DTA-DATA-SRC-C       PIC X(02).                   00031820
031830     05  WS-VST-STA-STATUS-C         PIC X(03).                   00031830
031840     05  WS-VST-LAST-OCCUR-F         PIC X(01).                   00031840
031850     05  WS-VST-ACTIVE-F             PIC X(01).                   00031850
031900     05  WS-PREV-RUN-TIMESTAMP       PIC X(26).                   00031900
032000     05  WS-PREV-BATCH-NBR           PIC 9(05).                   00032000
032100     05  WS-CURRENT-BATCH-NBR        PIC 9(05).                   00032100
032110     05  WS-HOLD-CURR-TIMESTAMP      PIC X(26).                   00032110
032200     05  WS-CURR-DRBN-TIMESTAMP      PIC X(26).                   00032200
032300     05  WS-CURR-DRBN-TIMESTAMP-REDEF REDEFINES                   00032300
032400         WS-CURR-DRBN-TIMESTAMP.                                  00032400
032500         10  WS-DRBN-YEAR            PIC 9(04).                   00032500
032600         10  FILLER                  PIC X(01).                   00032600
032700         10  WS-DRBN-MONTH           PIC X(02).                   00032700
032800         10  FILLER                  PIC X(01).                   00032800
032900         10  WS-DRBN-DAY             PIC X(02).                   00032900
033000         10  FILLER                  PIC X(01).                   00033000
033100         10  WS-DRBN-HOUR            PIC X(02).                   00033100
033200         10  FILLER                  PIC X(01).                   00033200
033300         10  WS-DRBN-MINUTE          PIC X(02).                   00033300
033400         10  FILLER                  PIC X(01).                   00033400
033500         10  WS-DRBN-SECOND          PIC X(02).                   00033500
033600         10  FILLER                  PIC X(01).                   00033600
033700         10  WS-DRBN-MILISECS        PIC X(06).                   00033700
033800                                                                  00033800
034500     05  WS-VEH-BDT-MDL-YR-Y         PIC 9(04).99.                00034500
034600     05  WS-VEH-BDT-MDL-YR-Y-RDF                                  00034600
034700         REDEFINES WS-VEH-BDT-MDL-YR-Y.                           00034700
034800         10 WS-VEH-BDT-MDL-YR-CC     PIC X(02).                   00034800
034900         10 WS-VEH-BDT-MDL-YR-YY     PIC X(02).                   00034900
035000         10 WS-VEH-BDT-MDL-YR-FILLE  PIC X(01).                   00035000
035100         10 WS-VEH-BDT-MDL-YR-QTR    PIC X(02).                   00035100
035110     05  WS-HOLD-MDL-YR-Y            PIC 9(04).99.                00035110
035120     05  WS-HOLD-MDL-YR-Y-RDF                                     00035120
035130         REDEFINES WS-HOLD-MDL-YR-Y.                              00035130
035140         10 WS-HOLD-MDL-YR-CC        PIC X(02).                   00035140
035150         10 WS-HOLD-MDL-YR-YY        PIC X(02).                   00035150
035160         10 WS-HOLD-MDL-YR-FILLER    PIC X(01).                   00035160
035170         10 WS-HOLD-BDT-MDL-YR-QTR   PIC X(02).                   00035170
035200     05  WS-CURR-MODEL-YY            PIC S9(04)V99 COMP-3.        00035200
035210     05  WS-HOLD-MDL-YR1             PIC X(07).                   00035210
035220     05  WS-HOLD-MDL-YR2             PIC X(07).                   00035220
035300     05  WS-VST-GBL-LOC-C-REFORMAT   PIC 9(06).                   00035300
035310     05  WS-HOLD-DLR-DLR             PIC 9(06).                   00035310
035400     05  WS-DLR-SUPER-DLR-C-REFORMAT PIC 9(06).                   00035400
035500     05  WS-DTL-VEH-GBL-DLR-C-REFORMAT                            00035500
035600                                     PIC 9(06).                   00035600
035700     05  WS-PROCESS-SQLCODE-EDIT     PIC +++++.                   00035700
035800     05  AUDIT-RECORD-MSG.                                        00035800
035900         10  AUDIT-LABEL-MSG         PIC X(10).                   00035900
036000         10  AUDIT-DATA-MSG          PIC X(70).                   00036000
036100 01 PARM-DETAIL.                                                  00036100
036200    05 INPUT-SOURCE                  PIC X(02).                   00036200
036210    05 FILLER                        PIC X(78).                   00036210
037300******************************************************************00037300
037400* RECORD DESCRIPTIONS FOR GSAM FILES                             *00037400
037500******************************************************************00037500
037510 01  WS-VINCENT-HEAD-TRAIL-RECORD        PIC X(1000).             00037510
037600                                                                  00037600
038300 01  WS-VINCENT-DETAIL-RECORD.                                    00038300
039200     05  WS-DTL-VIN-FULL-C               PIC X(17).               00039200
039400     05  WS-DTL-DTA-DATA-SRC-C           PIC X(02).               00039400
039500     05  WS-DTL-BDT-MDL-YR-Y             PIC X(02).               00039500
039600     05  WS-DTL-GEVIS-VEH-LINE-C         PIC X(02).               00039600
039700     05  WS-DTL-LCL-BDYTYP-C             PIC X(05).               00039700
039800     05  WS-DTL-CUR-STA-STATUS-C         PIC X(03).               00039800
039900     05  WS-DTL-VEH-DIVISION-C           PIC X(01).               00039900
040000     05  WS-DTL-WMI-WMI-C                PIC X(03).               00040000
040100     05  WS-DTL-LCL-PLT-C                PIC X(03).               00040100
040200     05  WS-DTL-VWS-TOT-US-A             PIC S9(07)V99 COMP-3.    00040200
040300     05  WS-DTL-VEH-GBL-DLR-C            PIC X(06).               00040300
040400     05  WS-DTL-LAST-QAD-VST-GBL-LOC-C   PIC X(06).               00040400
040500     05  WS-DTL-CURR-VST-GBL-LOC-C       PIC X(06).               00040500
040600     05  WS-DTL-SHIP-TO-DLR-C            PIC X(06).               00040600
040700     05  WS-DTL-CURR-STOCKING-DLR-C      PIC X(06).               00040700
040800     05  WS-DTL-CURR-DLR-C               PIC X(06).               00040800
040900     05  WS-DTL-WDMO-FLEET-C             PIC X(05).               00040900
041000     05  WS-DTL-VRS-LCL-FLEET-C          PIC X(06).               00041000
041100     05  WS-DTL-VRS-CST-FIRST-N          PIC X(30).               00041100
041200     05  WS-DTL-VRS-CST-MID-INIT-X       PIC X(01).               00041200
041300     05  WS-DTL-VRS-CST-LAST-N           PIC X(30).               00041300
041400     05  WS-DTL-VRS-CST-ADDR-1-X         PIC X(40).               00041400
041500     05  WS-DTL-VRS-CST-ADD-DIV2-N       PIC X(40).               00041500
041600     05  WS-DTL-VRS-CST-ADD-DIV1-C       PIC X(02).               00041600
041700     05  WS-DTL-VRS-CST-POSTAL-C         PIC X(10).               00041700
041800     05  WS-DTL-VRS-SALESPERSON-C        PIC X(11).               00041800
041900     05  WS-DTL-VRS-TYP-LCL-CUST-C       PIC X(01).               00041900
042000     05  WS-DTL-VEH-WDMO-ORD-TYP         PIC X(01).               00042000
042100     05  WS-DTL-VEH-ORD-RCPT-Y           PIC X(08).               00042100
042200     05  WS-DTL-VEH-SCHD-VST-TARGET-Y    PIC X(08).               00042200
042300     05  WS-DTL-VEH-PRODUCE-VST-STAT-Y   PIC X(08).               00042300
042400     05  WS-DTL-VEH-RELEASE-VST-STAT-Y   PIC X(08).               00042400
042500     05  WS-DTL-VEH-ARRIVAL-VST-STAT-Y   PIC X(08).               00042500
042600     05  WS-DTL-VEH-INVOICE-VST-STAT-Y   PIC X(08).               00042600
042700     05  WS-DTL-VEH-STOCK-VST-STAT-Y     PIC X(08).               00042700
042800     05  WS-DTL-VEH-RETAIL-VST-STAT-Y    PIC X(08).               00042800
042900     05  WS-DTL-VEH-DELIVER-VST-STAT-Y   PIC X(08).               00042900
043000     05  WS-DTL-VEH-SLSRCPT-VST-STAT-Y   PIC X(08).               00043000
043100     05  WS-DTL-VEH-WARRANT-VST-STAT-Y   PIC X(08).               00043100
043200     05  WS-DTL-VEH-CATALOG-C            PIC X(15).               00043200
043300     05  WS-DTL-WERS-VEH-LINE-C          PIC X(02).               00043300
043400     05  WS-DTL-WERS-BODY-STYLE-C        PIC X(03).               00043400
043500     05  WS-DTL-WERS-BRAND-C             PIC X(01).               00043500
043600     05  WS-DTL-VEH-PO-Y                 PIC X(08).               00043600
043700     05  WS-DTL-FILLER-01                PIC X(627) VALUE SPACES. 00043700
043800******************************************************************00043800
043900*  THIS CURSOR WILL BE USED TO READ THE MEXW001 AND THE MEXW003  *00043900
044000*  TABLES WHERE THE MODEL YEAR IS BETWEEN -4 & +2 OF THE CURRENT *00044000
044100*  MODEL YEAR AND THE  TIMESTAMP IS BETWEEN THE CURRENT TIMESTAMP*00044100
044200*  AND THE LAST RUN TIMESTAMP.                                   *00044200
044300******************************************************************00044300
044500                                                                  00044500
044600     EXEC SQL                                                     00044600
044700         DECLARE MEXW001_CSR CURSOR WITH HOLD FOR                 00044700
044800          SELECT VEH_VIN_FULL_C                                   00044800
044900             ,   VEH_ORD_ID_C                                     00044900
045000             ,   DTA_DATA_SRC_C                                   00045000
045100             ,   BDT_MDL_YR_Y                                     00045100
045200             ,   DLR_DLR_C                                        00045200
045300             ,   WMI_WMI_C                                        00045300
045400             ,   VEH_LCL_PLT_C                                    00045400
045500             ,   VEH_LCL_BDYTYP_C                                 00045500
045600             ,   VEH_GBL_ORD_DLR_C                                00045600
045700             ,   VEH_GBL_SHIP_TO_C                                00045700
045800             ,   VEH_ORD_RCPT_Y                                   00045800
045900             ,   VEH_WDMO_FLEET_C                                 00045900
046000             ,   VEH_WDMO_ORD_TYP                                 00046000
046100             ,   VEH_CATALOG_C                                    00046100
046200             ,   VEH_GBL_CATALOG_C                                00046200
046300             ,   VEH_PO_Y                                         00046300
046400             ,   VEH_GEVIS_VL_C                                   00046400
046500             ,   COUNTRY_ISO3_C                                   00046500
046700            FROM MEXW001_VEH_ORDER                                00046700
046900           WHERE DTA_DATA_SRC_C      = :VEH-DTA-DATA-SRC-C        00046900
047100             AND BDT_MDL_YR_Y  BETWEEN :WS-CURR-MODEL-YY -4       00047100
047200                                   AND :WS-CURR-MODEL-YY +2       00047200
047300             AND VEH_ACTIVE_F        = "Y"                        00047300
047301             AND VEH_VIN_FULL_C      > " "                        00047301
047302             AND VEH_UPDT_S  BETWEEN   :WS-PREV-RUN-TIMESTAMP     00047302
047400                                 AND   :WS-CURR-DRBN-TIMESTAMP    00047400
047500             FOR READ ONLY                                        00047500
048000     END-EXEC.                                                    00048000
048010******************************************************************00048010
048020*  THIS CURSOR WILL BE USED TO READ THE MEXW001 AND THE MEXW003  *00048020
048030*  TABLES WHERE THE MODEL YEAR IS BETWEEN -4 & +2 OF THE CURRENT *00048030
048040*  MODEL YEAR AND THE MEXW003_VEH_STATUS TIMESTAMP IS BETWEEN THE*00048040
048041*  CURRENT TIMESTAMP AND THE LAST RUN TIMESTAMP.  THIS CURSOR    *00048041
048042*  WILL ALWAYS CHECK FOR THESE STATUSES:  00B, 30T, 40V, 80J,    *00048042
048043*  80V, 90U AND 90V.                                             *00048043
048070******************************************************************00048070
048100                                                                  00048100
048110     EXEC SQL                                                     00048110
048120         DECLARE MEXW003_CSR CURSOR WITH HOLD FOR                 00048120
048130          SELECT A.VEH_VIN_FULL_C                                 00048130
048140             ,   A.VEH_ORD_ID_C                                   00048140
048150             ,   A.DTA_DATA_SRC_C                                 00048150
048160             ,   A.BDT_MDL_YR_Y                                   00048160
048170             ,   A.DLR_DLR_C                                      00048170
048180             ,   A.WMI_WMI_C                                      00048180
048190             ,   A.VEH_LCL_PLT_C                                  00048190
048191             ,   A.VEH_LCL_BDYTYP_C                               00048191
048192             ,   A.VEH_GBL_ORD_DLR_C                              00048192
048193             ,   A.VEH_GBL_SHIP_TO_C                              00048193
048194             ,   A.VEH_ORD_RCPT_Y                                 00048194
048195             ,   A.VEH_WDMO_FLEET_C                               00048195
048196             ,   A.VEH_WDMO_ORD_TYP                               00048196
048197             ,   A.VEH_CATALOG_C                                  00048197
048198             ,   A.VEH_GBL_CATALOG_C                              00048198
048199             ,   A.VEH_PO_Y                                       00048199
048200             ,   A.VEH_GEVIS_VL_C                                 00048200
048201             ,   A.COUNTRY_ISO3_C                                 00048201
048203            FROM MEXW001_VEH_ORDER  A                             00048203
048204             ,   MEXW003_VEH_STATUS B                             00048204
048205           WHERE A.DTA_DATA_SRC_C      = :VEH-DTA-DATA-SRC-C      00048205
048207             AND A.DTA_DATA_SRC_C      = B.DTA_DATA_SRC_C         00048207
048208             AND A.VEH_ORD_ID_C        = B.VEH_ORD_ID_C           00048208
048209             AND A.BDT_MDL_YR_Y  BETWEEN :WS-CURR-MODEL-YY -4     00048209
048210                                     AND :WS-CURR-MODEL-YY +2     00048210
048211             AND A.VEH_ACTIVE_F        = "Y"                      00048211
048212             AND A.VEH_VIN_FULL_C      > " "                      00048212
048215             AND B.VST_UPDT_S   BETWEEN  :WS-PREV-RUN-TIMESTAMP   00048215
048216                                    AND  :WS-CURR-DRBN-TIMESTAMP  00048216
048220             AND B.STA_STATUS_C      IN ("00B","30T", "40V","80J",00048220
048221                                         "80V","90U", "90V")      00048221
048224             AND B.VST_CUR_STAT_F      = "Y"                      00048224
048225             AND B.VST_ACTIVE_F        = "Y"                      00048225
048226             FOR READ ONLY                                        00048226
048227     END-EXEC.                                                    00048227
048270                                                                  00048270
048271******************************************************************00048271
048272*  THIS CURSOR WILL BE USED TO READ THE MEXW001 AND THE MEXW008  *00048272
048273*  TABLES WHERE THE MODEL YEAR IS BETWEEN -4 & +2 OF THE CURRENT *00048273
048274*  MODEL YEAR AND THE MEXW008_VEH_RTL TIMESTAMP IS BETWEEN THE   *00048274
048275*  CURRENT TIMESTAMP AND THE LAST RUN TIMESTAMP.                 *00048275
048278******************************************************************00048278
048279     EXEC SQL                                                     00048279
048280         DECLARE MEXW008_CSR CURSOR WITH HOLD FOR                 00048280
048281          SELECT A.VEH_VIN_FULL_C                                 00048281
048282             ,   A.VEH_ORD_ID_C                                   00048282
048283             ,   A.DTA_DATA_SRC_C                                 00048283
048284             ,   A.BDT_MDL_YR_Y                                   00048284
048285             ,   A.DLR_DLR_C                                      00048285
048286             ,   A.WMI_WMI_C                                      00048286
048287             ,   A.VEH_LCL_PLT_C                                  00048287
048288             ,   A.VEH_LCL_BDYTYP_C                               00048288
048289             ,   A.VEH_GBL_ORD_DLR_C                              00048289
048290             ,   A.VEH_GBL_SHIP_TO_C                              00048290
048291             ,   A.VEH_ORD_RCPT_Y                                 00048291
048292             ,   A.VEH_WDMO_FLEET_C                               00048292
048293             ,   A.VEH_WDMO_ORD_TYP                               00048293
048294             ,   A.VEH_CATALOG_C                                  00048294
048295             ,   A.VEH_GBL_CATALOG_C                              00048295
048296             ,   A.VEH_PO_Y                                       00048296
048297             ,   A.VEH_GEVIS_VL_C                                 00048297
048298             ,   A.COUNTRY_ISO3_C                                 00048298
048300            FROM MEXW001_VEH_ORDER  A                             00048300
048301             ,   MEXW008_VEH_RTL    B                             00048301
048302           WHERE A.DTA_DATA_SRC_C      = :VEH-DTA-DATA-SRC-C      00048302
048303             AND A.DTA_DATA_SRC_C      = B.DTA_DATA_SRC_C         00048303
048304             AND A.VEH_ORD_ID_C        = B.VEH_ORD_ID_C           00048304
048305             AND A.BDT_MDL_YR_Y  BETWEEN :WS-CURR-MODEL-YY -4     00048305
048306                                     AND :WS-CURR-MODEL-YY +2     00048306
048307             AND A.VEH_ACTIVE_F        = "Y"                      00048307
048308             AND A.VEH_VIN_FULL_C      > " "                      00048308
048309             AND B.VRS_UPDT_S   BETWEEN  :WS-PREV-RUN-TIMESTAMP   00048309
048310                                    AND  :WS-CURR-DRBN-TIMESTAMP  00048310
048311             AND B.VRS_ACTIVE_F        = "Y"                      00048311
048312             FOR READ ONLY                                        00048312
048313     END-EXEC.                                                    00048313
048314******************************************************************00048314
048315* THIS CURSOR WILL BE USED TO JOIN THE MEXW001 AND MEXW008 TABLES 00048315
048316* WHERE THE VEHICLE WAS SOLD WITHIN THE PAST 12 MONTHS AND THE    00048316
048317* MODEL YEAR IS OLDER THAN 4 YEARS.                               00048317
048318******************************************************************00048318
048800                                                                  00048800
048900     EXEC SQL                                                     00048900
049000         DECLARE  SALE_CHK_CSR CURSOR WITH HOLD FOR               00049000
049100          SELECT  A.VEH_VIN_FULL_C                                00049100
049200                 ,A.VEH_ORD_ID_C                                  00049200
049300                 ,A.DTA_DATA_SRC_C                                00049300
049400                 ,A.BDT_MDL_YR_Y                                  00049400
049500                 ,A.WMI_WMI_C                                     00049500
049600                 ,A.VEH_LCL_PLT_C                                 00049600
049700                 ,A.VEH_LCL_BDYTYP_C                              00049700
049800                 ,A.VEH_GBL_ORD_DLR_C                             00049800
049900                 ,A.VEH_GBL_SHIP_TO_C                             00049900
050000                 ,A.VEH_ORD_RCPT_Y                                00050000
050100                 ,A.VEH_WDMO_FLEET_C                              00050100
050200                 ,A.VEH_WDMO_ORD_TYP                              00050200
050300                 ,A.VEH_CATALOG_C                                 00050300
050400                 ,A.VEH_GBL_CATALOG_C                             00050400
050500                 ,A.VEH_PO_Y                                      00050500
050600                 ,A.VEH_GEVIS_VL_C                                00050600
050700                 ,A.COUNTRY_ISO3_C                                00050700
050800            FROM  MEXW001_VEH_ORDER A                             00050800
050900                 ,MEXW008_VEH_RTL   B                             00050900
051000           WHERE  B.DTA_DATA_SRC_C =   :VRS-DTA-DATA-SRC-C        00051000
051100             AND  B.VRS_UPDT_S BETWEEN :WS-PREV-RUN-TIMESTAMP     00051100
051200                                   AND :WS-CURR-DRBN-TIMESTAMP    00051200
051300             AND  B.VRS_ACTIVE_F   = "Y"                          00051300
051400             AND  A.BDT_MDL_YR_Y   <   :WS-CURR-MODEL-YY -4       00051400
051500             AND  A.VEH_VIN_FULL_C > " "                          00051500
051600             AND  A.VEH_ORD_ID_C   = B.VEH_ORD_ID_C               00051600
051700             AND  A.DTA_DATA_SRC_C = B.DTA_DATA_SRC_C             00051700
051800         FOR READ ONLY                                            00051800
051900     END-EXEC                                                     00051900
052000******************************************************************00052000
052100* THIS CURSOR WILL BE USED TO SELECT ONE ROW FROM TABLE MEXW031   00052100
052200* FOR NON 'NA' AND NON 'EA' DATA SOURCES.  THE RETRIEVED VALUES   00052200
052300* WILL BE USED IN PLACE OF THE LOCAL BODY STYLE CODE THAT WAS     00052300
052400* OBTAINED FROM TABLE MEXW001.                                    00052400
052500******************************************************************00052500
052600     EXEC SQL                                                     00052600
052700         DECLARE  MEXW031_CSR CURSOR WITH HOLD FOR                00052700
052800         SELECT  OPT_OPTION_C                                     00052800
052900                ,VPT_PROD_TYP_C                                   00052900
053000           FROM  MEXW031_CATMAP                                   00053000
053100          WHERE  DTA_DATA_SRC_C    = :CTM-DTA-DATA-SRC-C          00053100
053200            AND  CTM_LCL_CATALOG_C = :CTM-LCL-CATALOG-C           00053200
053300            AND  OFM_OPTION_FAM_C IN ("BS", "CA")                 00053300
053400            OPTIMIZE FOR 1 ROW                                    00053400
053500         FOR READ ONLY                                            00053500
053600     END-EXEC                                                     00053600
053700                                                                  00053700
053800******************************************************************00053800
053900* THIS CURSOR IS BEING USED IN ORDER TO RETRIEVE THE MOST RECENT  00053900
054000* WHOLESALE GLOBAL DEALER FROM TABLE MEXW003 USING A "40V" STATUS 00054000
054100* CODE AND THE FTC QAD CURRENT DATA SOURCE (WD).                  00054100
054200******************************************************************00054200
054300     EXEC SQL                                                     00054300
054400        DECLARE  MEXW003_40V_CSR CURSOR WITH HOLD FOR             00054400
054500         SELECT  VST_GBL_LOC_C                                    00054500
054600           FROM  MEXW003_VEH_STATUS                               00054600
054700          WHERE  VEH_ORD_ID_C       = :VST-VEH-ORD-ID-C           00054700
054800            AND  DTA_DATA_SRC_C     = :VST-DTA-DATA-SRC-C         00054800
054900            AND  STA_STATUS_C       = :VST-STA-STATUS-C           00054900
055000            AND  VST_ACTIVE_F       = :VST-ACTIVE-F               00055000
055100            AND  VST_STAT_TYP_C     = :VST-STAT-TYP-C             00055100
055200            AND  VST_CUR_DATA_SRC_C = :VST-CUR-DATA-SRC-C         00055200
055300       ORDER BY  VST_STAT_Y  DESC                                 00055300
055400                ,VST_STATIC_ISRT_REC_S  DESC                      00055400
055500         FOR READ ONLY                                            00055500
055600     END-EXEC                                                     00055600
055700                                                                  00055700
055800******************************************************************00055800
055900*            LINKAGE SECTION                                      00055900
056000******************************************************************00056000
056100 LINKAGE SECTION.                                                 00056100
056200                                                                  00056200
056300******************************************************************00056300
056400*              P R O C E D U R E   D I V I S I O N               *00056400
056500******************************************************************00056500
056600 PROCEDURE DIVISION.                                              00056600
056700                                                                  00056700
056800******************************************************************00056800
056900*                        M A I N L I N E                          00056900
057100* ADDED STATEMENT TO MOVE 3 TO RETURN-CODE WHICH IS THE RESULT    00057100
057200* OF AN ORDER-ID AND PRODUCTION SOURCE GETTING A NOT FOUND COND-  00057200
057300* ITION WHEN EXWWSSTK SUBROUTINE WAS BEING CALLED. THE RETURN-    00057300
057400* CODE WILL BE CHECKED IN THE JCL AND IF IT'S 3, THEN AN EMAIL    00057400
057500* WILL BE SENT TO THE HELPDESK                                    00057500
057700******************************************************************00057700
057800 0000P-MAINLINE.                                                  00057800
057900                                                                  00057900
058000     PERFORM 0300P-OPEN-FILES                                     00058000
058010     PERFORM 0400P-INITIALIZE-OTHER                               00058010
058020     PERFORM 0700P-GET-SYSPARM-RECORD                             00058020
058030       UNTIL END-OF-SYSPARM-FILE                                  00058030
058200     PERFORM 6000P-CONCLUSION                                     00058200
058300     IF SEND-EMAIL                                                00058300
058400        MOVE 3 TO RETURN-CODE                                     00058400
058500     END-IF                                                       00058500
058600     GOBACK                                                       00058600
058700     .                                                            00058700
058710******************************************************************00058710
058720* PROGRAM SPECIFIC INITIALIZATION                                 00058720
058730******************************************************************00058730
058740 0300P-OPEN-FILES.                                                00058740
058741                                                                  00058741
058742     OPEN EXTEND AUDIT-FILE                                       00058742
058743                 VINCENT-OUT                                      00058743
058744     OPEN INPUT  INPUT-PARM                                       00058744
058750     .                                                            00058750
058800                                                                  00058800
060900******************************************************************00060900
061000* PROGRAM SPECIFIC INITIALIZATION                                 00061000
061100******************************************************************00061100
061200 0400P-INITIALIZE-OTHER.                                          00061200
061300                                                                  00061300
061600     INITIALIZE  WS-VINCENT-DETAIL-RECORD                         00061600
061700                 WS-SWITCHES                                      00061700
061800                 WS-VARIABLES                                     00061800
061900                 WS-COUNTERS                                      00061900
062000                                                                  00062000
062400                                                                  00062400
062410     PERFORM 0500P-GET-TIMESTMP                                   00062410
062500     PERFORM 0600P-GET-PROGAM-PARMS                               00062500
062600     PERFORM 0750P-WRITE-AUDIT-HEADER                             00062600
064700     PERFORM 0800P-POPULATE-VINCENT-HEADER                        00064700
064900                                                                  00064900
065300     .                                                            00065300
065301******************************************************************00065301
065302* GET CURRENT TIME STAMP                                          00065302
065303******************************************************************00065303
065304 0500P-GET-TIMESTMP.                                              00065304
065305                                                                  00065305
065315     PERFORM 0550P-GET-CURRENT-DATE-TIME                          00065315
065316     PERFORM 7000P-OBTAIN-DRBN-TIMESTAMP                          00065316
065317     MOVE WS-CURR-DRBN-TIMESTAMP       TO WS-HOLD-CURR-TIMESTAMP  00065317
065318     MOVE WS-DRBN-YEAR                 TO WS-CURR-MODEL-YY        00065318
065319     MOVE WS-CURR-MODEL-YY             TO WS-HOLD-MDL-YR-Y        00065319
065320                                                                  00065320
065323     .                                                            00065323
065324******************************************************************00065324
065325* GET CURRENT TIME STAMP                                          00065325
065326******************************************************************00065326
065327 0550P-GET-CURRENT-DATE-TIME.                                     00065327
065328                                                                  00065328
065329     ACCEPT SV-CURRENT-DATE            FROM DATE                  00065329
065330     ACCEPT SV-CURRENT-TIME            FROM TIME                  00065330
065331                                                                  00065331
065332     MOVE SV-CURRENT-DATE-YY           TO SV-FORMAT-DATE-YY       00065332
065333     MOVE SV-CURRENT-DATE-MM           TO SV-FORMAT-DATE-MM       00065333
065334     MOVE SV-CURRENT-DATE-DD           TO SV-FORMAT-DATE-DD       00065334
065335     MOVE SV-CURRENT-TIME-HH           TO SV-FORMAT-TIME-HH       00065335
065336     MOVE SV-CURRENT-TIME-MM           TO SV-FORMAT-TIME-MM       00065336
065337     MOVE SV-CURRENT-TIME-SS           TO SV-FORMAT-TIME-SS       00065337
065338     .                                                            00065338
065339******************************************************************00065339
065340* RETRIEVE BATCH NUMBER AND LAST RUN TIMESTAMPS                   00065340
065341******************************************************************00065341
065342 0600P-GET-PROGAM-PARMS.                                          00065342
065343                                                                  00065343
065344     MOVE LIT-SYSTEM-ID                TO GNT-SYSTEM-CD           00065344
065345     MOVE LIT-TABLE-ID                 TO GNT-TABLE-ID            00065345
065346     MOVE LIT-KEY-DATA-BATCHCTL        TO GNT-KEY-DATA            00065346
065347     PERFORM 7010P-SELECT-MEXS016                                 00065347
065348     MOVE GNT-ATTRIBUTE-DATA (1:5)     TO WS-PREV-BATCH-NBR       00065348
065349                                                                  00065349
065350     IF WS-PREV-BATCH-NBR               = 99999                   00065350
065351        MOVE 0                         TO WS-PREV-BATCH-NBR       00065351
065353     END-IF                                                       00065353
065354                                                                  00065354
065355     COMPUTE WS-CURRENT-BATCH-NBR       = WS-PREV-BATCH-NBR + 1   00065355
065356                                                                  00065356
065357     MOVE LIT-KEY-DATA-TIMESTAMP       TO GNT-KEY-DATA            00065357
065358     PERFORM 7010P-SELECT-MEXS016                                 00065358
065359     MOVE GNT-ATTRIBUTE-DATA           TO WS-PREV-RUN-TIMESTAMP   00065359
065360     .                                                            00065360
065370******************************************************************00065370
065380* PROCESS DATA SOURCE SYSPARMS = MAIN DRIVER OF THE PROGRAM       00065380
065381* RETRIEVES THE DATASOURCE FROM THE PARM AND MOVES IT TO THE DATA 00065381
065382* SOURCES FOR THE CURSORS.                                        00065382
065390******************************************************************00065390
065400 0700P-GET-SYSPARM-RECORD.                                        00065400
065500                                                                  00065500
065580     SET NOT-END-OF-SYSPARM-FILE       TO TRUE                    00065580
065590     READ INPUT-PARM                                              00065590
065600     INTO PARM-DETAIL                                             00065600
065700       AT END                                                     00065700
065800          SET END-OF-SYSPARM-FILE      TO TRUE                    00065800
065900     END-READ                                                     00065900
065910                                                                  00065910
065920     EVALUATE TRUE                                                00065920
066000        WHEN END-OF-SYSPARM-FILE                                  00066000
066010         AND WS-NBR-SYSPARM-RECS-READ  <= ZERO                    00066010
066100             MOVE "MISSING SYSPARM RECORDS"                       00066100
066200                                       TO ABEND-MSG               00066200
066300             MOVE "PARAGRAPH 0700P"    TO ABEND-MSG-2             00066300
066500             PERFORM 9999I-ABEND                                  00066500
066600        WHEN END-OF-SYSPARM-FILE                                  00066600
066601             CONTINUE                                             00066601
066602        WHEN OTHER                                                00066602
066603             ADD +1                    TO WS-NBR-SYSPARM-RECS-READ00066603
066604             MOVE INPUT-SOURCE         TO VEH-DTA-DATA-SRC-C      00066604
066605                                          VST-DTA-DATA-SRC-C      00066605
066606                                          VRS-DTA-DATA-SRC-C      00066606
066607             SET MEXW001-CSR-NOT-FOUND TO TRUE                    00066607
066608             SET MEXW003-CSR-NOT-FOUND TO TRUE                    00066608
066610             SET MEXW008-CSR-NOT-FOUND TO TRUE                    00066610
066611             SET SALE-CHK-NOT-FOUND    TO TRUE                    00066611
066612             SET MEXW003-NOT-FOUND     TO TRUE                    00066612
066613             PERFORM 1000P-PROCESS-CURSORS                        00066613
066620     END-EVALUATE                                                 00066620
066700     .                                                            00066700
066701/*****************************************************************00066701
066702* WRITE AUDIT CHECKPOINT LINES                                   *00066702
066703******************************************************************00066703
066704  0750P-WRITE-AUDIT-HEADER.                                       00066704
066705                                                                  00066705
066706     MOVE PL-PGM-NAME                  TO AUDIT-RECORD            00066706
066707     MOVE "AUDIT REPORT"               TO AUDIT-RECORD (10:)      00066707
066708     WRITE AUDIT-RECORD                                           00066708
066709                                                                  00066709
066710     MOVE "PROGRAM VERSION            :"                          00066710
066711                                       TO AUDIT-LABEL             00066711
066712     MOVE PAN-VALET                    TO AUDIT-DATA              00066712
066713     WRITE AUDIT-RECORD                                           00066713
066714                                                                  00066714
066715     MOVE WHEN-COMPILED                TO SV-COMPILE-DATE-TIME    00066715
066716     MOVE "PROGRAM COMPILE DATE/TIME  :"                          00066716
066717                                       TO AUDIT-LABEL             00066717
066718     MOVE SV-COMPILE-DATE              TO AUDIT-DATA              00066718
066719     MOVE SV-COMPILE-TIME              TO AUDIT-DATA (10:)        00066719
066720     WRITE AUDIT-RECORD                                           00066720
066721                                                                  00066721
066722     MOVE "PROGRAM START   DATE/TIME  :"                          00066722
066723                                       TO AUDIT-LABEL             00066723
066724     MOVE SV-FORMAT-DATE               TO AUDIT-DATA              00066724
066725     MOVE SV-FORMAT-TIME               TO AUDIT-DATA (10:)        00066725
066726     WRITE AUDIT-RECORD                                           00066726
066727     .                                                            00066727
066728                                                                  00066728
066729******************************************************************00066729
066730* POPULATE THE VINCENT HEADER RECORD                              00066730
066731******************************************************************00066731
066740 0800P-POPULATE-VINCENT-HEADER.                                   00066740
066741                                                                  00066741
066743      MOVE 1                           TO WS-COUNT-LINE-NBR       00066743
066744                                                                  00066744
066747      STRING WS-DRBN-YEAR                                         00066747
066748             WS-DRBN-MONTH                                        00066748
066749             WS-DRBN-DAY                                          00066749
066750      DELIMITED BY SIZE INTO                                      00066750
066753             VNT-HDR-CURR-DATE                                    00066753
066754      END-STRING                                                  00066754
066755                                                                  00066755
066756      STRING WS-DRBN-HOUR                                         00066756
066757             WS-DRBN-MINUTE                                       00066757
066758             WS-DRBN-SECOND                                       00066758
066759      DELIMITED BY SIZE INTO                                      00066759
066761             VNT-HDR-CURR-TIME                                    00066761
066762      END-STRING                                                  00066762
066763                                                                  00066763
066764      MOVE LIT-WDMHAEXT                TO VNT-HDR-REC-TYPE        00066764
066766      MOVE WS-CURRENT-BATCH-NBR        TO VNT-HDR-CURR-BATCH-NBR  00066766
066768      MOVE WS-PREV-BATCH-NBR           TO VNT-HDR-PREV-BATCH-NBR  00066768
066770      MOVE LOW-VALUES                  TO VNT-HDR-LOW-VALUES      00066770
066772                                                                  00066772
066773     MOVE VINCENT-HEADER(38:)          TO VINCENT-RECORD          00066773
066774     WRITE VINCENT-RECORD                                         00066774
066775                                                                  00066775
066780     .                                                            00066780
066800******************************************************************00066800
066900* START OF THE PROCESSING OF THE MAIN CURSORS                     00066900
067000******************************************************************00067000
067100 1000P-PROCESS-CURSORS.                                           00067100
067101                                                                  00067101
067110     PERFORM 1100P-PROCESS-MEXW001-CSR                            00067110
067123     PERFORM 1200P-PROCESS-MEXW003-CSR                            00067123
067124     PERFORM 1300P-PROCESS-MEXW008-CSR                            00067124
067125     PERFORM 1400P-PROCESS-SALE-CHK-CSR                           00067125
067127     .                                                            00067127
067128******************************************************************00067128
067129* PROCESSING OF THE MEXW001_CSR                                   00067129
067130******************************************************************00067130
067131 1100P-PROCESS-MEXW001-CSR.                                       00067131
067132                                                                  00067132
067133     PERFORM 8000P-OPEN-MEXW001-CSR                               00067133
067137     PERFORM 8005P-FETCH-MEXW001-CSR                              00067137
067138     PERFORM 2000P-PROCESS-GEVIS-VEHICLE                          00067138
067139       UNTIL MEXW001-CSR-NOT-FOUND                                00067139
067140     PERFORM 8007P-CLOSE-MEXW001-CSR                              00067140
067142     .                                                            00067142
067143******************************************************************00067143
067144* PROCESSING OF THE MEXW003_CSR                                   00067144
067145******************************************************************00067145
067146 1200P-PROCESS-MEXW003-CSR.                                       00067146
067147                                                                  00067147
067148     PERFORM 8400P-OPEN-MEXW003-CSR                               00067148
067149     PERFORM 8405P-FETCH-MEXW003-CSR                              00067149
067150     PERFORM 2000P-PROCESS-GEVIS-VEHICLE                          00067150
067151        UNTIL MEXW003-CSR-NOT-FOUND                               00067151
067152     PERFORM 8407P-CLOSE-MEXW003-CSR                              00067152
067153     .                                                            00067153
067154******************************************************************00067154
067155* PROCESSING OF THE MEXW008_CSR                                   00067155
067156******************************************************************00067156
067157 1300P-PROCESS-MEXW008-CSR.                                       00067157
067158                                                                  00067158
067159     PERFORM 8500P-OPEN-MEXW008-CSR                               00067159
067160     PERFORM 8505P-FETCH-MEXW008-CSR                              00067160
067161     PERFORM 2000P-PROCESS-GEVIS-VEHICLE                          00067161
067162        UNTIL MEXW008-CSR-NOT-FOUND                               00067162
067163     PERFORM 8507P-CLOSE-MEXW008-CSR                              00067163
067164     .                                                            00067164
067165******************************************************************00067165
067166* PROCESSING OF THE SALE_CHK_CSR                                  00067166
067167******************************************************************00067167
067168 1400P-PROCESS-SALE-CHK-CSR.                                      00067168
067169                                                                  00067169
067170     PERFORM 8100P-OPEN-SALE-CHK-CSR                              00067170
067171     PERFORM 8105P-FETCH-SALE-CHK-CSR                             00067171
067172     PERFORM 2000P-PROCESS-GEVIS-VEHICLE                          00067172
067173        UNTIL SALE-CHK-NOT-FOUND                                  00067173
067174     PERFORM 8107P-CLOSE-SALE-CHK-CSR                             00067174
067175     .                                                            00067175
067176***************************************************************** 00067176
067177* THE FIRST STEP WILL BE TO DETERMINE WHETHER OR NOT THE          00067177
067178* VEHICLE'S CURRENT STOCKING DEALER IS WDMO BASED. IF IT IS,      00067178
067179* THEN FURTHER PROCESSING WILL CONTINUE.  IF IT IS NOT, THEN THE  00067179
067180* VEHICLE WILL BE SKIPPED AND THEN NEXT ONE WILL BE SELECTED.     00067180
067181* THIS PARAGRAPH WILL BE PERFORMED UNTIL THERE ARE NO MORE VEH-   00067181
067182* ICLES FOR A PRODCUTION SOURCE.                                  00067182
067183* A CHECK FOR SSTK-SUCCESSFUL HAS BEEN                            00067183
067184* ADDED BECAUSE IT IS POSSIBLE THAT WHEN CALLING SSTK, WE COULD   00067184
067185* GET A +100 FOR THE STOCKING DEALER.  IF THAT'S THE CASE, WE     00067185
067186* NEED TO SKIP THE PROCESSING AND FETCH THE NEXT RECORD.          00067186
067187***************************************************************** 00067187
067188 2000P-PROCESS-GEVIS-VEHICLE.                                     00067188
067189                                                                  00067189
067190     PERFORM 2105P-VERIFY-WDMO-DEALER                             00067190
067191     IF  WDMO-DEALER                                              00067191
067192     AND SSTK-SUCCESSFUL                                          00067192
067193         PERFORM 2120P-PROCESS-GEVIS-DETAIL-REC                   00067193
067194     END-IF                                                       00067194
067195                                                                  00067195
067196     EVALUATE TRUE                                                00067196
067197        WHEN MEXW001-CSR-FOUND                                    00067197
067198             PERFORM 8005P-FETCH-MEXW001-CSR                      00067198
067199        WHEN MEXW003-CSR-FOUND                                    00067199
067200             PERFORM 8405P-FETCH-MEXW003-CSR                      00067200
067201        WHEN MEXW008-CSR-FOUND                                    00067201
067202             PERFORM 8505P-FETCH-MEXW008-CSR                      00067202
067203        WHEN SALE-CHK-FOUND                                       00067203
067204             PERFORM 8105P-FETCH-SALE-CHK-CSR                     00067204
067210     END-EVALUATE                                                 00067210
067300     .                                                            00067300
070101                                                                  00070101
070391***************************************************************** 00070391
070392* A CALL IS PLACED TO SUBROUTINE EXWWSSTK IN ORDER TO OBTAIN THE  00070392
070393* CURRENT STOCKING DEALER FOR A VEHICLE.  AFTERWARDS, USING THE   00070393
070394* CURRENT STOCKING DEALER (IF ONE WAS FOUND), A CALL WILL BE      00070394
070395* PLACED TO TABLE MEXW035 TO DETERMINE WHETHER OR NOT THE STOCK-  00070395
070396* ING DEALER IS WDMO BASED.                                       00070396
070397***************************************************************** 00070397
070398 2105P-VERIFY-WDMO-DEALER.                                        00070398
070399                                                                  00070399
070400     PERFORM 2110P-CALL-EXWWSSTK                                  00070400
070401     IF SSTK-SUCCESSFUL                                           00070401
070402        MOVE SSTK-GBL-STK-DLR-C        TO                         00070402
070403                                      WS-VST-GBL-LOC-C-REFORMAT   00070403
070404        MOVE WS-VST-GBL-LOC-C-REFORMAT TO DLR-DLR-DLR-C           00070404
070405        PERFORM 7020P-GET-MEXW035-DATA                            00070405
070406        IF MEXW035-FOUND                                          00070406
070407           IF DLR-SUB-SUBLVL1-C         = LIT-WDM                 00070407
070408              SET WDMO-DEALER          TO TRUE                    00070408
070409           ELSE                                                   00070409
070410              SET NOT-WDMO-DEALER      TO TRUE                    00070410
070411           END-IF                                                 00070411
070412        ELSE                                                      00070412
070413           SET NOT-WDMO-DEALER         TO TRUE                    00070413
070436           PERFORM 2117P-MISSING-MEXW035-ROW                      00070436
070437        END-IF                                                    00070437
070438     END-IF                                                       00070438
070439     .                                                            00070439
070471***************************************************************** 00070471
070472* USING PRODUCTION SOURCE AND ORDER-ID, A CALL WILL NOW BE PLACED 00070472
070473* TO SUBROUTINE EXWWSSTK TO OBTAIN THE CURRENT STOCKING DEALER,   00070473
070474* CURRENT STOCKING DEALER STATUS CODE AND CURRENT STOCKING        00070474
070475* DEALER STATUS DATE.                                             00070475
070476***************************************************************** 00070476
070477 2110P-CALL-EXWWSSTK.                                             00070477
070478                                                                  00070478
070479     INITIALIZE SSTK-I-O-DATA                                     00070479
070480     SET SSTK-INQUIRY-MODE             TO TRUE                    00070480
070481     MOVE VEH-ORD-ID-C                 TO SSTK-VEH-ORD-ID-C       00070481
070482     MOVE VEH-DTA-DATA-SRC-C           TO SSTK-DTA-DATA-SRC-C     00070482
070483     CALL  "EXWWSSTK"               USING SSTK-I-O-DATA           00070483
070484                                                                  00070484
070485     EVALUATE TRUE                                                00070485
070486        WHEN SSTK-SUCCESSFUL                                      00070486
070487             ADD 1                     TO WS-NBR-EXWWSSTK-CALLS   00070487
070488        WHEN SSTK-DB2-ERROR                                       00070488
070489             PERFORM 2115P-SSTK-FATAL-ERROR                       00070489
070490     END-EVALUATE                                                 00070490
070491     .                                                            00070491
070492                                                                  00070492
070493******************************************************************00070493
070494* THIS PARAGRAPH HANDLES THE FATAL ERROR TOMBSTONE FORMATTING OF  00070494
070495* THE CALL THAT WAS PLACED TO SUBROUTINE EXWWSSTK.                00070495
070496******************************************************************00070496
070497 2115P-SSTK-FATAL-ERROR.                                          00070497
070498                                                                  00070498
070499     MOVE SPACES                       TO AUDIT-RECORD            00070499
070500     WRITE AUDIT-RECORD                                           00070500
070501                                                                  00070501
070502     MOVE "PGM NAME: "                 TO AUDIT-LABEL-MSG         00070502
070503     MOVE SSTK-PGM-ID                  TO AUDIT-DATA-MSG          00070503
070504     WRITE AUDIT-RECORD              FROM AUDIT-RECORD-MSG        00070504
070505                                                                  00070505
070506     MOVE "RET CODE: "                 TO AUDIT-LABEL-MSG         00070506
070507     MOVE SSTK-RETURN-CD               TO AUDIT-DATA-MSG          00070507
070508     WRITE AUDIT-RECORD              FROM AUDIT-RECORD-MSG        00070508
070509                                                                  00070509
070510     MOVE "PARAGRAPH: "                TO AUDIT-LABEL-MSG         00070510
070511     MOVE SSTK-PARAGRAPH               TO AUDIT-DATA-MSG          00070511
070512     WRITE AUDIT-RECORD              FROM AUDIT-RECORD-MSG        00070512
070513                                                                  00070513
070514     MOVE SPACES                       TO AUDIT-RECORD            00070514
070515     WRITE AUDIT-RECORD                                           00070515
070516                                                                  00070516
070517     MOVE "TBL NAME1: "                TO AUDIT-LABEL-MSG         00070517
070518     MOVE SSTK-DB2-TABLE1              TO AUDIT-DATA-MSG          00070518
070519     WRITE AUDIT-RECORD              FROM AUDIT-RECORD-MSG        00070519
070520                                                                  00070520
070521     IF SSTK-DB2-TABLE2                 > SPACES                  00070521
070522        MOVE "TBL NAME2: "             TO AUDIT-LABEL-MSG         00070522
070523        MOVE SSTK-DB2-TABLE2           TO AUDIT-DATA-MSG          00070523
070524        WRITE AUDIT-RECORD           FROM AUDIT-RECORD-MSG        00070524
070525     END-IF                                                       00070525
070526                                                                  00070526
070527     IF SSTK-DB2-TABLE3                 > SPACES                  00070527
070528        MOVE "TBL NAME3: "             TO AUDIT-LABEL-MSG         00070528
070529        MOVE SSTK-DB2-TABLE3           TO AUDIT-DATA-MSG          00070529
070530        WRITE AUDIT-RECORD           FROM AUDIT-RECORD-MSG        00070530
070531     END-IF                                                       00070531
070532                                                                  00070532
070533     IF SSTK-DB2-TABLE4                 > SPACES                  00070533
070534        MOVE "TBL NAME4: "             TO AUDIT-LABEL-MSG         00070534
070535        MOVE SSTK-DB2-TABLE4           TO AUDIT-DATA-MSG          00070535
070536        WRITE AUDIT-RECORD           FROM AUDIT-RECORD-MSG        00070536
070537     END-IF                                                       00070537
070538                                                                  00070538
070539     IF SSTK-DB2-TABLE5                 > SPACES                  00070539
070540        MOVE "TBL NAME5: "             TO AUDIT-LABEL-MSG         00070540
070541        MOVE SSTK-DB2-TABLE5           TO AUDIT-DATA-MSG          00070541
070542        WRITE AUDIT-RECORD           FROM AUDIT-RECORD-MSG        00070542
070543     END-IF                                                       00070543
070544                                                                  00070544
070545     MOVE SPACES                       TO AUDIT-RECORD            00070545
070546     WRITE AUDIT-RECORD                                           00070546
070547                                                                  00070547
070548     MOVE "HOST VAR1: "                TO AUDIT-LABEL-MSG         00070548
070549     MOVE SSTK-HOST-VAR1               TO AUDIT-DATA-MSG          00070549
070550     WRITE AUDIT-RECORD              FROM AUDIT-RECORD-MSG        00070550
070551                                                                  00070551
070552     IF SSTK-HOST-VAR2                  > SPACES                  00070552
070553        MOVE "HOST VAR2: "             TO AUDIT-LABEL-MSG         00070553
070554        MOVE SSTK-HOST-VAR2            TO AUDIT-DATA-MSG          00070554
070555        WRITE AUDIT-RECORD           FROM AUDIT-RECORD-MSG        00070555
070556     END-IF                                                       00070556
070557                                                                  00070557
070558     IF SSTK-HOST-VAR3                  > SPACES                  00070558
070559        MOVE "HOST VAR3: "             TO AUDIT-LABEL-MSG         00070559
070560        MOVE SSTK-HOST-VAR3            TO AUDIT-DATA-MSG          00070560
070561        WRITE AUDIT-RECORD           FROM AUDIT-RECORD-MSG        00070561
070562     END-IF                                                       00070562
070563                                                                  00070563
070564     IF SSTK-HOST-VAR4                  > SPACES                  00070564
070565        MOVE "HOST VAR4: "             TO AUDIT-LABEL-MSG         00070565
070566        MOVE SSTK-HOST-VAR4            TO AUDIT-DATA-MSG          00070566
070567        WRITE AUDIT-RECORD           FROM AUDIT-RECORD-MSG        00070567
070568     END-IF                                                       00070568
070569                                                                  00070569
070570     IF SSTK-HOST-VAR5                  > SPACES                  00070570
070571        MOVE "HOST VAR5: "             TO AUDIT-LABEL-MSG         00070571
070572        MOVE SSTK-HOST-VAR5            TO AUDIT-DATA-MSG          00070572
070573        WRITE AUDIT-RECORD           FROM AUDIT-RECORD-MSG        00070573
070574     END-IF                                                       00070574
070575                                                                  00070575
070576     IF SSTK-HOST-VAR6                  > SPACES                  00070576
070577        MOVE "HOST VAR6: "             TO AUDIT-LABEL-MSG         00070577
070578        MOVE SSTK-HOST-VAR6            TO AUDIT-DATA-MSG          00070578
070579        WRITE AUDIT-RECORD           FROM AUDIT-RECORD-MSG        00070579
070580     END-IF                                                       00070580
070581                                                                  00070581
070582     IF SSTK-HOST-VAR7                  > SPACES                  00070582
070583        MOVE "HOST VAR7: "             TO AUDIT-LABEL-MSG         00070583
070584        MOVE SSTK-HOST-VAR7            TO AUDIT-DATA-MSG          00070584
070585        WRITE AUDIT-RECORD           FROM AUDIT-RECORD-MSG        00070585
070586     END-IF                                                       00070586
070587                                                                  00070587
070588     IF SSTK-HOST-VAR8                  > SPACES                  00070588
070589        MOVE "HOST VAR8: "             TO AUDIT-LABEL-MSG         00070589
070590        MOVE SSTK-HOST-VAR8            TO AUDIT-DATA-MSG          00070590
070591        WRITE AUDIT-RECORD           FROM AUDIT-RECORD-MSG        00070591
070592     END-IF                                                       00070592
070593                                                                  00070593
070594     MOVE SPACES                       TO AUDIT-RECORD            00070594
070595     WRITE AUDIT-RECORD                                           00070595
070596                                                                  00070596
070597     MOVE "SQL CODE: "                 TO AUDIT-LABEL-MSG         00070597
070598     MOVE SSTK-SQL-RETURN-CODE         TO WS-PROCESS-SQLCODE-EDIT 00070598
070599     MOVE WS-PROCESS-SQLCODE-EDIT      TO AUDIT-DATA-MSG          00070599
070600     WRITE AUDIT-RECORD              FROM AUDIT-RECORD-MSG        00070600
070601                                                                  00070601
070602     IF SSTK-SQL-WARNING                > SPACES                  00070602
070603        MOVE "SQL-WARN: "              TO AUDIT-LABEL-MSG         00070603
070604        MOVE  SSTK-SQL-WARNING         TO AUDIT-DATA-MSG          00070604
070605        WRITE AUDIT-RECORD           FROM AUDIT-RECORD-MSG        00070605
070606     END-IF                                                       00070606
070607                                                                  00070607
070608     MOVE "SQL-FUNC: "                 TO AUDIT-LABEL-MSG         00070608
070609     MOVE SSTK-SQL-FUNCTION            TO AUDIT-DATA-MSG          00070609
070610     WRITE AUDIT-RECORD              FROM AUDIT-RECORD-MSG        00070610
070611                                                                  00070611
070612     MOVE "SQL-MSG1: "                 TO AUDIT-LABEL-MSG         00070612
070613     MOVE  SSTK-SQL-MSG1               TO AUDIT-DATA-MSG          00070613
070614     WRITE AUDIT-RECORD              FROM AUDIT-RECORD-MSG        00070614
070615                                                                  00070615
070616     MOVE "SQL-MSG2: "                 TO AUDIT-LABEL-MSG         00070616
070617     MOVE SSTK-SQL-MSG2                TO AUDIT-DATA-MSG          00070617
070618     WRITE AUDIT-RECORD              FROM AUDIT-RECORD-MSG        00070618
070619                                                                  00070619
070620     MOVE "SQL-MSG3: "                 TO AUDIT-LABEL-MSG         00070620
070621     MOVE SSTK-SQL-MSG3                TO AUDIT-DATA-MSG          00070621
070622     WRITE AUDIT-RECORD              FROM AUDIT-RECORD-MSG        00070622
070623                                                                  00070623
070624     MOVE "SQL-MSG4: "                 TO AUDIT-LABEL-MSG         00070624
070625     MOVE SSTK-SQL-MSG4                TO AUDIT-DATA-MSG          00070625
070626     WRITE AUDIT-RECORD              FROM AUDIT-RECORD-MSG        00070626
070627                                                                  00070627
070628     MOVE SPACES                       TO AUDIT-RECORD            00070628
070629     WRITE AUDIT-RECORD                                           00070629
070630                                                                  00070630
070631     IF SSTK-SQL-RETURN-CODE            = 100                     00070631
070632        SET SEND-EMAIL                 TO TRUE                    00070632
070633        ADD 1                          TO                         00070633
070634                                    WS-NBR-EXWWSSTK-NOTFOUND-CALLS00070634
070635     ELSE                                                         00070635
070636        CALL "COREDUMP"                                           00070636
070637     END-IF                                                       00070637
070638     .                                                            00070638
070639******************************************************************00070639
070640* IF A CALL TO TABLE MEXW035 RESULTED IN A SQL +100 (NOT FOUND)   00070640
070641* CONDITION, THE INFORMATION WILL BE WRITTEN OUT TO THE AUDIT     00070641
070642* REPORT AND RETURN-CODE WILL BE SET TO 3, SO THAT AN EMAIL       00070642
070643* MESSAGE WILL BE SENT TO THE GEVIS HELPDESK TO INFORM THEM TO    00070643
070644* LOOK AT THE AUDIT REPORT.                                       00070644
070645******************************************************************00070645
070646 2117P-MISSING-MEXW035-ROW.                                       00070646
070647                                                                  00070647
070648     MOVE SPACES                       TO AUDIT-RECORD            00070648
070649     WRITE AUDIT-RECORD                                           00070649
070650                                                                  00070650
070651     MOVE "MISSING DEALER ON MEXW035:  "                          00070651
070652                                       TO AUDIT-LABEL             00070652
070653     WRITE AUDIT-RECORD                                           00070653
070654                                                                  00070654
070655     MOVE "DEALER CODE:         "      TO AUDIT-LABEL             00070655
070657     MOVE DLR-DLR-DLR-C                TO AUDIT-DATA              00070657
070659     WRITE AUDIT-RECORD                                           00070659
070660                                                                  00070660
070661     MOVE "ASSOCIATED VIN:      "      TO AUDIT-LABEL             00070661
070663     MOVE VEH-VIN-FULL-C               TO AUDIT-DATA              00070663
070665     WRITE AUDIT-RECORD                                           00070665
070666                                                                  00070666
070667     ADD 1                             TO                         00070667
070668                                     WS-NBR-MEXW035-NOTFOUND-CALLS00070668
070669     .                                                            00070669
070670***************************************************************** 00070670
070671* AT THIS POINT, THE VEHICLE HAS BEEN IDENTIFED AS HAVING A       00070671
070672* CURRENT STOCKING DEALER THAT IS CLASSIFIED AS WDMO.  NOW, OTHER 00070672
070673* DATA WILL BE GATHERED FOR THE VEHICLE AND THEN MOVED AND        00070673
070674* WRITTEN TO THE OUTPUT FILE.                                     00070674
070675*                                                                 00070675
070676***************************************************************** 00070676
070677 2120P-PROCESS-GEVIS-DETAIL-REC.                                  00070677
070678                                                                  00070678
070680     MOVE LIT-E                        TO WS-DTL-VEH-DIVISION-C   00070680
070681     PERFORM 2125P-PROCESS-WERS-STRING                            00070681
070682                                                                  00070682
070683     PERFORM 2130P-MOVE-MEXW001-TO-DTL                            00070683
070684     PERFORM 2135P-OBTAIN-RETAIL-DATA                             00070684
070685     PERFORM 2142P-MOVE-SSTK-CURRENT-TO-DTL                       00070685
070686     PERFORM 2150P-OBTAIN-WHOLESALE-DATA                          00070686
070687     PERFORM 2160P-OBTAIN-WERS-DATA                               00070687
070688                                                                  00070688
070689     MOVE LIT-20T                      TO WS-VST-STA-STATUS-C     00070689
070690     PERFORM 2198P-GET-MEXW003-STATUSES                           00070690
070691                                                                  00070691
070692     IF MEXW003-FOUND                                             00070692
070693        STRING VST-STAT-Y(1:4)                                    00070693
070694               VST-STAT-Y(6:2)                                    00070694
070695               VST-STAT-Y(9:2)                                    00070695
070696        DELIMITED BY SIZE INTO                                    00070696
070697               WS-DTL-VEH-SCHD-VST-TARGET-Y                       00070697
070698        END-STRING                                                00070698
070699     END-IF                                                       00070699
070700                                                                  00070700
070701     MOVE LIT-30R                      TO WS-VST-STA-STATUS-C     00070701
070702     PERFORM 2198P-GET-MEXW003-STATUSES                           00070702
070703                                                                  00070703
070704     IF MEXW003-FOUND                                             00070704
070705        STRING VST-STAT-Y(1:4)                                    00070705
070706               VST-STAT-Y(6:2)                                    00070706
070707               VST-STAT-Y(9:2)                                    00070707
070708        DELIMITED BY SIZE INTO                                    00070708
070709               WS-DTL-VEH-PRODUCE-VST-STAT-Y                      00070709
070710        END-STRING                                                00070710
070711     ELSE                                                         00070711
070712        MOVE LIT-30P                   TO WS-VST-STA-STATUS-C     00070712
070713        PERFORM 2198P-GET-MEXW003-STATUSES                        00070713
070714                                                                  00070714
070715        IF MEXW003-FOUND                                          00070715
070716           STRING VST-STAT-Y(1:4)                                 00070716
070717                  VST-STAT-Y(6:2)                                 00070717
070718                  VST-STAT-Y(9:2)                                 00070718
070719           DELIMITED BY SIZE INTO                                 00070719
070720                  WS-DTL-VEH-PRODUCE-VST-STAT-Y                   00070720
070721           END-STRING                                             00070721
070722        END-IF                                                    00070722
070723     END-IF                                                       00070723
070724                                                                  00070724
070725     MOVE LIT-30T                      TO WS-VST-STA-STATUS-C     00070725
070726     PERFORM 2198P-GET-MEXW003-STATUSES                           00070726
070727                                                                  00070727
070728     IF MEXW003-FOUND                                             00070728
070729        STRING VST-STAT-Y(1:4)                                    00070729
070730               VST-STAT-Y(6:2)                                    00070730
070731               VST-STAT-Y(9:2)                                    00070731
070732        DELIMITED BY SIZE INTO                                    00070732
070733               WS-DTL-VEH-RELEASE-VST-STAT-Y                      00070733
070734        END-STRING                                                00070734
070735     END-IF                                                       00070735
070736                                                                  00070736
070737     MOVE LIT-80F                      TO WS-VST-STA-STATUS-C     00070737
070738     PERFORM 2198P-GET-MEXW003-STATUSES                           00070738
070739                                                                  00070739
070740     IF MEXW003-FOUND                                             00070740
070741        STRING VST-STAT-Y(1:4)                                    00070741
070742               VST-STAT-Y(6:2)                                    00070742
070743               VST-STAT-Y(9:2)                                    00070743
070744        DELIMITED BY SIZE INTO                                    00070744
070745               WS-DTL-VEH-ARRIVAL-VST-STAT-Y                      00070745
070746        END-STRING                                                00070746
070747     END-IF                                                       00070747
070748     PERFORM 3010P-PROCESS-WHOLESALE                              00070748
070751     IF WS-COUNT-DTL-NBR                = 999999                  00070751
070752        MOVE ZERO                      TO WS-COUNT-DTL-NBR        00070752
070754     END-IF                                                       00070754
070755     IF WS-COUNT-LINE-NBR               = 999999                  00070755
070756        MOVE ZERO                      TO WS-COUNT-LINE-NBR       00070756
070758     END-IF                                                       00070758
070759                                                                  00070759
070760     IF MEXW027-FOUND                                             00070760
070762         ADD  +1                       TO WS-COUNT-DTL-NBR        00070762
070764                                          WS-COUNT-LINE-NBR       00070764
070765                                        WS-NBR-OUTPUT-RECS-WRITTEN00070679
070767         WRITE VINCENT-RECORD        FROM WS-VINCENT-DETAIL-RECORD00070765
070774     END-IF                                                       00070774
070775                                                                  00070775
070776     INITIALIZE  WS-VINCENT-DETAIL-RECORD                         00070776
070777     .                                                            00070777
070778***************************************************************** 00070778
070779* EXTRACT THE WERS STRING IF ONE EXISTS                           00070779
070784***************************************************************** 00070784
070785 2125P-PROCESS-WERS-STRING.                                       00070785
070786                                                                  00070786
070787     SET WERS-STRING-NOT-FOUND-SW      TO TRUE                    00070787
070788     INITIALIZE                           MEXW004-VEH-WERS-STRING 00070788
070789                                          VWR-WERS-STRING-X-TEXT  00070789
070790                                                                  00070790
070791     MOVE VEH-DTA-DATA-SRC-C           TO VWR-DTA-DATA-SRC-C      00070791
070792     MOVE VEH-ORD-ID-C                 TO VWR-VEH-ORD-ID-C        00070792
070793                                                                  00070793
070794     PERFORM 7030P-SELECT-WERS-DATA-W004                          00070794
070795                                                                  00070795
070796     .                                                            00070796
070797***************************************************************** 00070797
070798* MOVE SOME OF THE DATABASE FIELDS TO OUTPUT RECORD.  IF A WERS   00070798
070799* STRING WAS NOT FOUND, CHECK TO SEE IF THE ORDER HAS A CATALOG   00070799
070800* CODE.                                                           00070800
070803***************************************************************** 00070803
070804 2130P-MOVE-MEXW001-TO-DTL.                                       00070804
070805                                                                  00070805
070806     MOVE VEH-VIN-FULL-C               TO WS-DTL-VIN-FULL-C       00070806
070807     MOVE VEH-DTA-DATA-SRC-C           TO WS-DTL-DTA-DATA-SRC-C   00070807
070808     MOVE VEH-BDT-MDL-YR-Y             TO WS-VEH-BDT-MDL-YR-Y     00070808
070809     MOVE WS-VEH-BDT-MDL-YR-YY         TO WS-DTL-BDT-MDL-YR-Y     00070809
070810     MOVE VEH-WMI-WMI-C                TO WS-DTL-WMI-WMI-C        00070810
070811     MOVE VEH-LCL-PLT-C                TO WS-DTL-LCL-PLT-C        00070811
070812                                                                  00070812
070813     IF WERS-STRING-FOUND-SW                                      00070813
070814        MOVE VWR-WERS-STRING-X-TEXT(10:2)                         00070814
070815                                       TO WS-DTL-LCL-BDYTYP-C     00070815
070816     ELSE                                                         00070816
070817        PERFORM 2132P-GET-CATALOG-DATA                            00070817
070826     END-IF                                                       00070826
070827                                                                  00070827
070828     MOVE VEH-GBL-ORD-DLR-C            TO DLR-DLR-DLR-C           00070828
070829     PERFORM 7020P-GET-MEXW035-DATA                               00070829
070830     IF MEXW035-FOUND                                             00070830
070831        IF DLR-SUPER-DLR-C              = ZEROS                   00070831
070832           MOVE SPACES                 TO WS-DTL-VEH-GBL-DLR-C    00070832
070833        ELSE                                                      00070833
070834           MOVE DLR-SUPER-DLR-C        TO                         00070834
070835                                   WS-DTL-VEH-GBL-DLR-C-REFORMAT  00070835
070836           MOVE WS-DTL-VEH-GBL-DLR-C-REFORMAT                     00070836
070837                                       TO WS-DTL-VEH-GBL-DLR-C    00070837
070838        END-IF                                                    00070838
070839     ELSE                                                         00070839
070840        MOVE SPACES                    TO WS-DTL-VEH-GBL-DLR-C    00070840
070841     END-IF                                                       00070841
070842     IF   VEH-GBL-SHIP-TO-C             > SPACES                  00070842
070843          MOVE VEH-GBL-SHIP-TO-C       TO WS-DTL-SHIP-TO-DLR-C    00070843
070844     ELSE                                                         00070844
070845          MOVE WS-DTL-VEH-GBL-DLR-C    TO WS-DTL-SHIP-TO-DLR-C    00070845
070846     END-IF                                                       00070846
070847                                                                  00070847
070848     STRING VEH-ORD-RCPT-Y (1:4)                                  00070848
070849            VEH-ORD-RCPT-Y (6:2)                                  00070849
070850            VEH-ORD-RCPT-Y (9:2)                                  00070850
070851     DELIMITED BY SIZE INTO                                       00070851
070852            WS-DTL-VEH-ORD-RCPT-Y                                 00070852
070853     END-STRING                                                   00070853
070854                                                                  00070854
070855     MOVE VEH-WDMO-FLEET-C             TO WS-DTL-WDMO-FLEET-C     00070855
070856     MOVE VEH-WDMO-ORD-TYP             TO WS-DTL-VEH-WDMO-ORD-TYP 00070856
070857     MOVE VEH-GBL-CATALOG-C            TO WS-DTL-VEH-CATALOG-C    00070857
070858                                                                  00070858
070859     IF VEH-PO-Y                        > "0001-01-01"            00070859
070860        STRING VEH-PO-Y (1:4)                                     00070860
070861               VEH-PO-Y (6:2)                                     00070861
070862               VEH-PO-Y (9:2)                                     00070862
070863        DELIMITED BY SIZE INTO                                    00070863
070864               WS-DTL-VEH-PO-Y                                    00070864
070865        END-STRING                                                00070865
070866     END-IF                                                       00070866
070867     MOVE VEH-GEVIS-VL-C               TO WS-DTL-GEVIS-VEH-LINE-C 00070867
070868     .                                                            00070868
070869******************************************************************00070869
070870* GET CATALOG INFORMATION                                         00070870
070871******************************************************************00070871
070872 2132P-GET-CATALOG-DATA.                                          00070872
070873                                                                  00070873
070874     MOVE VEH-DTA-DATA-SRC-C           TO CTM-DTA-DATA-SRC-C      00070874
070875     MOVE VEH-CATALOG-C                TO CTM-LCL-CATALOG-C       00070875
070876                                                                  00070876
070877     PERFORM 8200P-OPEN-MEXW031-CSR                               00070877
070878     PERFORM 8205P-FETCH-MEXW031-CSR                              00070878
070879     PERFORM 8207P-CLOSE-MEXW031-CSR                              00070879
070880     IF MEXW031-FOUND                                             00070880
070881        MOVE CTM-OPT-OPTION-C          TO WS-DTL-LCL-BDYTYP-C     00070881
070882     ELSE                                                         00070882
070883        MOVE VEH-LCL-BDYTYP-C          TO WS-DTL-LCL-BDYTYP-C     00070883
070884     END-IF                                                       00070884
070885     .                                                            00070885
070886******************************************************************00070886
070887* A JOIN WILL BE DONE ON TABLES MEXW003 & MEXW008 TO OBTAIN       00070887
070888* VARIOUS RETAIL DATA (IF THE VEHICLE IS IN RETAIL STATUS).       00070888
070889* NOTE: THE RETAILED STATUS DATE WILL BE USED TO POPULATE THE     00070889
070890* DELIVERY DATE WHICH IS THE SAME.                                00070890
070891******************************************************************00070891
070892 2135P-OBTAIN-RETAIL-DATA.                                        00070892
070893                                                                  00070893
070894     MOVE VEH-ORD-ID-C                 TO VST-VEH-ORD-ID-C        00070894
070895     MOVE VEH-DTA-DATA-SRC-C           TO VST-DTA-DATA-SRC-C      00070895
070896     MOVE LIT-90V                      TO VST-STA-STATUS-C        00070896
070897     MOVE LIT-Y                        TO VST-LAST-OCCUR-F        00070897
070898                                          VST-ACTIVE-F            00070898
070899                                                                  00070899
070900     PERFORM 7040P-SELECT-MEXW008-90V-DATA                        00070900
070901                                                                  00070901
070902     IF MEXW008-FOUND-90V                                         00070902
070903        STRING VST-STAT-Y(1:4)                                    00070903
070904               VST-STAT-Y(6:2)                                    00070904
070905               VST-STAT-Y(9:2)                                    00070905
070906        DELIMITED BY SIZE INTO                                    00070906
070907               WS-DTL-VEH-RETAIL-VST-STAT-Y                       00070907
070908        END-STRING                                                00070908
070909                                                                  00070909
070910        MOVE WS-DTL-VEH-RETAIL-VST-STAT-Y TO                      00070910
070911                          WS-DTL-VEH-DELIVER-VST-STAT-Y           00070911
070912        PERFORM 2137P-POPULATE-RETAIL-OUTPUT                      00070912
070913     END-IF                                                       00070913
070914     .                                                            00070914
070915******************************************************************00070915
070916* IF A 90V STATUS WAS FOUND FOR THE VEHICLE, THEN VARIOUS RETAIL  00070916
070917* SALES DATA WILL BE MOVED TO CORRESPONDING OUTPUT FIELDS.  IF    00070917
070918* THE 90V STATUS WAS NOT FOUND FOR THE VEHICLE, THEN SPACES WILL  00070918
070919* BE MOVED TO THOSE OUTPUT FIELDS.                                00070919
070920* PER CUSTOMER, IF CUSTOMER FIRST NAME & LAST NAME IS BLANK, THEN 00070920
070921* THE BUSINESS NAME WILL BE MOVED TO THE FIRST NAME FIELD         00070921
070922******************************************************************00070922
070923 2137P-POPULATE-RETAIL-OUTPUT.                                    00070923
070924                                                                  00070924
070925     MOVE VRS-LCL-FLEET-C              TO WS-DTL-VRS-LCL-FLEET-C  00070925
070926                                                                  00070926
070927     IF  VRS-CST-FIRST-N                = SPACES                  00070927
070928     AND VRS-CST-LAST-N                 = SPACES                  00070928
070929         MOVE VRS-CST-BUS-1-N (1:30)   TO WS-DTL-VRS-CST-FIRST-N  00070929
070930         MOVE VRS-CST-BUS-2-N (1:30)   TO WS-DTL-VRS-CST-LAST-N   00070930
070931     ELSE                                                         00070931
070932         MOVE VRS-CST-FIRST-N          TO WS-DTL-VRS-CST-FIRST-N  00070932
070933         MOVE VRS-CST-MID-INIT-X       TO                         00070933
070934                                     WS-DTL-VRS-CST-MID-INIT-X    00070934
070935         MOVE VRS-CST-LAST-N           TO WS-DTL-VRS-CST-LAST-N   00070935
070936     END-IF                                                       00070936
070937                                                                  00070937
070938     MOVE VRS-CST-ADDR-1-X             TO WS-DTL-VRS-CST-ADDR-1-X 00070938
070939     MOVE VRS-CST-ADD-DIV2-N           TO                         00070939
070940                                      WS-DTL-VRS-CST-ADD-DIV2-N   00070940
070941     MOVE VRS-CST-ADD-DIV1-C           TO                         00070941
070942                                     WS-DTL-VRS-CST-ADD-DIV1-C    00070942
070943     MOVE VRS-CST-POSTAL-C             TO WS-DTL-VRS-CST-POSTAL-C 00070943
070944     MOVE VRS-SALESPERSON-C            TO WS-DTL-VRS-SALESPERSON-C00070944
070945                                                                  00070945
070946     PERFORM 2139P-POPULATE-CONCEPS-SLSTYP                        00070946
070947                                                                  00070947
070948     IF VRS-RPT-SALE-Y                  > "0001-01-01"            00070948
070949        STRING VRS-RPT-SALE-Y(1:4)                                00070949
070950               VRS-RPT-SALE-Y(6:2)                                00070950
070951               VRS-RPT-SALE-Y(9:2)                                00070951
070952        DELIMITED BY SIZE INTO                                    00070952
070953               WS-DTL-VEH-SLSRCPT-VST-STAT-Y                      00070953
070954        END-STRING                                                00070954
070955     END-IF                                                       00070955
070956                                                                  00070956
070957     IF VRS-WARR-STRT-Y                 > "0001-01-01"            00070957
070958        STRING VRS-WARR-STRT-Y(1:4)                               00070958
070959               VRS-WARR-STRT-Y(6:2)                               00070959
070960               VRS-WARR-STRT-Y(9:2)                               00070960
070961        DELIMITED BY SIZE INTO                                    00070961
070962               WS-DTL-VEH-WARRANT-VST-STAT-Y                      00070962
070963        END-STRING                                                00070963
070964     ELSE                                                         00070964
070965        IF VRS-RPT-SALE-Y               > "0001-01-01"            00070965
070966           MOVE WS-DTL-VEH-SLSRCPT-VST-STAT-Y TO                  00070966
070967                                WS-DTL-VEH-WARRANT-VST-STAT-Y     00070967
070968        END-IF                                                    00070968
070969     END-IF                                                       00070969
070970     .                                                            00070970
070971******************************************************************00070971
070972* THE GEVIS CUSTOMER TYPE CODE WILL BE CONVERTED TO A CONCEPS     00070972
070973* SALES TYPE CODE.                                                00070973
070974******************************************************************00070974
070975 2139P-POPULATE-CONCEPS-SLSTYP.                                   00070975
070976                                                                  00070976
070977     EVALUATE VRS-TYP-LCL-CUST-C                                  00070977
070978         WHEN "A1"                                                00070978
070979         WHEN "0 "                                                00070979
070980            MOVE "0"                  TO WS-DTL-VRS-TYP-LCL-CUST-C00070980
070981         WHEN "A2"                                                00070981
070982         WHEN "R "                                                00070982
070983            MOVE "R"                  TO WS-DTL-VRS-TYP-LCL-CUST-C00070983
070984         WHEN "A3"                                                00070984
070985         WHEN "L "                                                00070985
070986            MOVE "L"                  TO WS-DTL-VRS-TYP-LCL-CUST-C00070986
070987                                                                  00070987
070988         WHEN "A4"                                                00070988
070989            MOVE " "                  TO WS-DTL-VRS-TYP-LCL-CUST-C00070989
070990                                                                  00070990
070991         WHEN "A5"                                                00070991
070992         WHEN "E "                                                00070992
070993            MOVE "E"                  TO WS-DTL-VRS-TYP-LCL-CUST-C00070993
070994                                                                  00070994
070995         WHEN "F1"                                                00070995
070996         WHEN "7 "                                                00070996
070997            MOVE "7"                  TO WS-DTL-VRS-TYP-LCL-CUST-C00070997
070998                                                                  00070998
070999         WHEN "F2"                                                00070999
071000         WHEN "3 "                                                00071000
071001            MOVE "3"                  TO WS-DTL-VRS-TYP-LCL-CUST-C00071001
071002                                                                  00071002
071003         WHEN "F3"                                                00071003
071004         WHEN "T "                                                00071004
071005            MOVE "T"                  TO WS-DTL-VRS-TYP-LCL-CUST-C00071005
071006                                                                  00071006
071007         WHEN "F4"                                                00071007
071008         WHEN "4 "                                                00071008
071009            MOVE "4"                  TO WS-DTL-VRS-TYP-LCL-CUST-C00071009
071010                                                                  00071010
071011         WHEN "L2"                                                00071011
071012         WHEN "L4"                                                00071012
071013         WHEN "D "                                                00071013
071014            MOVE "D"                  TO WS-DTL-VRS-TYP-LCL-CUST-C00071014
071015                                                                  00071015
071016         WHEN "L1"                                                00071016
071017         WHEN "L3"                                                00071017
071018         WHEN "6 "                                                00071018
071019            MOVE "6"                  TO WS-DTL-VRS-TYP-LCL-CUST-C00071019
071020     END-EVALUATE                                                 00071020
071021     .                                                            00071021
071022******************************************************************00071022
071023* THE CURRENT DEALER/STOCKING DEALER, CURRENT STATUS CODE AND     00071023
071024* CURRENT STATUS CODE DATE WERE RETRIEVED EARLIER.  NOW THE CUR-  00071024
071025* RENT VEHICLE'S STATUS CODE WILL BE USED TO OBTAIN THE VINCENT   00071025
071026* EQUIVALENT FROM TABLE MEXW027 USING "VI" AS THE PRODUCTION      00071026
071027* SOURCE.                                                         00071027
071028* NOTE: DURING DEVELOPMENT OF THIS PROGRAM, IT WAS DECIDED TO     00071028
071029* INSERT GLOBAL/LOCAL CODES ON THE MEXW027 CONVERSION TABLE,      00071029
071030* WITH THE VALUES THAT VINCENT USES FOR THEIR VRULES PROCESSING.  00071030
071031* RATHER THAN HARD CODING THE VALUES IN THIS PROGRAM AND THE      00071031
071032* STORED PROCEDURE (EXWWGEVP), IT IS BETTER TO MAKE A DIRECT CALL 00071032
071033* TO THE TABLE WHERE THE CODES CAN BE MORE EASILY CHANGED, SHOULD 00071033
071034* A CHANGE ARISE IN THE FUTURE.                                   00071034
071035* A CHECK HAS BEEN ADDED TO SEND VINCENT A STATUS CODE OF 600     00071035
071036* INSTEAD OF 800 WHEN THERE ARE NO SALES TYPE OR SALES DATE       00071036
071037* AVAILABLE.                                                      00071037
071038******************************************************************00071038
071039 2142P-MOVE-SSTK-CURRENT-TO-DTL.                                  00071039
071040                                                                  00071040
071041     INITIALIZE WS-MEXW027-SW                                     00071041
071042                                                                  00071042
071043     MOVE SSTK-GBL-STK-DLR-C           TO                         00071043
071044                                     WS-VST-GBL-LOC-C-REFORMAT    00071044
071045     MOVE WS-VST-GBL-LOC-C-REFORMAT    TO DLR-DLR-DLR-C           00071045
071046     PERFORM 7020P-GET-MEXW035-DATA                               00071046
071047     IF MEXW035-FOUND                                             00071047
071048        IF DLR-SUPER-DLR-C              = ZEROS                   00071048
071049           MOVE SPACES                 TO                         00071049
071050                                        WS-DTL-CURR-STOCKING-DLR-C00071050
071051                                        WS-DTL-CURR-DLR-C         00071051
071052        ELSE                                                      00071052
071053           MOVE DLR-SUPER-DLR-C        TO                         00071053
071054                                     WS-DLR-SUPER-DLR-C-REFORMAT  00071054
071055           MOVE WS-DLR-SUPER-DLR-C-REFORMAT                       00071055
071056                                       TO                         00071056
071057                                        WS-DTL-CURR-STOCKING-DLR-C00071057
071058                                        WS-DTL-CURR-DLR-C         00071058
071059        END-IF                                                    00071059
071060     ELSE                                                         00071060
071061        MOVE SPACES                    TO                         00071061
071062                                      WS-DTL-CURR-STOCKING-DLR-C  00071062
071063                                      WS-DTL-CURR-DLR-C           00071063
071064     END-IF                                                       00071064
071065                                                                  00071065
071066     IF WS-DTL-CURR-STOCKING-DLR-C      > SPACES                  00071066
071067        STRING SSTK-CUR-STAT-Y(1:4)                               00071067
071068               SSTK-CUR-STAT-Y(6:2)                               00071068
071069               SSTK-CUR-STAT-Y(9:2)                               00071069
071070        DELIMITED BY SIZE INTO                                    00071070
071071               WS-DTL-VEH-STOCK-VST-STAT-Y                        00071071
071072        END-STRING                                                00071072
071073     END-IF                                                       00071073
071074                                                                  00071074
071075     PERFORM 2145P-GET-MEXW027-INFO                               00071075
071076                                                                  00071076
071077     IF WS-DTL-CUR-STA-STATUS-C         = LIT-800                 00071077
071078        IF VRS-TYP-LCL-CUST-C           = "A4"                    00071078
071079           MOVE LIT-801                TO WS-DTL-CUR-STA-STATUS-C 00071079
071080        ELSE                                                      00071080
071081           IF WS-DTL-VRS-TYP-LCL-CUST-C = SPACES                  00071081
071082           OR WS-DTL-VEH-SLSRCPT-VST-STAT-Y                       00071082
071083                                        = SPACES                  00071083
071084              MOVE LIT-600             TO WS-DTL-CUR-STA-STATUS-C 00071084
071085           END-IF                                                 00071085
071086        END-IF                                                    00071086
071087     END-IF                                                       00071087
071088     .                                                            00071088
071089******************************************************************00071089
071090* EXTRACTS THE CONVERSION INFORMATION TO GET THE LOCAL STATUS     00071090
071091* CODE.                                                           00071091
071092******************************************************************00071092
071093 2145P-GET-MEXW027-INFO.                                          00071093
071094                                                                  00071094
071095     IF SSTK-CUR-STAT-C                 > SPACES                  00071095
071096        MOVE SSTK-CUR-STAT-C           TO CNT-GBL-DATA-X          00071096
071097        MOVE LIT-STATUS                TO CNT-CND-CNV-TYP-C       00071097
071098        MOVE LIT-VI                    TO CNT-DTA-DATA-SRC-C      00071098
071099                                                                  00071099
071100        PERFORM 7045P-SELECT-MEXW027                              00071100
071101                                                                  00071101
071102        IF MEXW027-NOT-FOUND                                      00071102
071103           MOVE SPACES                 TO AUDIT-RECORD            00071103
071104           WRITE AUDIT-RECORD                                     00071104
071105                                                                  00071105
071106           MOVE "MISSING STATUS ON MEXW027:  "                    00071106
071107                                       TO AUDIT-LABEL             00071107
071108           MOVE LIT-SPACE              TO AUDIT-DATA              00071108
071109           WRITE AUDIT-RECORD                                     00071109
071110                                                                  00071110
071111           MOVE "STATUS CODE:         "                           00071111
071112                                       TO AUDIT-LABEL             00071112
071113           MOVE CNT-GBL-DATA-X         TO AUDIT-DATA              00071113
071114           WRITE AUDIT-RECORD                                     00071114
071115                                                                  00071115
071116           MOVE "ASSOCIATED VIN:      "                           00071116
071117                                       TO AUDIT-LABEL             00071117
071118           MOVE VEH-VIN-FULL-C         TO AUDIT-DATA              00071118
071119           WRITE AUDIT-RECORD                                     00071119
071120                                                                  00071120
071121           ADD 1                       TO                         00071121
071122                                  WS-NBR-MEXW027-NOTFOUND-CALLS   00071122
071123        END-IF                                                    00071123
071124                                                                  00071124
071125        IF MEXW027-FOUND                                          00071125
071126           MOVE CNT-LCL-DATA-X (1:3)   TO WS-DTL-CUR-STA-STATUS-C 00071126
071127        END-IF                                                    00071127
071128     END-IF                                                       00071128
071129     .                                                            00071129
071130******************************************************************00071130
071131* TABLES MEXW003 & MEXW007 WILL BE JOINED IN ORDER TO OBTAIN      00071131
071132* VARIOUS WHOLESALE INFORMATION, IF THE VEHICLE HAS REACHED THAT  00071132
071133* STAGE.                                                          00071133
071134* NOTE: THE VEHICLE TOTAL AMOUNT MUST BE IN UNITED STATES DOLLAR  00071134
071135* CURRENCY (USD).  IF IT IS NOT, THEN ZERO WILL BE MOVED TO THE   00071135
071136* FIELD.                                                          00071136
071137******************************************************************00071137
071138 2150P-OBTAIN-WHOLESALE-DATA.                                     00071138
071139                                                                  00071139
071140     MOVE VEH-ORD-ID-C                 TO VST-VEH-ORD-ID-C        00071140
071141     MOVE VEH-DTA-DATA-SRC-C           TO VST-DTA-DATA-SRC-C      00071141
071142     MOVE LIT-40V                      TO VST-STA-STATUS-C        00071142
071143     MOVE LIT-Y                        TO VST-LAST-OCCUR-F        00071143
071144                                          VST-ACTIVE-F            00071144
071145     PERFORM 7050P-SELECT-WHOLESALE                               00071145
071146     IF MEXW003-FOUND-40V                                         00071146
071147        MOVE VST-GBL-LOC-C             TO                         00071147
071148                                      WS-DTL-CURR-VST-GBL-LOC-C   00071148
071149        STRING VST-STAT-Y (1:4)                                   00071149
071150               VST-STAT-Y (6:2)                                   00071150
071151               VST-STAT-Y (9:2)                                   00071151
071152        DELIMITED BY SIZE INTO                                    00071152
071153               WS-DTL-VEH-INVOICE-VST-STAT-Y                      00071153
071154        END-STRING                                                00071154
071155                                                                  00071155
071156        IF VWS-CUR-CURRENCY-C          = LIT-USD                  00071156
071157           MOVE VWS-TOT-LCL-A         TO WS-DTL-VWS-TOT-US-A      00071157
071158        ELSE                                                      00071158
071159           MOVE ZERO                  TO WS-DTL-VWS-TOT-US-A      00071159
071160        END-IF                                                    00071160
071161     END-IF                                                       00071161
071162     .                                                            00071162
071163******************************************************************00071163
071164* THE WERS VEHICLE LINE CODE WILL BE OBTAINED FROM TABLE MEXW034  00071164
071165* OR FROM TABLE MEXW004_WERS_VL_STRING.                           00071165
071166* IF 'EA' OR 'NA' SOURCED, THE WERS VEHICLE LINE IS OBTAINED FROM 00071166
071167* MEXW034 DB2 TABLE USING THE PROD SOURCE AND GEVIS VEHICLE LINE, 00071167
071168* WHICH WAS OBTAINED FROM MEXW001 DB2 TABLE.                      00071168
071169* FOR ALL OTHER SOURCES, IF THE ORDER IS FOUND ON MEXW004 DB2     00071169
071170* TABLE, USE THE WERS VEHICLE LINE FROM MEXW004 DB2 TABLE AND     00071170
071171* GEVIS VEHICLE LINE FROM MEXW034 DB2 TABLE WERS PRODUCT TYPE CODE00071171
071172* AND WERS BODY USE TO MAKE UP THE WERS BODY STYLE.               00071172
071173* IF NOT FOUND ON MEXW004 DB2 TABLE, USE WERS VEHICLE LINE        00071173
071174* FROM MEXW0032 (CATALOG CODE), PRODUCT TYPE AND WERS BODY USE    00071174
071175* TO MAKE UP WERS BODY STYLE.                                     00071175
071176* IF NOT FOUND ON MEXW004 OR MEXW031/MEXW032 DB2 TABLES, WE ARE   00071176
071177* ASSUMING THE ORDER IS FROM HISTORY FOR 'NA' AND 'EA', USE       00071177
071178* MEXW034 DB2 TABLE PRODUCT TYPE CODE AND BODY TYPE FROM MEXW033  00071178
071179* USE TO MAKE UP THE BODY STYLE.                                  00071179
071180******************************************************************00071180
071181 2160P-OBTAIN-WERS-DATA.                                          00071181
071182                                                                  00071182
071183     SET MEXW034-NOT-FOUND             TO TRUE                    00071183
071184                                                                  00071184
071185     IF VEH-DTA-DATA-SRC-C              = LIT-EA OR LIT-NA        00071185
071186        IF VEH-GEVIS-VL-C               > "  "                    00071186
071187           PERFORM 2162P-SELECT-W034-DATA                         00071187
071188        END-IF                                                    00071188
071189                                                                  00071189
071190        IF MEXW034-FOUND                                          00071190
071191           MOVE VLN-WERS-VL-C          TO WS-DTL-WERS-VEH-LINE-C  00071191
071192           MOVE VLN-WERS-BRAND-C (2:1) TO WS-DTL-WERS-BRAND-C     00071192
071193        END-IF                                                    00071193
071194     ELSE                                                         00071194
071195        IF WERS-STRING-FOUND-SW                                   00071195
071196           PERFORM 2165P-WERS-STRING-PROCESS                      00071196
071197        ELSE                                                      00071197
071198           PERFORM 2170P-SELECT-MEXW032-WERS-VL                   00071198
071199           IF MEXW032-FOUND                                       00071199
071200              PERFORM 2172P-CATALOG-CODE-PROCESS                  00071200
071201             END-IF                                               00071201
071202         END-IF                                                   00071202
071203     END-IF                                                       00071203
071204                                                                  00071204
071205     MOVE SPACES                       TO WS-DTL-WERS-BODY-STYLE-C00071205
071206                                                                  00071206
071207     IF WERS-STRING-FOUND-SW                                      00071207
071209         STRING VWR-WERS-PRD-TP-C                                 00071209
071210                VWR-WERS-STRING-X-TEXT(10:2)                      00071210
071211         DELIMITED BY SIZE INTO                                   00071211
071212                WS-DTL-WERS-BODY-STYLE-C                          00071212
071213         END-STRING                                               00071213
071214     ELSE                                                         00071214
071215        PERFORM 2190P-EVAL-CATLG-BDYTYPE                          00071215
071216     END-IF                                                       00071216
071217     .                                                            00071217
071218******************************************************************00071218
071219* RETRIEVES THE WERS VEHICLE LINE DATA USING THE GEVIS VEHICLEE   00071219
071220* LINE CODE AND PRODUCTION SOURCE.                                00071220
071221* NOTE: THIS ONLY APPLIES TO 'NA' AND 'EA' DATA SOURCES.          00071221
071222******************************************************************00071222
071223 2162P-SELECT-W034-DATA.                                          00071223
071224                                                                  00071224
071225     MOVE VEH-DTA-DATA-SRC-C           TO VLN-DTA-DATA-SRC-C      00071225
071226     MOVE VEH-GEVIS-VL-C               TO VLN-GEVIS-VL-C          00071226
071227     MOVE LIT-Y                        TO VLN-ACTIVE-F            00071227
071228     PERFORM 7060P-SELECT-MEXW034                                 00071228
071229     .                                                            00071229
071230******************************************************************00071230
071231* PROCESS FEATURE DATA FROM WERS STRING W004 TABLE                00071231
071232*                                                                 00071232
071233* EVALUATE WERS VEHICLE LINE.  THESE ARE HANDLED AS               00071233
071234* EXEPTIONS AS THEY CAN APPEAR MUTIPLE TIMES FOR                  00071234
071235* DIFFERENT GEVIS VEHICLE LINES.                                  00071235
071236******************************************************************00071236
071237 2165P-WERS-STRING-PROCESS.                                       00071237
071238                                                                  00071238
071239     MOVE VWR-WERS-VL-C               TO WS-WERS-VL-C             00071239
071240                                                                  00071240
071241     IF  WS-VALID-VEH-LINE-CDS                                    00071241
071242         EVALUATE VWR-WERS-VL-C                                   00071242
071243             WHEN "KI"                                            00071243
071244             WHEN "K5"                                            00071244
071245                  MOVE "L5"           TO VLN-GEVIS-VL-C           00071245
071246                  MOVE "AB"           TO VLN-WERS-BRAND-C         00071246
071247                  SET MEXW034-FOUND   TO TRUE                     00071247
071248             WHEN "DB"                                            00071248
071249                  MOVE "DB"           TO VLN-GEVIS-VL-C           00071249
071250                  MOVE "AB"           TO VLN-WERS-BRAND-C         00071250
071251                  SET MEXW034-FOUND   TO TRUE                     00071251
071252         END-EVALUATE                                             00071252
071253     ELSE                                                         00071253
071254         PERFORM 2162P-SELECT-W034-DATA                           00071254
071255     END-IF                                                       00071255
071256                                                                  00071256
071257     IF  MEXW034-FOUND                                            00071257
071258         MOVE VLN-GEVIS-VL-C          TO WS-DTL-GEVIS-VEH-LINE-C  00071258
071259         MOVE VWR-WERS-VL-C           TO WS-DTL-WERS-VEH-LINE-C   00071259
071260         MOVE VLN-WERS-BRAND-C (2:1)  TO WS-DTL-WERS-BRAND-C      00071260
071261     ELSE                                                         00071261
071262         MOVE VEH-GEVIS-VL-C          TO WS-DTL-GEVIS-VEH-LINE-C  00071262
071263         MOVE VWR-WERS-VL-C           TO WS-DTL-WERS-VEH-LINE-C   00071263
071264         MOVE SPACES                  TO WS-DTL-WERS-BRAND-C      00071264
071265     END-IF                                                       00071265
071266                                                                  00071266
071267     .                                                            00071267
071268******************************************************************00071268
071269* SELECT THE VEHICLE LINE FROM THE MEXW032_CATALOG TABLE.         00071269
071270******************************************************************00071270
071271 2170P-SELECT-MEXW032-WERS-VL.                                    00071271
071272                                                                  00071272
071273     MOVE VEH-DTA-DATA-SRC-C           TO CTG-DTA-DATA-SRC-C      00071273
071274     MOVE VEH-CATALOG-C                TO CTG-LCL-CATALOG-C       00071274
071275     PERFORM 7070P-SELECT-VL-MEXW032                              00071275
071276     .                                                            00071276
071277******************************************************************00071277
071278* EVALUATE CATALOG CODE VEHICLE LINE.  THESE ARE HANDLED AS       00071278
071279* EXEPTIONS AS THEY CAN APPEAR MUTIPLE TIMES FOR                  00071279
071280* DIFFERENT GEVIS VEHICLE LINES.                                  00071280
071281******************************************************************00071281
071282 2172P-CATALOG-CODE-PROCESS.                                      00071282
071283                                                                  00071283
071284     MOVE CTG-VHL-VEH-LINE-C           TO WS-WERS-VL-C            00071284
071285                                                                  00071285
071286     IF  WS-VALID-VEH-LINE-CDS                                    00071286
071287         EVALUATE CTG-VHL-VEH-LINE-C                              00071287
071288             WHEN "KI"                                            00071288
071289             WHEN "K5"                                            00071289
071290                  MOVE "L5"            TO VLN-GEVIS-VL-C          00071290
071291                  MOVE "AB"            TO VLN-WERS-BRAND-C        00071291
071292                  SET MEXW034-FOUND    TO TRUE                    00071292
071293             WHEN "DB"                                            00071293
071294                  MOVE "DB"            TO VLN-GEVIS-VL-C          00071294
071295                  MOVE "AB"            TO VLN-WERS-BRAND-C        00071295
071296                  SET MEXW034-FOUND    TO TRUE                    00071296
071298         END-EVALUATE                                             00071298
071299     ELSE                                                         00071299
071300         PERFORM 2180P-SELECT-MEXW034-GEVIS-VL                    00071300
071301     END-IF                                                       00071301
071302                                                                  00071302
071303     IF MEXW034-FOUND                                             00071303
071304        MOVE VLN-GEVIS-VL-C            TO WS-DTL-GEVIS-VEH-LINE-C 00071304
071305        MOVE CTG-VHL-VEH-LINE-C        TO WS-DTL-WERS-VEH-LINE-C  00071305
071306        MOVE VLN-WERS-BRAND-C (2:1)    TO WS-DTL-WERS-BRAND-C     00071306
071307     END-IF                                                       00071307
071308     .                                                            00071308
071309******************************************************************00071309
071310* RETRIEVES THE GEVIS VEHICLE LINE DATA USING THE DATA SOURCE AND 00071310
071311* WERS VEHICLE LINE CODE.                                         00071311
071313******************************************************************00071313
071314 2180P-SELECT-MEXW034-GEVIS-VL.                                   00071314
071315                                                                  00071315
071316     MOVE VEH-DTA-DATA-SRC-C           TO VLN-DTA-DATA-SRC-C      00071316
071317     MOVE CTG-VHL-VEH-LINE-C           TO VLN-WERS-VL-C           00071317
071318     MOVE LIT-Y                        TO VLN-ACTIVE-F            00071318
071319     MOVE CTG-VPT-PROD-TYP-C           TO VLN-WERS-PRD-TP-C       00071319
071320     PERFORM 7080P-SELECT-VL-MEXW034                              00071320
071321     .                                                            00071321
071322******************************************************************00071322
071323* BY USING THE DATA OBTAINED FROM TABLE MEXW001 IN THE WHERE      00071323
071324* CLAUSE, THE WERS BODY TYPE WILL NOW BE OBTAINED TO CREATE THE   00071324
071325* BODYSTYLE.                                                      00071325
071326******************************************************************00071326
071327 2190P-EVAL-CATLG-BDYTYPE.                                        00071327
071328                                                                  00071328
071329     IF MEXW031-FOUND                                             00071329
071330         STRING CTM-VPT-PROD-TYP-C                                00071330
071331                CTM-OPT-OPTION-C                                  00071331
071332         DELIMITED BY SIZE INTO                                   00071332
071333                WS-DTL-WERS-BODY-STYLE-C                          00071333
071334         END-STRING                                               00071334
071335     ELSE                                                         00071335
071336        IF VEH-DTA-DATA-SRC-C           =  LIT-EA  OR  LIT-NA     00071336
071337           PERFORM 2192P-SELECT-MEXW033-DATA                      00071337
071340           IF  MEXW033-FOUND                                      00071340
071341           AND BDT-WERS-BDY-TYP-C       >  SPACES                 00071341
071342               STRING VLN-WERS-PRD-TP-C                           00071342
071343                      BDT-WERS-BDY-TYP-C                          00071343
071344               DELIMITED BY SIZE INTO                             00071344
071345                      WS-DTL-WERS-BODY-STYLE-C                    00071345
071346               END-STRING                                         00071346
071347           END-IF                                                 00071347
071348        END-IF                                                    00071348
071349     END-IF                                                       00071349
071350     .                                                            00071350
071351******************************************************************00071351
071352* POPULATE THE WORKING STORAGE FOR MEXW033_BODY_TYPE TABLE AND    00071352
071353* CALL THE PARAGRAPH TO PERFORM THE SELECT.                       00071353
071354******************************************************************00071354
071355 2192P-SELECT-MEXW033-DATA.                                       00071355
071356                                                                  00071356
071357     MOVE VEH-DTA-DATA-SRC-C           TO BDT-PROD-SRC-C          00071357
071358     MOVE VEH-BDT-MDL-YR-Y             TO BDT-START-YR-R          00071358
071359                                          BDT-END-YR-R            00071359
071360     MOVE VEH-LCL-BDYTYP-C             TO BDT-BDY-TYP-C           00071360
071361     PERFORM 7085P-SELECT-MEXW033                                 00071361
071362     .                                                            00071362
071363******************************************************************00071363
071364* POPULATES THE WORKING STORAGE FOR THE MEXW003_VEH_STATUS        00071364
071365*TABLE TO GET THE STATUS YEAR FOR STATUSES                        00071365
071367******************************************************************00071367
071368 2198P-GET-MEXW003-STATUSES.                                      00071368
071369                                                                  00071369
071370     MOVE VEH-ORD-ID-C                 TO WS-VST-VEH-ORD-ID-C     00071370
071371     MOVE VEH-DTA-DATA-SRC-C           TO WS-VST-DTA-DATA-SRC-C   00071371
071372     MOVE LIT-Y                        TO WS-VST-LAST-OCCUR-F     00071372
071373                                          WS-VST-ACTIVE-F         00071373
071374     PERFORM 7090P-SELECT-MEXW003                                 00071374
071375     .                                                            00071375
071376******************************************************************00071376
071377* PROCESS WHOLESALE INFORMATION                                   00071377
071378******************************************************************00071378
071379 3010P-PROCESS-WHOLESALE.                                         00071379
071380                                                                  00071380
071381     MOVE VEH-ORD-ID-C                 TO VST-VEH-ORD-ID-C        00071381
071382     MOVE VEH-DTA-DATA-SRC-C           TO VST-DTA-DATA-SRC-C      00071382
071383     MOVE LIT-40V                      TO VST-STA-STATUS-C        00071383
071384     MOVE LIT-D                        TO VST-STAT-TYP-C          00071384
071385     MOVE LIT-Y                        TO VST-ACTIVE-F            00071385
071386     MOVE LIT-WD                       TO VST-CUR-DATA-SRC-C      00071386
071387                                                                  00071387
071388     PERFORM 8300P-OPEN-40V-CSR                                   00071388
071389     PERFORM 8305P-FETCH-40V-ROW                                  00071389
071390     IF MEXW003-40V-CSR-ROW-FOUND                                 00071390
071391        MOVE VST-GBL-LOC-C             TO                         00071391
071392                                     WS-DTL-LAST-QAD-VST-GBL-LOC-C00071392
071393     END-IF                                                       00071393
071394                                                                  00071394
071395     PERFORM 8307P-CLOSE-40V-CSR                                  00071395
071396     .                                                            00071396
071507/*****************************************************************00071507
071510* DOES ALL THE END OF PROCESSING                                  00071510
083685******************************************************************00083685
083686 6000P-CONCLUSION.                                                00083686
083687                                                                  00083687
083691     PERFORM 7000P-OBTAIN-DRBN-TIMESTAMP                          00083691
083692     PERFORM 6010P-UPDATE-PROG-PARMS                              00083692
083694     PERFORM 6030P-POPULATE-VINCENT-TRAILER                       00083694
083695     PERFORM 6040P-WRITE-AUDIT-DETAIL                             00083695
083696     PERFORM 6050P-WRITE-AUDIT-TRAILER                            00083696
083697     CLOSE AUDIT-FILE                                             00083697
083698           INPUT-PARM                                             00083698
083699           VINCENT-OUT                                            00083699
083700     .                                                            00083700
083701******************************************************************00083701
083702* UPDATE THE CURRENT TIMESTAMP THAT WAS SELECTED AT THE BEGINNING 00083702
083703* OF THE PROGRAM WHICH IS USED AS THE LAST RUN TIMESTAMP.         00083703
083705******************************************************************00083705
083710 6010P-UPDATE-PROG-PARMS.                                         00083710
083800                                                                  00083800
327100     MOVE LIT-SYSTEM-ID                TO GNT-SYSTEM-CD           00327100
327300     MOVE LIT-TABLE-ID                 TO GNT-TABLE-ID            00327300
327500     MOVE LIT-KEY-DATA-TIMESTAMP       TO GNT-KEY-DATA            00327500
327600     MOVE WS-HOLD-CURR-TIMESTAMP       TO GNT-ATTRIBUTE-DATA      00327600
327610     PERFORM 7005P-UPDATE-TIMESTAMP                               00327610
327611                                                                  00327611
327612     MOVE LIT-KEY-DATA-BATCHCTL        TO GNT-KEY-DATA            00327612
327613     MOVE WS-CURRENT-BATCH-NBR         TO GNT-ATTRIBUTE-DATA      00327613
327614     PERFORM 7005P-UPDATE-TIMESTAMP                               00327614
327630                                                                  00327630
327701     .                                                            00327701
327721******************************************************************00327721
327722* POPULATES THE VINCENT TRAILER IN THE OUTPUT FILE.               00327722
327723******************************************************************00327723
327724 6030P-POPULATE-VINCENT-TRAILER.                                  00327724
327725                                                                  00327725
327727     ADD  1                            TO WS-COUNT-LINE-NBR       00327727
327732     MOVE LIT-999                      TO VNT-TRL-HUB-REC-TYPE    00327732
327734     MOVE LIT-WDMHAEXT                 TO VNT-TRL-REC-TYPE        00327734
327736     MOVE WS-CURRENT-BATCH-NBR         TO VNT-TRL-CURR-BATCH-NBR  00327736
327738     MOVE WS-COUNT-DTL-NBR             TO VNT-TRL-COUNTER         00327738
327740                                                                  00327740
327741     MOVE VINCENT-TRAILER(38:)         TO VINCENT-RECORD          00327741
327742     WRITE VINCENT-RECORD                                         00327742
327743     .                                                            00327743
327744******************************************************************00327744
327745* THIS PARAGRAPH WILL WRITE ALL THE AUDIT INFORMATION OUT TO THE  00327745
327746* AUDIT REPORT.                                                   00327746
327747******************************************************************00327747
327748 6040P-WRITE-AUDIT-DETAIL.                                        00327748
327749                                                                  00327749
327750     MOVE SPACES                       TO AUDIT-RECORD            00327750
327752     WRITE AUDIT-RECORD                                           00327752
327753                                                                  00327753
327754     MOVE ALL "="                      TO AUDIT-RECORD            00327754
327756     WRITE AUDIT-RECORD                                           00327756
327757                                                                  00327757
327758     MOVE SPACES                       TO AUDIT-RECORD            00327758
327760     WRITE AUDIT-RECORD                                           00327760
327761                                                                  00327761
327762     MOVE "TTL ROWS READ MEXW001 CSR:"                            00327762
327763                                       TO AUDIT-LABEL             00327763
327764     MOVE WS-NBR-ROWS-READ-MEXW001-CSR TO PV-COUNT-DISPLAY        00327764
327765     MOVE PV-COUNT-DISPLAY             TO AUDIT-DATA              00327765
327766     WRITE AUDIT-RECORD                                           00327766
327767                                                                  00327767
327768     MOVE "TTL ROWS READ MEXW003 CSR:"                            00327768
327769                                       TO AUDIT-LABEL             00327769
327770     MOVE WS-NBR-ROWS-READ-MEXW003-CSR TO PV-COUNT-DISPLAY        00327770
327771     MOVE PV-COUNT-DISPLAY             TO AUDIT-DATA              00327771
327772     WRITE AUDIT-RECORD                                           00327772
327773                                                                  00327773
327774     MOVE "TTL ROWS READ MEXW008 CSR:"                            00327774
327775                                       TO AUDIT-LABEL             00327775
327776     MOVE WS-NBR-ROWS-READ-MEXW008-CSR TO PV-COUNT-DISPLAY        00327776
327777     MOVE PV-COUNT-DISPLAY             TO AUDIT-DATA              00327777
327778     WRITE AUDIT-RECORD                                           00327778
327779                                                                  00327779
327780     MOVE "TTL ROWS READ FROM SALE-CHK   :"                       00327780
327781                                       TO AUDIT-LABEL             00327781
327782     MOVE WS-NBR-ROWS-READ-SALE-CHK    TO PV-COUNT-DISPLAY        00327782
327783     MOVE PV-COUNT-DISPLAY             TO AUDIT-DATA              00327783
327784     WRITE AUDIT-RECORD                                           00327784
327785                                                                  00327785
327786     MOVE "TTL ROWS READ FROM MEXW003    :"                       00327786
327787                                       TO AUDIT-LABEL             00327787
327788     MOVE WS-NBR-ROWS-READ-MEXW003     TO PV-COUNT-DISPLAY        00327788
327789     MOVE PV-COUNT-DISPLAY             TO AUDIT-DATA              00327789
327790     WRITE AUDIT-RECORD                                           00327790
327791                                                                  00327791
327792     MOVE "TTL ROWS READ FROM MEXW004    :"                       00327792
327793                                       TO AUDIT-LABEL             00327793
327794     MOVE WS-NBR-ROWS-READ-MEXW004     TO PV-COUNT-DISPLAY        00327794
327795     MOVE PV-COUNT-DISPLAY             TO AUDIT-DATA              00327795
327796     WRITE AUDIT-RECORD                                           00327796
327797                                                                  00327797
327798     MOVE "TTL ROWS READ FROM MEXW007    :"                       00327798
327799                                       TO AUDIT-LABEL             00327799
327800     MOVE WS-NBR-ROWS-READ-MEXW007     TO PV-COUNT-DISPLAY        00327800
327801     MOVE PV-COUNT-DISPLAY             TO AUDIT-DATA              00327801
327802     WRITE AUDIT-RECORD                                           00327802
327803                                                                  00327803
327804     MOVE "TTL ROWS READ FROM MEXW008    :"                       00327804
327805                                       TO AUDIT-LABEL             00327805
327806     MOVE WS-NBR-ROWS-READ-MEXW008     TO PV-COUNT-DISPLAY        00327806
327807     MOVE PV-COUNT-DISPLAY             TO AUDIT-DATA              00327807
327808     WRITE AUDIT-RECORD                                           00327808
327809                                                                  00327809
327810     MOVE "TTL ROWS READ FROM MEXW027    :"                       00327810
327811                                       TO AUDIT-LABEL             00327811
327812     MOVE WS-NBR-ROWS-READ-MEXW027     TO PV-COUNT-DISPLAY        00327812
327813     MOVE PV-COUNT-DISPLAY             TO AUDIT-DATA              00327813
327814     WRITE AUDIT-RECORD                                           00327814
327815                                                                  00327815
327816     MOVE "TTL ROWS READ FROM MEXW031    :"                       00327816
327817                                       TO AUDIT-LABEL             00327817
327818     MOVE WS-NBR-ROWS-READ-MEXW031     TO PV-COUNT-DISPLAY        00327818
327819     MOVE PV-COUNT-DISPLAY             TO AUDIT-DATA              00327819
327820     WRITE AUDIT-RECORD                                           00327820
327821                                                                  00327821
327822     MOVE "TTL ROWS READ FROM MEXW032    :"                       00327822
327823                                       TO AUDIT-LABEL             00327823
327824     MOVE WS-NBR-ROWS-READ-MEXW032     TO PV-COUNT-DISPLAY        00327824
327825     MOVE PV-COUNT-DISPLAY             TO AUDIT-DATA              00327825
327826     WRITE AUDIT-RECORD                                           00327826
327827                                                                  00327827
327828     MOVE "TTL ROWS READ FROM MEXW033    :"                       00327828
327829                                       TO AUDIT-LABEL             00327829
327830     MOVE WS-NBR-ROWS-READ-MEXW033     TO PV-COUNT-DISPLAY        00327830
327831     MOVE PV-COUNT-DISPLAY             TO AUDIT-DATA              00327831
327832     WRITE AUDIT-RECORD                                           00327832
327833                                                                  00327833
327834     MOVE "TTL ROWS READ FROM MEXW034    :"                       00327834
327835                                       TO AUDIT-LABEL             00327835
327836     MOVE WS-NBR-ROWS-READ-MEXW034     TO PV-COUNT-DISPLAY        00327836
327837     MOVE PV-COUNT-DISPLAY             TO AUDIT-DATA              00327837
327838     WRITE AUDIT-RECORD                                           00327838
327839                                                                  00327839
327840     MOVE "TTL ROWS READ FROM MEXW035    :"                       00327840
327841                                       TO AUDIT-LABEL             00327841
327842     MOVE WS-NBR-ROWS-READ-MEXW035     TO PV-COUNT-DISPLAY        00327842
327843     MOVE PV-COUNT-DISPLAY             TO AUDIT-DATA              00327843
327844     WRITE AUDIT-RECORD                                           00327844
327845                                                                  00327845
327846     MOVE "TTL SYSPARM RECORDS READ      :"                       00327846
327847                                       TO AUDIT-LABEL             00327847
327848     MOVE WS-NBR-SYSPARM-RECS-READ     TO PV-COUNT-DISPLAY        00327848
327849     MOVE PV-COUNT-DISPLAY             TO AUDIT-DATA              00327849
327850     WRITE AUDIT-RECORD                                           00327850
327851                                                                  00327851
327852     MOVE "TTL SUBROUTINE SSTK CALLS     :"                       00327852
327853                                       TO AUDIT-LABEL             00327853
327854     MOVE WS-NBR-EXWWSSTK-CALLS        TO PV-COUNT-DISPLAY        00327854
327855     MOVE PV-COUNT-DISPLAY             TO AUDIT-DATA              00327855
327856     WRITE AUDIT-RECORD                                           00327856
327857                                                                  00327857
327858     MOVE "TTL SSTK CALLS WITH +100      :"                       00327858
327859                                       TO AUDIT-LABEL             00327859
327860     MOVE WS-NBR-EXWWSSTK-NOTFOUND-CALLS                          00327860
327861                                       TO PV-COUNT-DISPLAY        00327861
327862     MOVE PV-COUNT-DISPLAY             TO AUDIT-DATA              00327862
327864     WRITE AUDIT-RECORD                                           00327864
327865                                                                  00327865
327866     MOVE "TTL MEXW027 ROWS NOT FOUND    :"                       00327866
327867                                       TO AUDIT-LABEL             00327867
327868     MOVE WS-NBR-MEXW027-NOTFOUND-CALLS                           00327868
327869                                       TO PV-COUNT-DISPLAY        00327869
327870     MOVE PV-COUNT-DISPLAY             TO AUDIT-DATA              00327870
327871     WRITE AUDIT-RECORD                                           00327871
327872                                                                  00327872
327873     MOVE "TTL MEXW035 ROWS NOT FOUND    :"                       00327873
327874                                       TO AUDIT-LABEL             00327874
327875     MOVE WS-NBR-MEXW035-NOTFOUND-CALLS                           00327875
327876                                       TO PV-COUNT-DISPLAY        00327876
327877     MOVE PV-COUNT-DISPLAY             TO AUDIT-DATA              00327877
327878     WRITE AUDIT-RECORD                                           00327878
327879                                                                  00327879
327880     MOVE "TTL OUTPUT RECORDS WRITTEN    :"                       00327880
327881                                       TO AUDIT-LABEL             00327881
327882     MOVE WS-NBR-OUTPUT-RECS-WRITTEN   TO PV-COUNT-DISPLAY        00327882
327883     MOVE PV-COUNT-DISPLAY             TO AUDIT-DATA              00327883
327884     WRITE AUDIT-RECORD                                           00327884
327885     .                                                            00327885
327886/*****************************************************************00327886
327887* WRITE AUDIT TRAILER LINES                                      *00327887
327888******************************************************************00327888
327889  6050P-WRITE-AUDIT-TRAILER.                                      00327889
327890                                                                  00327890
327891     PERFORM 0550P-GET-CURRENT-DATE-TIME                          00327891
327892     MOVE SPACES                       TO AUDIT-RECORD            00327892
327893     WRITE AUDIT-RECORD                                           00327893
327894                                                                  00327894
327895     MOVE "PROGRAM STOP    DATE/TIME  :"                          00327895
327896                                       TO AUDIT-LABEL             00327896
327897     MOVE SV-FORMAT-DATE               TO AUDIT-DATA              00327897
327898     MOVE SV-FORMAT-TIME               TO AUDIT-DATA (10:)        00327898
327899     WRITE AUDIT-RECORD                                           00327899
327900                                                                  00327900
327901     MOVE PL-PGM-NAME                  TO AUDIT-RECORD            00327901
327902     MOVE "ENDED SUCCESSFULLY"         TO AUDIT-RECORD (10:)      00327902
327903     WRITE AUDIT-RECORD                                           00327903
327904     .                                                            00327904
327905******************************************************************00327905
327906* OBTAINS THE CURRENT DEARBORN TIMESTAMP, PART OF WHICH WILL BE   00327906
327907* USED IN THE MAIN DRIVING CURSOR AND THE E & G HEADER/TRAILER    00327907
327908* ALONG WITH THE VINCENT HEADER.                                  00327908
327909******************************************************************00327909
327910 7000P-OBTAIN-DRBN-TIMESTAMP.                                     00327910
327911                                                                  00327911
327912     EXEC SQL                                                     00327912
327913        SET  :WS-CURR-DRBN-TIMESTAMP    = CURRENT TIMESTAMP       00327913
327914     END-EXEC                                                     00327914
327915                                                                  00327915
327916     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00327916
327917                                                                  00327917
327918     EVALUATE TRUE                                                00327918
327919         WHEN SC-DB2-SQLCODE-OK                                   00327919
327920              CONTINUE                                            00327920
327921         WHEN OTHER                                               00327921
327922              MOVE SQLCODE             TO DB2-ABEND-SQLCODE       00327922
327923              MOVE "SELECT"            TO DB2-ABEND-FUNCTION      00327923
327924              MOVE "DB2-TIMESTAMP"     TO DB2-ABEND-TABLE         00327924
327925              MOVE DB2-ABEND-MSG       TO ABEND-MSG               00327925
327926              MOVE "7000P"             TO ABEND-PARAGRAPH         00327926
327927              PERFORM 9999I-ABEND                                 00327927
327928     END-EVALUATE                                                 00327928
327930     .                                                            00327930
327942******************************************************************00327942
327943* UPDATE THE TIMESTAMP ON THE MEXS016 TABLE WITH THE TIME THAT    00327943
327944* THE JOB STARTED.  THIS VALUE WILL BE READ IN THE NEXT TIME THIS 00327944
327945* PROGRAM IS EXECUTED.                                            00327945
327946******************************************************************00327946
327947 7005P-UPDATE-TIMESTAMP.                                          00327947
327948                                                                  00327948
327949      EXEC SQL                                                    00327949
327950          UPDATE MEXS016_GENERIC2                                 00327950
328000          SET    GNT_ATTRIBUTE_DATA     = :GNT-ATTRIBUTE-DATA     00328000
328100          WHERE  GNT_SYSTEM_CD          = :GNT-SYSTEM-CD          00328100
328200          AND    GNT_TABLE_ID           = :GNT-TABLE-ID           00328200
328300          AND    GNT_KEY_DATA           = :GNT-KEY-DATA           00328300
328400      END-EXEC                                                    00328400
328500                                                                  00328500
328600     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00328600
328800     EVALUATE TRUE                                                00328800
328900         WHEN SC-DB2-SQLCODE-OK                                   00328900
329000              CONTINUE                                            00329000
329200         WHEN OTHER                                               00329200
329210              MOVE SPACES              TO AUDIT-RECORD            00329210
329220              WRITE AUDIT-RECORD                                  00329220
329230              STRING "GNT-SYSTEM-CD: "    GNT-SYSTEM-CD           00329230
329231                     DELIMITED BY SIZE                            00329231
329232                                     INTO AUDIT-RECORD            00329232
329233              END-STRING                                          00329233
329234              WRITE AUDIT-RECORD                                  00329234
329235              MOVE SPACES              TO AUDIT-RECORD            00329235
329236                                                                  00329236
329240              STRING "GNT-ATTRIBUTE: "    GNT-ATTRIBUTE-DATA      00329240
329241                     DELIMITED BY SIZE                            00329241
329242                                     INTO AUDIT-RECORD            00329242
329243              END-STRING                                          00329243
329244              WRITE AUDIT-RECORD                                  00329244
329245              MOVE SPACES              TO AUDIT-RECORD            00329245
329246                                                                  00329246
329247              STRING "GNT-TABLE-ID:  "    GNT-TABLE-ID            00329247
329248                     DELIMITED BY SIZE                            00329248
329249                                     INTO AUDIT-RECORD            00329249
329250              END-STRING                                          00329250
329251              WRITE AUDIT-RECORD                                  00329251
329252              MOVE SPACES              TO AUDIT-RECORD            00329252
329253                                                                  00329253
329254              STRING "GNT-KEY-DATA:  "    GNT-KEY-DATA            00329254
329255                     DELIMITED BY SIZE                            00329255
329260                                     INTO AUDIT-RECORD            00329260
329261              END-STRING                                          00329261
329262              WRITE AUDIT-RECORD                                  00329262
329263              MOVE SPACES              TO AUDIT-RECORD            00329263
329264                                                                  00329264
329270              WRITE AUDIT-RECORD                                  00329270
329300              MOVE SQLCODE             TO DB2-ABEND-SQLCODE       00329300
329500              MOVE "UPDATE"            TO DB2-ABEND-FUNCTION      00329500
329700              MOVE "MEXS016-GENERIC"   TO DB2-ABEND-TABLE         00329700
329900              MOVE DB2-ABEND-MSG       TO ABEND-MSG               00329900
330100              MOVE "7005P"             TO ABEND-PARAGRAPH         00330100
330300              PERFORM 9999I-ABEND                                 00330300
330400     END-EVALUATE                                                 00330400
330500     .                                                            00330500
330501******************************************************************00330501
330502* SELECT THE PREVIOUS RUN'S OUTPUT FILE BATCH NUMBER.             00330502
330503******************************************************************00330503
330504 7010P-SELECT-MEXS016.                                            00330504
330505                                                                  00330505
330506     EXEC SQL                                                     00330506
330507         SELECT GNT_ATTRIBUTE_DATA                                00330507
330508         INTO  :GNT-ATTRIBUTE-DATA                                00330508
330509         FROM   MEXS016_GENERIC2                                  00330509
330510         WHERE  GNT_SYSTEM_CD           = :GNT-SYSTEM-CD          00330510
330511         AND    GNT_TABLE_ID            = :GNT-TABLE-ID           00330511
330512         AND    GNT_KEY_DATA            = :GNT-KEY-DATA           00330512
330513     END-EXEC                                                     00330513
330514                                                                  00330514
330515     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00330515
330516                                                                  00330516
330517     EVALUATE TRUE                                                00330517
330518         WHEN SC-DB2-SQLCODE-OK                                   00330518
330519              SET BATCHCTL-FOUND       TO TRUE                    00330519
330521         WHEN SC-DB2-SQLCODE-INVALID-DATE                         00330521
330522              SET BATCHCTL-NOT-FOUND   TO TRUE                    00330522
330524         WHEN OTHER                                               00330524
330525              MOVE SPACES              TO AUDIT-RECORD            00330525
330526              WRITE AUDIT-RECORD                                  00330526
330527              STRING "GNT-SYSTEM-CD: "    GNT-SYSTEM-CD           00330527
330528                     DELIMITED BY SIZE                            00330528
330529                                     INTO AUDIT-RECORD            00330529
330530              END-STRING                                          00330530
330531              WRITE AUDIT-RECORD                                  00330531
330532              MOVE SPACES              TO AUDIT-RECORD            00330532
330533                                                                  00330533
330534              STRING "GNT-TABLE-ID:  "    GNT-TABLE-ID            00330534
330535                     DELIMITED BY SIZE                            00330535
330536                                     INTO AUDIT-RECORD            00330536
330537              END-STRING                                          00330537
330538              WRITE AUDIT-RECORD                                  00330538
330539              MOVE SPACES              TO AUDIT-RECORD            00330539
330540                                                                  00330540
330541              STRING "GNT-KEY-DATA:  "    GNT-KEY-DATA            00330541
330542                     DELIMITED BY SIZE                            00330542
330543                                     INTO AUDIT-RECORD            00330543
330544              END-STRING                                          00330544
330545              WRITE AUDIT-RECORD                                  00330545
330546              MOVE SPACES              TO AUDIT-RECORD            00330546
330547                                                                  00330547
330548              MOVE SQLCODE             TO DB2-ABEND-SQLCODE       00330548
330549              MOVE "SELECT"            TO DB2-ABEND-FUNCTION      00330549
330550              MOVE "MEXS016_GENERIC2"  TO DB2-ABEND-TABLE         00330550
330551              MOVE DB2-ABEND-MSG       TO ABEND-MSG               00330551
330552              MOVE "7010P"             TO ABEND-PARAGRAPH         00330552
330553              PERFORM 9999I-ABEND                                 00330553
330554     END-EVALUATE                                                 00330554
330560     .                                                            00330560
339601***************************************************************** 00339601
339602* A CALL WILL BE PLACED TO TABLE MEXW035 IN EITHER OF TWO SIT-    00339602
339603* UATIONS.  1) TO OBTAIN THE SUPER DEALER CODE WHICH WILL BE      00339603
339604* USED IN PLACE OF THE GLOBAL ORDERING DEALER CODE AND/OR GLOBAL  00339604
339605* CURRENT STOCKING DEALER CODE.  2)  TO DETERMINE WHETHER OR NOT  00339605
339606* THE CURRENT STOCKING DEALER IS WDMO BASED.                      00339606
339607******************************************************************00339607
339608 7020P-GET-MEXW035-DATA.                                          00339608
339609                                                                  00339609
339610     EXEC SQL                                                     00339610
339611         SELECT  SUB_SUBLVL1_C                                    00339611
339613                ,DLR_SUPER_DLR_C                                  00339613
339614           INTO :DLR-SUB-SUBLVL1-C                                00339614
339616               ,:DLR-SUPER-DLR-C                                  00339616
339617           FROM  MEXW035_DLR_MSTR                                 00339617
339618          WHERE  DLR_DLR_C              = :DLR-DLR-DLR-C          00339618
339619     END-EXEC                                                     00339619
339620                                                                  00339620
339621     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00339621
339623                                                                  00339623
339624     EVALUATE TRUE                                                00339624
339625         WHEN SC-DB2-SQLCODE-OK                                   00339625
339626              ADD 1                    TO WS-NBR-ROWS-READ-MEXW03500339626
339628              SET MEXW035-FOUND        TO TRUE                    00339628
339630         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00339630
339631              SET MEXW035-NOT-FOUND    TO TRUE                    00339631
339633         WHEN OTHER                                               00339633
339634              MOVE DLR-DLR-DLR-C       TO WS-HOLD-DLR-DLR         00339634
339635              MOVE SPACES              TO AUDIT-RECORD            00339635
339636              WRITE AUDIT-RECORD                                  00339636
339637              STRING "DLR-DLR-DRL-C: "    WS-HOLD-DLR-DLR         00339637
339640                      DELIMITED BY SIZE                           00339640
339641                                     INTO AUDIT-RECORD            00339641
339642              END-STRING                                          00339642
339643              WRITE AUDIT-RECORD                                  00339643
339644              MOVE SPACES              TO AUDIT-RECORD            00339644
339645                                                                  00339645
339646              MOVE "SELECT"            TO DB2-ABEND-FUNCTION      00339646
339647              MOVE "MEXW035_DLR_MSTR"  TO DB2-ABEND-TABLE         00339647
339648              MOVE DB2-ABEND-MSG       TO ABEND-MSG               00339648
339649              MOVE "7020P"             TO ABEND-PARAGRAPH         00339649
339650              PERFORM 9999I-ABEND                                 00339650
339651     END-EVALUATE                                                 00339651
339652     .                                                            00339652
339653******************************************************************00339653
339654* SELECTS WERS STRING FROM MEXW004_VEH_WERS_STRING DB2 TABLE      00339654
339655******************************************************************00339655
339656 7030P-SELECT-WERS-DATA-W004.                                     00339656
339657                                                                  00339657
339658     EXEC SQL                                                     00339658
339659         SELECT  VWR_WERS_STRING_X                                00339659
339660                ,VWR_WERS_VL_C                                    00339660
339661                ,VWR_WERS_PRD_TP_C                                00339661
339662                ,VWR_MAJ_FEAT_DFNED_F                             00339662
339663           INTO :VWR-WERS-STRING-X                                00339663
339664               ,:VWR-WERS-VL-C                                    00339664
339665               ,:VWR-WERS-PRD-TP-C                                00339665
339666               ,:VWR-MAJ-FEAT-DFNED-F                             00339666
339667           FROM  MEXW004_VEH_WERS_STRING                          00339667
339668          WHERE  VEH_ORD_ID_C           = :VWR-VEH-ORD-ID-C       00339668
339669            AND  DTA_DATA_SRC_C         = :VWR-DTA-DATA-SRC-C     00339669
339670     END-EXEC                                                     00339670
339671                                                                  00339671
339672     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00339672
339673                                                                  00339673
339674     EVALUATE TRUE                                                00339674
339675         WHEN SC-DB2-SQLCODE-OK                                   00339675
339676              IF VWR-WERS-STRING-X-TEXT > SPACES    AND           00339676
339677                 VWR-MAJ-FEAT-DFNED-F   = LIT-Y                   00339677
339678                 SET WERS-STRING-FOUND-SW                         00339678
339679                                       TO TRUE                    00339679
339680                 ADD +1                TO WS-NBR-ROWS-READ-MEXW00400339680
339681              END-IF                                              00339681
339682         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00339682
339683              SET WERS-STRING-NOT-FOUND-SW                        00339683
339684                                       TO TRUE                    00339684
339685         WHEN OTHER                                               00339685
339686              MOVE SPACES              TO AUDIT-RECORD            00339686
339687              WRITE AUDIT-RECORD                                  00339687
339688              STRING  "VEHICLE ORDER: "   VWR-VEH-ORD-ID-C        00339688
339689                      DELIMITED BY SIZE                           00339689
339690                                     INTO AUDIT-RECORD            00339690
339691              END-STRING                                          00339691
339692              WRITE AUDIT-RECORD                                  00339692
339693              MOVE SPACES              TO AUDIT-RECORD            00339693
339694                                                                  00339694
339695              STRING  "DATA SOURCE :  "   VWR-DTA-DATA-SRC-C      00339695
339696                      DELIMITED BY SIZE                           00339696
339697                                     INTO AUDIT-RECORD            00339697
339698              END-STRING                                          00339698
339699              WRITE AUDIT-RECORD                                  00339699
339704              MOVE SPACES              TO AUDIT-RECORD            00339704
339705                                                                  00339705
339706              MOVE SC-DB2-SQLCODE      TO DB2-ABEND-SQLCODE       00339706
339707              MOVE "SELECT"            TO DB2-ABEND-FUNCTION      00339707
339708              MOVE "MEXW004_VEH_WERS_STRING"                      00339708
339709                                       TO DB2-ABEND-TABLE         00339709
339710              MOVE DB2-ABEND-MSG       TO ABEND-MSG               00339710
339711              MOVE "7030P"             TO ABEND-PARAGRAPH         00339711
339712              PERFORM 9999I-ABEND                                 00339712
339713                                                                  00339713
339714     END-EVALUATE                                                 00339714
339715                                                                  00339715
339716     .                                                            00339716
339717******************************************************************00339717
339718* SELECTS SALES DATA FROM MEXW008_VEH_RTL                         00339718
339719******************************************************************00339719
339720 7040P-SELECT-MEXW008-90V-DATA.                                   00339720
339721                                                                  00339721
339722     EXEC SQL                                                     00339722
339723         SELECT  A.VST_STAT_Y                                     00339723
339724                ,B.VRS_LCL_FLEET_C                                00339724
339725                ,B.VRS_CST_FIRST_N                                00339725
339726                ,B.VRS_CST_BUS_1_N                                00339726
339727                ,B.VRS_CST_BUS_2_N                                00339727
339728                ,B.VRS_CST_MID_INIT_X                             00339728
339729                ,B.VRS_CST_LAST_N                                 00339729
339730                ,B.VRS_CST_ADDR_1_X                               00339730
339731                ,B.VRS_CST_ADD_DIV2_N                             00339731
339732                ,B.VRS_CST_ADD_DIV1_C                             00339732
339733                ,B.VRS_CST_POSTAL_C                               00339733
339734                ,B.VRS_SALESPERSON_C                              00339734
339735                ,B.VRS_TYP_LCL_CUST_C                             00339735
339736                ,B.VRS_RPT_SALE_Y                                 00339736
339737                ,B.VRS_WARR_STRT_Y                                00339737
339738           INTO  :VST-STAT-Y                                      00339738
339739                ,:VRS-LCL-FLEET-C                                 00339739
339740                ,:VRS-CST-FIRST-N                                 00339740
339741                ,:VRS-CST-BUS-1-N                                 00339741
339742                ,:VRS-CST-BUS-2-N                                 00339742
339743                ,:VRS-CST-MID-INIT-X                              00339743
339744                ,:VRS-CST-LAST-N                                  00339744
339745                ,:VRS-CST-ADDR-1-X                                00339745
339746                ,:VRS-CST-ADD-DIV2-N                              00339746
339747                ,:VRS-CST-ADD-DIV1-C                              00339747
339748                ,:VRS-CST-POSTAL-C                                00339748
339749                ,:VRS-SALESPERSON-C                               00339749
339750                ,:VRS-TYP-LCL-CUST-C                              00339750
339751                ,:VRS-RPT-SALE-Y                                  00339751
339752                ,:VRS-WARR-STRT-Y                                 00339752
339753           FROM  MEXW003_VEH_STATUS A                             00339753
339754                ,MEXW008_VEH_RTL B                                00339754
339755          WHERE  A.VEH_ORD_ID_C        = :VST-VEH-ORD-ID-C        00339755
339756            AND  A.DTA_DATA_SRC_C      = :VST-DTA-DATA-SRC-C      00339756
339757            AND  A.STA_STATUS_C        = :VST-STA-STATUS-C        00339757
339758            AND  A.VST_LAST_OCCUR_F    = :VST-LAST-OCCUR-F        00339758
339759            AND  A.VST_ACTIVE_F        = :VST-ACTIVE-F            00339759
339760            AND  A.VST_ACTIVE_F        = B.VRS_ACTIVE_F           00339760
339761            AND  A.STA_STATUS_C        = B.STA_STATUS_C           00339761
339762            AND  A.VEH_ORD_ID_C        = B.VEH_ORD_ID_C           00339762
339763            AND  A.DTA_DATA_SRC_C      = B.DTA_DATA_SRC_C         00339763
339764            AND  SUBSTR(A.VST_LCL_LOC_C, 1,7)                     00339764
339765                                       = B.VRS_LCL_DLR_C          00339765
339766            AND  A.VST_STAT_Y          = B.VRS_RETAIL_Y           00339766
339767     END-EXEC                                                     00339767
339768                                                                  00339768
339769     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00339769
339770                                                                  00339770
339771     EVALUATE TRUE                                                00339771
339772         WHEN SC-DB2-SQLCODE-OK                                   00339772
339773              ADD +1                   TO WS-NBR-ROWS-READ-MEXW00800339773
339774              SET MEXW008-FOUND-90V    TO TRUE                    00339774
339775         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00339775
339776              SET MEXW008-NOT-FOUND-90V                           00339776
339777                                       TO TRUE                    00339777
339778         WHEN OTHER                                               00339778
339779              MOVE SPACES              TO AUDIT-RECORD            00339779
339780              WRITE AUDIT-RECORD                                  00339780
339781              STRING "VEHICLE ORDER: "    VST-VEH-ORD-ID-C        00339781
339782                     DELIMITED BY SIZE                            00339782
339783                                     INTO AUDIT-RECORD            00339783
339784              END-STRING                                          00339784
339785              WRITE AUDIT-RECORD                                  00339785
339786              MOVE SPACES              TO AUDIT-RECORD            00339786
339787                                                                  00339787
339788              STRING "DATA SOURCE  : "    VST-DTA-DATA-SRC-C      00339788
339789                     DELIMITED BY SIZE                            00339789
339790                                     INTO AUDIT-RECORD            00339790
339791              END-STRING                                          00339791
339792              WRITE AUDIT-RECORD                                  00339792
339793              MOVE SPACES              TO AUDIT-RECORD            00339793
339794                                                                  00339794
339795              STRING "STATUS CODE:   "    VST-STA-STATUS-C        00339795
339796                     DELIMITED BY SIZE                            00339796
339797                                     INTO AUDIT-RECORD            00339797
339798              END-STRING                                          00339798
339799              WRITE AUDIT-RECORD                                  00339799
339800              MOVE SPACES              TO AUDIT-RECORD            00339800
339801                                                                  00339801
339802              MOVE SQLCODE             TO DB2-ABEND-SQLCODE       00339802
339803              MOVE "SELECT"            TO DB2-ABEND-FUNCTION      00339803
339804              MOVE "SELECT-MEXW008-90V-DATA"                      00339804
339805                                       TO DB2-ABEND-TABLE         00339805
339806              MOVE DB2-ABEND-MSG       TO ABEND-MSG               00339806
339807              MOVE "7040P"             TO ABEND-PARAGRAPH         00339807
339808              PERFORM 9999I-ABEND                                 00339808
339809     END-EVALUATE                                                 00339809
339810     .                                                            00339810
339811***************************************************************** 00339811
339812* SELECT CONVERSION DATA FOR A SPECIFIC SOURCE                    00339812
339813***************************************************************** 00339813
339814 7045P-SELECT-MEXW027.                                            00339814
339815                                                                  00339815
339816     EXEC SQL                                                     00339816
339817         SELECT  CNT_LCL_DATA_X                                   00339817
339818           INTO :CNT-LCL-DATA-X                                   00339818
339819           FROM  MEXW027_CONV                                     00339819
339820          WHERE  CND_CNV_TYP_C          = :CNT-CND-CNV-TYP-C      00339820
339821            AND  DTA_DATA_SRC_C         = :CNT-DTA-DATA-SRC-C     00339821
339822            AND  CNT_GBL_DATA_X         = :CNT-GBL-DATA-X         00339822
339823     END-EXEC                                                     00339823
339824                                                                  00339824
339825     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00339825
339826                                                                  00339826
339827     EVALUATE TRUE                                                00339827
339828         WHEN SC-DB2-SQLCODE-OK                                   00339828
339829              ADD +1                   TO WS-NBR-ROWS-READ-MEXW02700339829
339830              SET MEXW027-FOUND        TO TRUE                    00339830
339831                                                                  00339831
339832         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00339832
339833               SET MEXW027-NOT-FOUND   TO TRUE                    00339833
339834                                                                  00339834
339835         WHEN OTHER                                               00339835
339836              MOVE SPACES              TO AUDIT-RECORD            00339836
339837              WRITE AUDIT-RECORD                                  00339837
339838              STRING "CNT-CNV-TYP:   "    CNT-CND-CNV-TYP-C       00339838
339839                     DELIMITED BY SIZE                            00339839
339840                                     INTO AUDIT-RECORD            00339840
339841              END-STRING                                          00339841
339842              WRITE AUDIT-RECORD                                  00339842
339843              MOVE SPACES              TO AUDIT-RECORD            00339843
339844                                                                  00339844
339845              STRING "DATA SOURCE :  "    CNT-DTA-DATA-SRC-C      00339845
339846                     DELIMITED BY SIZE                            00339846
339847                                     INTO AUDIT-RECORD            00339847
339848              END-STRING                                          00339848
339849              WRITE AUDIT-RECORD                                  00339849
339850              MOVE SPACES              TO AUDIT-RECORD            00339850
339851                                                                  00339851
339852              STRING "CNT-GBL-DATA:  "    CNT-GBL-DATA-X          00339852
339853                     DELIMITED BY SIZE                            00339853
339854                                    INTO AUDIT-RECORD             00339854
339855              END-STRING                                          00339855
339856              WRITE AUDIT-RECORD                                  00339856
339857              MOVE SPACES              TO AUDIT-RECORD            00339857
339858                                                                  00339858
339859              MOVE SQLCODE             TO DB2-ABEND-SQLCODE       00339859
339860              MOVE "SELECT"            TO DB2-ABEND-FUNCTION      00339860
339861              MOVE "MEXW027_CONV"      TO DB2-ABEND-TABLE         00339861
339862              MOVE DB2-ABEND-MSG       TO ABEND-MSG               00339862
339863              MOVE "7045P"             TO ABEND-PARAGRAPH         00339863
339864              PERFORM 9999I-ABEND                                 00339864
339865     END-EVALUATE                                                 00339865
339866     .                                                            00339866
339867***************************************************************** 00339867
339868* SELECT WHOLESALE INFORMATION                                    00339868
339869***************************************************************** 00339869
339870 7050P-SELECT-WHOLESALE.                                          00339870
339871                                                                  00339871
339872     EXEC SQL                                                     00339872
339873         SELECT A.VST_GBL_LOC_C                                   00339873
339874               ,A.VST_STAT_Y                                      00339874
339875               ,B.VWS_TOT_LCL_A                                   00339875
339876               ,B.CUR_CURRENCY_C                                  00339876
339877          INTO :VST-GBL-LOC-C                                     00339877
339878              ,:VST-STAT-Y                                        00339878
339879              ,:VWS-TOT-LCL-A                                     00339879
339880              ,:VWS-CUR-CURRENCY-C                                00339880
339881          FROM  MEXW003_VEH_STATUS A                              00339881
339882               ,MEXW007_VEH_WHS B                                 00339882
339883         WHERE  A.VEH_ORD_ID_C          = :VST-VEH-ORD-ID-C       00339883
339884           AND  A.DTA_DATA_SRC_C        = :VST-DTA-DATA-SRC-C     00339884
339885           AND  A.STA_STATUS_C          = :VST-STA-STATUS-C       00339885
339886           AND  A.VST_LAST_OCCUR_F      = :VST-LAST-OCCUR-F       00339886
339887           AND  A.VST_ACTIVE_F          = :VST-ACTIVE-F           00339887
339888           AND  A.VST_ACTIVE_F          = B.VWS_ACTIVE_F          00339888
339889           AND  A.STA_STATUS_C          = B.STA_STATUS_C          00339889
339890           AND  A.VEH_ORD_ID_C          = B.VEH_ORD_ID_C          00339890
339891           AND  A.DTA_DATA_SRC_C        = B.DTA_DATA_SRC_C        00339891
339892           AND  A.VST_STAT_Y            = B.VWS_DATE_Y            00339892
339893           AND  SUBSTR(A.VST_LCL_LOC_C, 1,7)                      00339893
339894                                        = B.VWS_LCL_DLR_C         00339894
339895     END-EXEC                                                     00339895
339896                                                                  00339896
339897     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00339897
339898                                                                  00339898
339899     EVALUATE TRUE                                                00339899
339900         WHEN SC-DB2-SQLCODE-OK                                   00339900
339901              ADD +1                   TO WS-NBR-ROWS-READ-MEXW00700339901
339902              SET MEXW003-FOUND-40V    TO TRUE                    00339902
339903         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00339903
339904              SET MEXW003-NOT-FOUND-40V                           00339904
339905                                       TO TRUE                    00339905
339906         WHEN OTHER                                               00339906
339907              MOVE SPACES              TO AUDIT-RECORD            00339907
339908              WRITE AUDIT-RECORD                                  00339908
339909              STRING "VEHICLE ORDER: "    VST-VEH-ORD-ID-C        00339909
339910                     DELIMITED BY SIZE                            00339910
339911                                     INTO AUDIT-RECORD            00339911
339912              END-STRING                                          00339912
339913              WRITE AUDIT-RECORD                                  00339913
339914              MOVE  SPACES             TO AUDIT-RECORD            00339914
339915                                                                  00339915
339916              STRING "DATA SOURCE :  "    VST-DTA-DATA-SRC-C      00339916
339917                     DELIMITED BY SIZE                            00339917
339918                                     INTO AUDIT-RECORD            00339918
339919              END-STRING                                          00339919
339920              WRITE AUDIT-RECORD                                  00339920
339921              MOVE  SPACES             TO AUDIT-RECORD            00339921
339922                                                                  00339922
339923              STRING "STATUS CODE :  "    VST-STA-STATUS-C        00339923
339924                     DELIMITED BY SIZE                            00339924
339925                                     INTO AUDIT-RECORD            00339925
339926              END-STRING                                          00339926
339927              WRITE AUDIT-RECORD                                  00339927
339928              MOVE  SPACES             TO AUDIT-RECORD            00339928
339929                                                                  00339929
339930              MOVE SQLCODE             TO DB2-ABEND-SQLCODE       00339930
339931              MOVE "SELECT"            TO DB2-ABEND-FUNCTION      00339931
339932              MOVE "MEXW001_MEXW003"   TO DB2-ABEND-TABLE         00339932
339933              MOVE DB2-ABEND-MSG       TO ABEND-MSG               00339933
339934              MOVE "7050P"             TO ABEND-PARAGRAPH         00339934
339935              PERFORM 9999I-ABEND                                 00339935
339936     END-EVALUATE                                                 00339936
339937     .                                                            00339937
339938***************************************************************** 00339938
339939* SELECT VEHICLE INFORMATION FROM MEXW034_VL_BRAND                00339939
339940***************************************************************** 00339940
339941 7060P-SELECT-MEXW034.                                            00339941
339942                                                                  00339942
339943     EXEC SQL                                                     00339943
339944         SELECT   VLN_WERS_VL_C                                   00339944
339945                 ,VLN_WERS_PRD_TP_C                               00339945
339946                 ,VLN_WERS_BRAND_C                                00339946
339947           INTO :VLN-WERS-VL-C                                    00339947
339948                ,:VLN-WERS-PRD-TP-C                               00339948
339949                ,:VLN-WERS-BRAND-C                                00339949
339950           FROM  MEXW034_VL_BRAND                                 00339950
339951          WHERE  DTA_DATA_SRC_C         = :VLN-DTA-DATA-SRC-C     00339951
339952            AND  VLN_GEVIS_VL_C         = :VLN-GEVIS-VL-C         00339952
339953            AND  VLN_ACTIVE_F           = :VLN-ACTIVE-F           00339953
339954     END-EXEC                                                     00339954
339955                                                                  00339955
339956     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00339956
339957                                                                  00339957
339958     EVALUATE TRUE                                                00339958
339959         WHEN SC-DB2-SQLCODE-OK                                   00339959
339960              ADD +1                   TO WS-NBR-ROWS-READ-MEXW03400339960
339961              SET MEXW034-FOUND        TO TRUE                    00339961
339962         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00339962
339963              SET MEXW034-NOT-FOUND    TO TRUE                    00339963
339964         WHEN OTHER                                               00339964
339965              MOVE SPACES              TO AUDIT-RECORD            00339965
339966              WRITE AUDIT-RECORD                                  00339966
339967              STRING "DATA SOURCE :  "    VLN-DTA-DATA-SRC-C      00339967
339968                     DELIMITED BY SIZE                            00339968
339969                                     INTO AUDIT-RECORD            00339969
339970              END-STRING                                          00339970
339971              WRITE AUDIT-RECORD                                  00339971
339972              MOVE SPACES              TO AUDIT-RECORD            00339972
339973                                                                  00339973
339974              STRING "GEVIS VEH LINE:"    VLN-GEVIS-VL-C          00339974
339975                     DELIMITED BY SIZE                            00339975
339976                                     INTO AUDIT-RECORD            00339976
339977              END-STRING                                          00339977
339978              WRITE AUDIT-RECORD                                  00339978
339979              MOVE SPACES              TO AUDIT-RECORD            00339979
339980                                                                  00339980
339981              MOVE SQLCODE             TO DB2-ABEND-SQLCODE       00339981
339982              MOVE "SELECT"            TO DB2-ABEND-FUNCTION      00339982
339983              MOVE "MEXW034_VL_BRAND"  TO DB2-ABEND-TABLE         00339983
339984              MOVE DB2-ABEND-MSG       TO ABEND-MSG               00339984
339985              MOVE "7060P"             TO ABEND-PARAGRAPH         00339985
339986              PERFORM 9999I-ABEND                                 00339986
339987     END-EVALUATE                                                 00339987
339988     .                                                            00339988
339989***************************************************************** 00339989
339990* SELECT CATALOG INFORMATION FROM MEXW032_CATALOG                 00339990
339991***************************************************************** 00339991
339992 7070P-SELECT-VL-MEXW032.                                         00339992
339993                                                                  00339993
339994     EXEC SQL                                                     00339994
339995       SELECT  VHL_VEH_LINE_C                                     00339995
339996              ,VPT_PROD_TYP_C                                     00339996
339997         INTO :CTG-VHL-VEH-LINE-C                                 00339997
339998             ,:CTG-VPT-PROD-TYP-C                                 00339998
339999         FROM MEXW032_CATALOG                                     00339999
340000        WHERE DTA_DATA_SRC_C            = :CTG-DTA-DATA-SRC-C     00340000
340001          AND CTG_LCL_CATALOG_C         = :CTG-LCL-CATALOG-C      00340001
340002     END-EXEC                                                     00340002
340003                                                                  00340003
340004     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00340004
340005                                                                  00340005
340006     EVALUATE TRUE                                                00340006
340007         WHEN SC-DB2-SQLCODE-OK                                   00340007
340008              ADD +1                   TO WS-NBR-ROWS-READ-MEXW03200340008
340009              SET MEXW032-FOUND        TO TRUE                    00340009
340010         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00340010
340011              SET MEXW032-NOT-FOUND    TO TRUE                    00340011
340012         WHEN OTHER                                               00340012
340013              MOVE SPACES              TO AUDIT-RECORD            00340013
340014              WRITE AUDIT-RECORD                                  00340014
340015              STRING "DATA SOURCE:   "    CTG-DTA-DATA-SRC-C      00340015
340016                     DELIMITED BY SIZE                            00340016
340017                                     INTO AUDIT-RECORD            00340017
340018              END-STRING                                          00340018
340019              WRITE AUDIT-RECORD                                  00340019
340020              MOVE SPACES              TO AUDIT-RECORD            00340020
340021                                                                  00340021
340022              STRING "CATALOG CODE:  "    CTG-LCL-CATALOG-C       00340022
340023                     DELIMITED BY SIZE                            00340023
340024                                     INTO AUDIT-RECORD            00340024
340025              END-STRING                                          00340025
340026              WRITE AUDIT-RECORD                                  00340026
340027              MOVE SPACES              TO AUDIT-RECORD            00340027
340028                                                                  00340028
340029              MOVE SQLCODE             TO DB2-ABEND-SQLCODE       00340029
340030              MOVE "SELECT"            TO DB2-ABEND-FUNCTION      00340030
340031              MOVE "MEXW032_CATALOG"   TO DB2-ABEND-TABLE         00340031
340032              MOVE DB2-ABEND-MSG       TO ABEND-MSG               00340032
340033              MOVE "7070P"             TO ABEND-PARAGRAPH         00340033
340034              PERFORM 9999I-ABEND                                 00340034
340035     END-EVALUATE                                                 00340035
340036     .                                                            00340036
340037***************************************************************** 00340037
340038* SELECT VEHICLE LINE INFORMATION FROM MEXW034_VL_BRAND           00340038
340039***************************************************************** 00340039
340040 7080P-SELECT-VL-MEXW034.                                         00340040
340041                                                                  00340041
340042     EXEC SQL                                                     00340042
340043        SELECT  VLN_GEVIS_VL_C                                    00340043
340044               ,VLN_WERS_PRD_TP_C                                 00340044
340045               ,VLN_WERS_BRAND_C                                  00340045
340046          INTO                                                    00340046
340047               :VLN-GEVIS-VL-C                                    00340047
340048              ,:VLN-WERS-PRD-TP-C                                 00340048
340049              ,:VLN-WERS-BRAND-C                                  00340049
340050          FROM  MEXW034_VL_BRAND                                  00340050
340051         WHERE  DTA_DATA_SRC_C          = :VLN-DTA-DATA-SRC-C     00340051
340052           AND  VLN_WERS_VL_C           = :VLN-WERS-VL-C          00340052
340053           AND  VLN_ACTIVE_F            = :VLN-ACTIVE-F           00340053
340054           AND  VLN_WERS_PRD_TP_C       = :VLN-WERS-PRD-TP-C      00340054
340055     END-EXEC                                                     00340055
340056                                                                  00340056
340057     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00340057
340058                                                                  00340058
340059     EVALUATE TRUE                                                00340059
340060         WHEN SC-DB2-SQLCODE-OK                                   00340060
340061              ADD +1                   TO WS-NBR-ROWS-READ-MEXW03400340061
340062              SET MEXW034-FOUND        TO TRUE                    00340062
340063         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00340063
340064              SET MEXW034-NOT-FOUND    TO TRUE                    00340064
340065         WHEN OTHER                                               00340065
340066              MOVE SPACES              TO AUDIT-RECORD            00340066
340067              WRITE AUDIT-RECORD                                  00340067
340068              MOVE SPACES              TO AUDIT-RECORD            00340068
340069              STRING "DATA SOURCE:   "    VLN-DTA-DATA-SRC-C      00340069
340070                     DELIMITED BY SIZE                            00340070
340071                                     INTO AUDIT-RECORD            00340071
340072              END-STRING                                          00340072
340073              WRITE AUDIT-RECORD                                  00340073
340074              MOVE SPACES              TO AUDIT-RECORD            00340074
340075                                                                  00340075
340076              STRING "WERS VEH LINE: "    VLN-WERS-VL-C           00340076
340077                     DELIMITED BY SIZE                            00340077
340078                                     INTO AUDIT-RECORD            00340078
340079              END-STRING                                          00340079
340080              WRITE AUDIT-RECORD                                  00340080
340081              MOVE SPACES              TO AUDIT-RECORD            00340081
340082                                                                  00340082
340083              STRING "WERS PROD TYPE:"    VLN-WERS-PRD-TP-C       00340083
340084                     DELIMITED BY SIZE                            00340084
340085                                     INTO AUDIT-RECORD            00340085
340086              END-STRING                                          00340086
340087              WRITE AUDIT-RECORD                                  00340087
340088              MOVE SPACES              TO AUDIT-RECORD            00340088
340089                                                                  00340089
340090              MOVE SQLCODE             TO DB2-ABEND-SQLCODE       00340090
340091              MOVE "SELECT"            TO DB2-ABEND-FUNCTION      00340091
340092              MOVE "MEXW034_VL_BRAND"  TO DB2-ABEND-TABLE         00340092
340093              MOVE DB2-ABEND-MSG       TO ABEND-MSG               00340093
340094              MOVE "7080P"             TO ABEND-PARAGRAPH         00340094
340095              PERFORM 9999I-ABEND                                 00340095
340096     END-EVALUATE                                                 00340096
340097     .                                                            00340097
340098***************************************************************** 00340098
340099* SELECT THE BODY TYPE INFORMATION FROM MEXW033_BODY_TYPE         00340099
340100***************************************************************** 00340100
340101 7085P-SELECT-MEXW033.                                            00340101
340102                                                                  00340102
340103     EXEC SQL                                                     00340103
340104         SELECT  BDT_WERS_BDY_TYP_C                               00340104
340105           INTO :BDT-WERS-BDY-TYP-C                               00340105
340106           FROM  MEXW033_BODY_TYPE                                00340106
340107          WHERE  BDT_PROD_SRC_C         = :BDT-PROD-SRC-C         00340107
340108            AND  BDT_BDY_TYP_C          = :BDT-BDY-TYP-C          00340108
340109            AND  BDT_START_YR_R        <= :BDT-START-YR-R         00340109
340110            AND  BDT_END_YR_R          >= :BDT-END-YR-R           00340110
340111     END-EXEC                                                     00340111
340112                                                                  00340112
340113     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00340113
340114     EVALUATE TRUE                                                00340114
340115         WHEN SC-DB2-SQLCODE-OK                                   00340115
340116              ADD +1                   TO WS-NBR-ROWS-READ-MEXW03300340116
340117              SET MEXW033-FOUND        TO TRUE                    00340117
340118         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00340118
340119              SET MEXW033-NOT-FOUND    TO TRUE                    00340119
340120         WHEN OTHER                                               00340120
340121              MOVE BDT-START-YR-R      TO WS-HOLD-MDL-YR1         00340121
340122              MOVE BDT-END-YR-R        TO WS-HOLD-MDL-YR2         00340122
340123              MOVE SPACES              TO AUDIT-RECORD            00340123
340124              WRITE AUDIT-RECORD                                  00340124
340125              STRING "PRODUCT SOURCE:"    BDT-PROD-SRC-C          00340125
340126                     DELIMITED BY SIZE                            00340126
340127                                     INTO AUDIT-RECORD            00340127
340128              END-STRING                                          00340128
340129              WRITE AUDIT-RECORD                                  00340129
340130              MOVE SPACES              TO AUDIT-RECORD            00340130
340131                                                                  00340131
340132              STRING "BODY TYPE:     "    BDT-BDY-TYP-C           00340132
340133                     DELIMITED BY SIZE                            00340133
340134                                     INTO AUDIT-RECORD            00340134
340135              END-STRING                                          00340135
340136              WRITE AUDIT-RECORD                                  00340136
340137              MOVE SPACES              TO AUDIT-RECORD            00340137
340138                                                                  00340138
340139              STRING "BDT START YR:  "    WS-HOLD-MDL-YR1         00340139
340140                     DELIMITED BY SIZE                            00340140
340141                                     INTO AUDIT-RECORD            00340141
340142              END-STRING                                          00340142
340143              WRITE AUDIT-RECORD                                  00340143
340144              MOVE SPACES              TO AUDIT-RECORD            00340144
340145                                                                  00340145
340146              STRING "BDT END YR:    "    WS-HOLD-MDL-YR2         00340146
340147                     DELIMITED BY SIZE                            00340147
340148                                     INTO AUDIT-RECORD            00340148
340149              END-STRING                                          00340149
340150              WRITE AUDIT-RECORD                                  00340150
340151              MOVE SPACES              TO AUDIT-RECORD            00340151
340152                                                                  00340152
340153              MOVE SQLCODE             TO DB2-ABEND-SQLCODE       00340153
340154              MOVE "SELECT"            TO DB2-ABEND-FUNCTION      00340154
340155              MOVE "MEXW033_BODY_TYPE" TO DB2-ABEND-TABLE         00340155
340156              MOVE DB2-ABEND-MSG       TO ABEND-MSG               00340156
340157              MOVE "7085P"             TO ABEND-PARAGRAPH         00340157
340158              PERFORM 9999I-ABEND                                 00340158
340159     END-EVALUATE                                                 00340159
340160     .                                                            00340160
340161***************************************************************** 00340161
340162* SELECT STATUS INFORMATION FROM MEXW003_VEH_STATUS               00340162
340163***************************************************************** 00340163
340164 7090P-SELECT-MEXW003.                                            00340164
340165                                                                  00340165
340166     EXEC SQL                                                     00340166
340167         SELECT  VST_STAT_Y                                       00340167
340168           INTO :VST-STAT-Y                                       00340168
340169           FROM  MEXW003_VEH_STATUS                               00340169
340170          WHERE  VEH_ORD_ID_C           = :WS-VST-VEH-ORD-ID-C    00340170
340171            AND  DTA_DATA_SRC_C         = :WS-VST-DTA-DATA-SRC-C  00340171
340172            AND  STA_STATUS_C           = :WS-VST-STA-STATUS-C    00340172
340173            AND  VST_LAST_OCCUR_F       = :WS-VST-LAST-OCCUR-F    00340173
340174            AND  VST_ACTIVE_F           = :WS-VST-ACTIVE-F        00340174
340175     END-EXEC                                                     00340175
340176                                                                  00340176
340177     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00340177
340178                                                                  00340178
340179     EVALUATE TRUE                                                00340179
340180         WHEN SC-DB2-SQLCODE-OK                                   00340180
340181              ADD +1                   TO WS-NBR-ROWS-READ-MEXW00300340181
340182              SET MEXW003-FOUND        TO TRUE                    00340182
340183         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00340183
340184              SET MEXW003-NOT-FOUND    TO TRUE                    00340184
340185         WHEN OTHER                                               00340185
340186              MOVE SPACES              TO AUDIT-RECORD            00340186
340187              WRITE AUDIT-RECORD                                  00340187
340188              STRING "VEHICLE ORDER: "   WS-VST-VEH-ORD-ID-C      00340188
340189                     DELIMITED BY SIZE                            00340189
340190                                     INTO AUDIT-RECORD            00340190
340191              END-STRING                                          00340191
340192              WRITE AUDIT-RECORD                                  00340192
340193              MOVE SPACES              TO AUDIT-RECORD            00340193
340194                                                                  00340194
340195              STRING "DATA SOURCE:   "  WS-VST-DTA-DATA-SRC-C     00340195
340196                     DELIMITED BY SIZE                            00340196
340197                                     INTO AUDIT-RECORD            00340197
340198              END-STRING                                          00340198
340199              WRITE AUDIT-RECORD                                  00340199
340200              MOVE SPACES              TO AUDIT-RECORD            00340200
340201                                                                  00340201
340202              STRING "STATUS CODE:   "   WS-VST-STA-STATUS-C      00340202
340203                     DELIMITED BY SIZE                            00340203
340204                                     INTO AUDIT-RECORD            00340204
340205              END-STRING                                          00340205
340206              WRITE AUDIT-RECORD                                  00340206
340207              MOVE SPACES              TO AUDIT-RECORD            00340207
340208                                                                  00340208
340209              MOVE SQLCODE             TO DB2-ABEND-SQLCODE       00340209
340210              MOVE "SELECT"            TO DB2-ABEND-FUNCTION      00340210
340211              MOVE "MEXW003_VEH_STATUS"                           00340211
340212                                       TO DB2-ABEND-TABLE         00340212
340213              MOVE DB2-ABEND-MSG       TO ABEND-MSG               00340213
340214              MOVE "7090P"             TO ABEND-PARAGRAPH         00340214
340215              PERFORM 9999I-ABEND                                 00340215
340216     END-EVALUATE                                                 00340216
340217     .                                                            00340217
340218                                                                  00340218
340219***************************************************************** 00340219
340220* OPENS THE MAIN DRIVING CURSOR WHICH WILL PULL ROWS FROM TABLE   00340220
340221* MEXW001 THAT ARE 1 MODEL YEAR BACK AND 2 MODEL YEARS FORWARD    00340221
340222* FROM THE CURRENT YEAR.                                          00340222
340223***************************************************************** 00340223
340224 8000P-OPEN-MEXW001-CSR.                                          00340224
340225                                                                  00340225
340226     EXEC SQL                                                     00340226
340227         OPEN MEXW001_CSR                                         00340227
340228     END-EXEC                                                     00340228
340229                                                                  00340229
340230     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00340230
340231     EVALUATE TRUE                                                00340231
340232        WHEN SC-DB2-SQLCODE-OK                                    00340232
340233             SET ERROR-NOT-FOUND       TO TRUE                    00340233
340234        WHEN SC-DB2-SQLCODE-INVALID-DATE                          00340234
340235             MOVE SPACES               TO AUDIT-RECORD            00340235
340236             WRITE                        AUDIT-RECORD            00340236
340237             MOVE LIT-INVALID-TIMESTAMP                           00340237
340238                                       TO AUDIT-RECORD            00340238
340239             WRITE                        AUDIT-RECORD            00340239
340240                                                                  00340240
340241             MOVE SPACES               TO AUDIT-RECORD            00340241
340242             STRING "DATA SOURCE:            "                    00340242
340243                                 VEH-DTA-DATA-SRC-C               00340243
340244                     DELIMITED BY SIZE                            00340244
340245                                    INTO AUDIT-RECORD             00340245
340246             END-STRING                                           00340246
340247             WRITE AUDIT-RECORD                                   00340247
340248             MOVE SPACES               TO AUDIT-RECORD            00340248
340249                                                                  00340249
340250             STRING "WS-PREV-RUN-TIMESTAMP:  "                    00340250
340251                                 WS-PREV-RUN-TIMESTAMP            00340251
340252                  DELIMITED BY SIZE  INTO AUDIT-RECORD            00340252
340253             END-STRING                                           00340253
340254             WRITE AUDIT-RECORD                                   00340254
340255             MOVE SPACES               TO AUDIT-RECORD            00340255
340256                                                                  00340256
340257             STRING "WS-CURR-DRBN-TIMESTAMP: "                    00340257
340258                                 WS-CURR-DRBN-TIMESTAMP           00340258
340259                  DELIMITED BY SIZE  INTO AUDIT-RECORD            00340259
340260             END-STRING                                           00340260
340261             WRITE AUDIT-RECORD                                   00340261
340262             MOVE SPACES               TO AUDIT-RECORD            00340262
340263                                                                  00340263
340264             STRING "CURRENT-MDL-YEAR:       "                    00340264
340265                                 WS-HOLD-MDL-YR-Y                 00340265
340266                  DELIMITED BY SIZE  INTO AUDIT-RECORD            00340266
340267             END-STRING                                           00340267
340268             WRITE AUDIT-RECORD                                   00340268
340269             MOVE SPACES               TO AUDIT-RECORD            00340269
340270                                                                  00340270
340271             WRITE AUDIT-RECORD                                   00340271
340272                                                                  00340272
340273             MOVE "OPEN 8000P"         TO AUDIT-RECORD            00340273
340274             WRITE                        AUDIT-RECORD            00340274
340275                                                                  00340275
340276             MOVE "MEXW001_CSR"        TO AUDIT-RECORD            00340276
340277             WRITE                        AUDIT-RECORD            00340277
340278                                                                  00340278
340279             MOVE SPACES               TO AUDIT-RECORD            00340279
340280             WRITE                        AUDIT-RECORD            00340280
340281             MOVE SQLCODE              TO DB2-ABEND-SQLCODE       00340281
340282             MOVE "OPEN"               TO DB2-ABEND-FUNCTION      00340282
340283             MOVE "MEXW001_CSR"        TO DB2-ABEND-TABLE         00340283
340284             MOVE DB2-ABEND-MSG        TO ABEND-MSG               00340284
340285             MOVE "8000P"              TO ABEND-PARAGRAPH         00340285
340286             PERFORM 9999I-ABEND                                  00340286
340287        WHEN OTHER                                                00340287
340288             MOVE SPACES               TO AUDIT-RECORD            00340288
340289             WRITE AUDIT-RECORD                                   00340289
340290             STRING "DATA SOURCE:            "                    00340290
340291                                 VEH-DTA-DATA-SRC-C               00340291
340292                     DELIMITED BY SIZE                            00340292
340293                                    INTO AUDIT-RECORD             00340293
340294             END-STRING                                           00340294
340295             WRITE AUDIT-RECORD                                   00340295
340296             MOVE SPACES               TO AUDIT-RECORD            00340296
340297                                                                  00340297
340298             STRING "WS-PREV-RUN-TIMESTAMP:  "                    00340298
340299                                 WS-PREV-RUN-TIMESTAMP            00340299
340300                     DELIMITED BY SIZE                            00340300
340301                                    INTO AUDIT-RECORD             00340301
340302             END-STRING                                           00340302
340303             WRITE AUDIT-RECORD                                   00340303
340304             MOVE SPACES               TO AUDIT-RECORD            00340304
340305                                                                  00340305
340306             STRING "WS-CURR-DRBN-TIMESTAMP: "                    00340306
340307                                 WS-CURR-DRBN-TIMESTAMP           00340307
340308                     DELIMITED BY SIZE                            00340308
340309                                    INTO AUDIT-RECORD             00340309
340310             END-STRING                                           00340310
340311             WRITE AUDIT-RECORD                                   00340311
340312             MOVE SPACES               TO AUDIT-RECORD            00340312
340313                                                                  00340313
340314             STRING "CURRENT-MDL-YEAR:       "                    00340314
340315                                 WS-HOLD-MDL-YR-Y                 00340315
340316                     DELIMITED BY SIZE                            00340316
340317                                    INTO AUDIT-RECORD             00340317
340318             END-STRING                                           00340318
340319             WRITE AUDIT-RECORD                                   00340319
340320             MOVE SPACES               TO AUDIT-RECORD            00340320
340321                                                                  00340321
340322             MOVE SQLCODE              TO DB2-ABEND-SQLCODE       00340322
340323             MOVE "OPEN"               TO DB2-ABEND-FUNCTION      00340323
340324             MOVE "MEXW001_CSR"        TO DB2-ABEND-TABLE         00340324
340325             MOVE DB2-ABEND-MSG        TO ABEND-MSG               00340325
340326             MOVE "8000P"              TO ABEND-PARAGRAPH         00340326
340327             PERFORM 9999I-ABEND                                  00340327
340328     END-EVALUATE                                                 00340328
340329     .                                                            00340329
340330                                                                  00340330
340331***************************************************************** 00340331
340332* FETCHES A ROW FROM THE MAIN DRIVING CURSOR WHICH WILL PULL ROWS 00340332
340333* FROM TABLE MEXW001 THAT ARE 1 MODEL YEAR BACK AND 2 MODEL       00340333
340334* YEARS FORWARD FROM THE CURRENT YEAR.                            00340334
340335***************************************************************** 00340335
340336 8005P-FETCH-MEXW001-CSR.                                         00340336
340337                                                                  00340337
340338     EXEC SQL                                                     00340338
340339         FETCH  MEXW001_CSR                                       00340339
340340          INTO  :VEH-VIN-FULL-C                                   00340340
340341               ,:VEH-ORD-ID-C                                     00340341
340342               ,:VEH-DTA-DATA-SRC-C                               00340342
340343               ,:VEH-BDT-MDL-YR-Y                                 00340343
340344               ,:VEH-DLR-DLR-C                                    00340344
340345               ,:VEH-WMI-WMI-C                                    00340345
340346               ,:VEH-LCL-PLT-C                                    00340346
340347               ,:VEH-LCL-BDYTYP-C                                 00340347
340348               ,:VEH-GBL-ORD-DLR-C                                00340348
340349               ,:VEH-GBL-SHIP-TO-C                                00340349
340350               ,:VEH-ORD-RCPT-Y                                   00340350
340351               ,:VEH-WDMO-FLEET-C                                 00340351
340352               ,:VEH-WDMO-ORD-TYP                                 00340352
340353               ,:VEH-CATALOG-C                                    00340353
340354               ,:VEH-GBL-CATALOG-C                                00340354
340355               ,:VEH-PO-Y                                         00340355
340356               ,:VEH-GEVIS-VL-C                                   00340356
340357               ,:VEH-COUNTRY-ISO3-C                               00340357
340358     END-EXEC                                                     00340358
340359                                                                  00340359
340360     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00340360
340361                                                                  00340361
340362     EVALUATE TRUE                                                00340362
340363        WHEN SC-DB2-SQLCODE-OK                                    00340363
340364             ADD +1                    TO                         00340364
340365                                  WS-NBR-ROWS-READ-MEXW001-CSR    00340365
340366             SET MEXW001-CSR-FOUND     TO TRUE                    00340366
340367        WHEN SC-DB2-SQLCODE-END-OF-CURSOR                         00340367
340368             SET MEXW001-CSR-NOT-FOUND TO TRUE                    00340368
340369        WHEN OTHER                                                00340369
340370             MOVE SPACES               TO AUDIT-RECORD            00340370
340371             WRITE AUDIT-RECORD                                   00340371
340372             STRING "DATA SOURCE:            "                    00340372
340373                                 VEH-DTA-DATA-SRC-C               00340373
340374                     DELIMITED BY SIZE                            00340374
340375                                    INTO AUDIT-RECORD             00340375
340376             END-STRING                                           00340376
340377             WRITE AUDIT-RECORD                                   00340377
340378             MOVE SPACES               TO AUDIT-RECORD            00340378
340379                                                                  00340379
340380             STRING "WS-PREV-RUN-TIMESTAMP:  "                    00340380
340381                                 WS-PREV-RUN-TIMESTAMP            00340381
340382                     DELIMITED BY SIZE                            00340382
340383                                    INTO AUDIT-RECORD             00340383
340384             END-STRING                                           00340384
340385             WRITE AUDIT-RECORD                                   00340385
340386             MOVE SPACES               TO AUDIT-RECORD            00340386
340387                                                                  00340387
340388             STRING "WS-CURR-DRBN-TIMESTAMP: "                    00340388
340389                                 WS-CURR-DRBN-TIMESTAMP           00340389
340390                     DELIMITED BY SIZE                            00340390
340391                                    INTO AUDIT-RECORD             00340391
340392             END-STRING                                           00340392
340393             WRITE AUDIT-RECORD                                   00340393
340394             MOVE SPACES               TO AUDIT-RECORD            00340394
340395                                                                  00340395
340396             STRING "CURRENT-MDL-YEAR:       "                    00340396
340397                                 WS-HOLD-MDL-YR-Y                 00340397
340398                     DELIMITED BY SIZE                            00340398
340399                                    INTO AUDIT-RECORD             00340399
340400             END-STRING                                           00340400
340401             WRITE AUDIT-RECORD                                   00340401
340402             MOVE SPACES               TO AUDIT-RECORD            00340402
340403                                                                  00340403
340409             MOVE SQLCODE              TO DB2-ABEND-SQLCODE       00340409
340410             MOVE "FETCH"              TO DB2-ABEND-FUNCTION      00340410
340411             MOVE "MEXW001_CSR"        TO DB2-ABEND-TABLE         00340411
340412             MOVE DB2-ABEND-MSG        TO ABEND-MSG               00340412
340413             MOVE "8005P"              TO ABEND-PARAGRAPH         00340413
340414             PERFORM 9999I-ABEND                                  00340414
340415     END-EVALUATE                                                 00340415
340416     .                                                            00340416
340417                                                                  00340417
340418***************************************************************** 00340418
340419* CLOSES THE MAIN DRIVING CURSOR WHICH PULLS ROWS FROM TABLE      00340419
340420* MEXW001 THAT ARE 1 MODEL YEAR BACK AND 2 MODEL YEARS FORWARD    00340420
340421* FROM THE CURRENT YEAR.                                          00340421
340422***************************************************************** 00340422
340423 8007P-CLOSE-MEXW001-CSR.                                         00340423
340424                                                                  00340424
340425     EXEC SQL                                                     00340425
340426         CLOSE MEXW001_CSR                                        00340426
340427     END-EXEC                                                     00340427
340428                                                                  00340428
340429     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00340429
340430     EVALUATE TRUE                                                00340430
340431        WHEN SC-DB2-SQLCODE-OK                                    00340431
340432             CONTINUE                                             00340432
340433        WHEN OTHER                                                00340433
340434             MOVE SQLCODE              TO DB2-ABEND-SQLCODE       00340434
340435             MOVE "CLOSE"              TO DB2-ABEND-FUNCTION      00340435
340436             MOVE "MEXW001_CSR"        TO DB2-ABEND-TABLE         00340436
340437             MOVE DB2-ABEND-MSG        TO ABEND-MSG               00340437
340438             MOVE "8007P"              TO ABEND-PARAGRAPH         00340438
340439             PERFORM 9999I-ABEND                                  00340439
340440     END-EVALUATE                                                 00340440
340441     .                                                            00340441
340442***************************************************************** 00340442
340443* OPENS THE SALES CHECK CURSOR WHICH RETRIEVES ALL SALES THAT     00340443
340444* HAVE OCCURRED IN THE PAST 12 MONTHS THAT HAVE A MODEL YEAR THAT 00340444
340445* IS OLDER THAN 1 YEAR FROM THE CURRENT YEAR.                     00340445
340446***************************************************************** 00340446
340447 8100P-OPEN-SALE-CHK-CSR.                                         00340447
340448                                                                  00340448
340449     EXEC SQL                                                     00340449
340450         OPEN SALE_CHK_CSR                                        00340450
340451     END-EXEC                                                     00340451
340452                                                                  00340452
340453     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00340453
340454     EVALUATE TRUE                                                00340454
340455        WHEN SC-DB2-SQLCODE-OK                                    00340455
340456             CONTINUE                                             00340456
340457        WHEN OTHER                                                00340457
340458             MOVE SPACES               TO AUDIT-RECORD            00340458
340459             WRITE AUDIT-RECORD                                   00340459
340460             STRING "DATA SOURCE:            "                    00340460
340461                                 VEH-DTA-DATA-SRC-C               00340461
340462                     DELIMITED BY SIZE                            00340462
340463                                    INTO AUDIT-RECORD             00340463
340464             END-STRING                                           00340464
340465             WRITE AUDIT-RECORD                                   00340465
340466             MOVE SPACES               TO AUDIT-RECORD            00340466
340467                                                                  00340467
340468             STRING "WS-PREV-RUN-TIMESTAMP:  "                    00340468
340469                                 WS-PREV-RUN-TIMESTAMP            00340469
340470                     DELIMITED BY SIZE                            00340470
340471                                    INTO AUDIT-RECORD             00340471
340472             END-STRING                                           00340472
340473             WRITE AUDIT-RECORD                                   00340473
340474             MOVE SPACES               TO AUDIT-RECORD            00340474
340475                                                                  00340475
340476             STRING "WS-CURR-DRBN-TIMESTAMP: "                    00340476
340477                                 WS-CURR-DRBN-TIMESTAMP           00340477
340478                     DELIMITED BY SIZE                            00340478
340479                                    INTO AUDIT-RECORD             00340479
340480             END-STRING                                           00340480
340481             WRITE AUDIT-RECORD                                   00340481
340482             MOVE SPACES               TO AUDIT-RECORD            00340482
340483                                                                  00340483
340484             STRING "CURRENT-MDL-YEAR:       "                    00340484
340485                                 WS-HOLD-MDL-YR-Y                 00340485
340486                     DELIMITED BY SIZE                            00340486
340487                                    INTO AUDIT-RECORD             00340487
340488             END-STRING                                           00340488
340489             WRITE AUDIT-RECORD                                   00340489
340490             MOVE SPACES               TO AUDIT-RECORD            00340490
340524                                                                  00340524
340525             MOVE SQLCODE              TO DB2-ABEND-SQLCODE       00340525
340526             MOVE "OPEN"               TO DB2-ABEND-FUNCTION      00340526
340527             MOVE "SALE_CHK_CSR"       TO DB2-ABEND-TABLE         00340527
340528             MOVE DB2-ABEND-MSG        TO ABEND-MSG               00340528
340529             MOVE "8100P"              TO ABEND-PARAGRAPH         00340529
340530             PERFORM 9999I-ABEND                                  00340530
340531     END-EVALUATE                                                 00340531
340532     .                                                            00340532
340533                                                                  00340533
340534***************************************************************** 00340534
340535* FETCHES A ROW FROM THE SALES CHECK CURSOR WHICH RETRIEVES ALL   00340535
340536* SALES THAT HAVE OCCURRED IN THE PAST 12 MONTHS THAT HAVE A      00340536
340537* MODEL YEAR THAT IS OLDER THAN 1 YEAR FROM THE CURRENT YEAR.     00340537
340538***************************************************************** 00340538
340539 8105P-FETCH-SALE-CHK-CSR.                                        00340539
340540                                                                  00340540
340541     EXEC SQL                                                     00340541
340542         FETCH  SALE_CHK_CSR                                      00340542
340543          INTO :VEH-VIN-FULL-C                                    00340543
340544               ,:VEH-ORD-ID-C                                     00340544
340545               ,:VEH-DTA-DATA-SRC-C                               00340545
340546               ,:VEH-BDT-MDL-YR-Y                                 00340546
340547               ,:VEH-WMI-WMI-C                                    00340547
340548               ,:VEH-LCL-PLT-C                                    00340548
340549               ,:VEH-LCL-BDYTYP-C                                 00340549
340550               ,:VEH-GBL-ORD-DLR-C                                00340550
340551               ,:VEH-GBL-SHIP-TO-C                                00340551
340552               ,:VEH-ORD-RCPT-Y                                   00340552
340553               ,:VEH-WDMO-FLEET-C                                 00340553
340554               ,:VEH-WDMO-ORD-TYP                                 00340554
340555               ,:VEH-CATALOG-C                                    00340555
340556               ,:VEH-GBL-CATALOG-C                                00340556
340557               ,:VEH-PO-Y                                         00340557
340558               ,:VEH-GEVIS-VL-C                                   00340558
340559               ,:VEH-COUNTRY-ISO3-C                               00340559
340560     END-EXEC                                                     00340560
340561                                                                  00340561
340562     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00340562
340563                                                                  00340563
340564     EVALUATE TRUE                                                00340564
340565        WHEN SC-DB2-SQLCODE-OK                                    00340565
340566             ADD +1                    TO                         00340566
340567                                       WS-NBR-ROWS-READ-SALE-CHK  00340567
340568             SET SALE-CHK-FOUND        TO TRUE                    00340568
340569        WHEN SC-DB2-SQLCODE-END-OF-CURSOR                         00340569
340570             SET SALE-CHK-NOT-FOUND    TO TRUE                    00340570
340571        WHEN OTHER                                                00340571
340572             MOVE SPACES               TO AUDIT-RECORD            00340572
340573             WRITE AUDIT-RECORD                                   00340573
340574             STRING "DATA SOURCE:            "                    00340574
340575                                 VEH-DTA-DATA-SRC-C               00340575
340576                     DELIMITED BY SIZE                            00340576
340577                                    INTO AUDIT-RECORD             00340577
340578             END-STRING                                           00340578
340579             WRITE AUDIT-RECORD                                   00340579
340580             MOVE SPACES               TO AUDIT-RECORD            00340580
340581                                                                  00340581
340582             STRING "WS-PREV-RUN-TIMESTAMP:  "                    00340582
340583                                 WS-PREV-RUN-TIMESTAMP            00340583
340584                     DELIMITED BY SIZE                            00340584
340585                                    INTO AUDIT-RECORD             00340585
340586             END-STRING                                           00340586
340587             WRITE AUDIT-RECORD                                   00340587
340588             MOVE SPACES               TO AUDIT-RECORD            00340588
340589                                                                  00340589
340590             STRING "WS-CURR-DRBN-TIMESTAMP: "                    00340590
340591                                 WS-CURR-DRBN-TIMESTAMP           00340591
340592                     DELIMITED BY SIZE                            00340592
340593                                    INTO AUDIT-RECORD             00340593
340594             END-STRING                                           00340594
340595             WRITE AUDIT-RECORD                                   00340595
340596             MOVE SPACES               TO AUDIT-RECORD            00340596
340597                                                                  00340597
340598             STRING "CURRENT-MDL-YEAR:       "                    00340598
340599                                 WS-HOLD-MDL-YR-Y                 00340599
340600                     DELIMITED BY SIZE                            00340600
340601                                    INTO AUDIT-RECORD             00340601
340602             END-STRING                                           00340602
340603             WRITE AUDIT-RECORD                                   00340603
340604             MOVE SPACES               TO AUDIT-RECORD            00340604
340638                                                                  00340638
340639             MOVE SQLCODE              TO DB2-ABEND-SQLCODE       00340639
340640             MOVE "FETCH"              TO DB2-ABEND-FUNCTION      00340640
340641             MOVE "SALE-CHK-CSR"       TO DB2-ABEND-TABLE         00340641
340642             MOVE DB2-ABEND-MSG        TO ABEND-MSG               00340642
340643             MOVE "8105P"              TO ABEND-PARAGRAPH         00340643
340644             PERFORM 9999I-ABEND                                  00340644
340645     END-EVALUATE                                                 00340645
340646     .                                                            00340646
340647                                                                  00340647
340648***************************************************************** 00340648
340649* CLOSES THE SALES CHECK CURSOR WHICH RETRIEVES ALL SALES THAT    00340649
340650* HAVE OCCURRED IN THE PAST 12 MONTHS THAT HAVE A MODEL YEAR THAT 00340650
340651* IS OLDER THAN 1 YEAR FROM THE CURRENT YEAR.                     00340651
340652***************************************************************** 00340652
340653 8107P-CLOSE-SALE-CHK-CSR.                                        00340653
340654                                                                  00340654
340655     EXEC SQL                                                     00340655
340656         CLOSE SALE_CHK_CSR                                       00340656
340657     END-EXEC                                                     00340657
340658                                                                  00340658
340659     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00340659
340660     EVALUATE TRUE                                                00340660
340661        WHEN SC-DB2-SQLCODE-OK                                    00340661
340662             CONTINUE                                             00340662
340663        WHEN OTHER                                                00340663
340664             MOVE SQLCODE              TO DB2-ABEND-SQLCODE       00340664
340665             MOVE "CLOSE"              TO DB2-ABEND-FUNCTION      00340665
340666             MOVE "SALE_CHK_CSR"       TO DB2-ABEND-TABLE         00340666
340667             MOVE DB2-ABEND-MSG        TO ABEND-MSG               00340667
340668             MOVE "8107P"              TO ABEND-PARAGRAPH         00340668
340669             PERFORM 9999I-ABEND                                  00340669
340670     END-EVALUATE                                                 00340670
340671     .                                                            00340671
340672******************************************************************00340672
340673* A CURSOR WILL BE CREATED USING TABLE MEXW031.  ALL NON 'NA' AND 00340673
340674* NON 'EA' SOURCES WILL SELECT FROM IT.  THE RETRIEVED VALUES     00340674
340675* WILL BE SENT IN PLACE OF THE LOCAL BODY STYLE CODE THAT WAS     00340675
340676* OBTAINED FROM TABLE MEXW001_VEH_ORDER.                          00340676
340677******************************************************************00340677
340678 8200P-OPEN-MEXW031-CSR.                                          00340678
340679                                                                  00340679
340680                                                                  00340680
340681     EXEC SQL                                                     00340681
340682        OPEN MEXW031_CSR                                          00340682
340683     END-EXEC                                                     00340683
340684                                                                  00340684
340685     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00340685
340686                                                                  00340686
340687     EVALUATE TRUE                                                00340687
340688         WHEN SC-DB2-SQLCODE-OK                                   00340688
340689              CONTINUE                                            00340689
340690         WHEN OTHER                                               00340690
340691              MOVE SPACES              TO AUDIT-RECORD            00340691
340692              WRITE AUDIT-RECORD                                  00340692
340693              STRING "DATA SOURCE  : "    CTM-DTA-DATA-SRC-C      00340693
340694                     DELIMITED BY SIZE                            00340694
340695                                     INTO AUDIT-RECORD            00340695
340696              END-STRING                                          00340696
340697              WRITE AUDIT-RECORD                                  00340697
340698              MOVE SPACES              TO AUDIT-RECORD            00340698
340699                                                                  00340699
340700              STRING "CATALOG CODE:  "    CTM-LCL-CATALOG-C       00340700
340701                     DELIMITED BY SIZE                            00340701
340702                                     INTO AUDIT-RECORD            00340702
340703              END-STRING                                          00340703
340704              WRITE AUDIT-RECORD                                  00340704
340705              MOVE SPACES              TO AUDIT-RECORD            00340705
340706                                                                  00340706
340707              MOVE SQLCODE             TO DB2-ABEND-SQLCODE       00340707
340708              MOVE "OPEN"              TO DB2-ABEND-FUNCTION      00340708
340709              MOVE "MEXW031_CATMAP"    TO DB2-ABEND-TABLE         00340709
340710              MOVE DB2-ABEND-MSG       TO ABEND-MSG               00340710
340711              MOVE "8200P"             TO ABEND-PARAGRAPH         00340711
340712              PERFORM 9999I-ABEND                                 00340712
340713     END-EVALUATE                                                 00340713
340714     .                                                            00340714
340715                                                                  00340715
340716******************************************************************00340716
340717* FETCHES A ROW FROM MEXW031_CSR WHICH WILL RETRIEVE OPTION CODE  00340717
340718* AND PRODUCT TYPE WHICH WILL BE COMBINED AND THEN USED TO POP-   00340718
340719* ULATE THE WERS BODY STYLE CODE FOR NON 'NA' AND NON 'EA' DATA   00340719
340720* SOURCES.                                                        00340720
340721******************************************************************00340721
340722 8205P-FETCH-MEXW031-CSR.                                         00340722
340723                                                                  00340723
340724     EXEC SQL                                                     00340724
340725        FETCH  MEXW031_CSR                                        00340725
340726         INTO   :CTM-OPT-OPTION-C                                 00340726
340727               ,:CTM-VPT-PROD-TYP-C                               00340727
340728     END-EXEC                                                     00340728
340729                                                                  00340729
340730     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00340730
340731                                                                  00340731
340732     EVALUATE TRUE                                                00340732
340733         WHEN SC-DB2-SQLCODE-OK                                   00340733
340734              ADD +1                   TO WS-NBR-ROWS-READ-MEXW03100340734
340735              SET MEXW031-FOUND        TO TRUE                    00340735
340736         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00340736
340737              SET MEXW031-NOT-FOUND    TO TRUE                    00340737
340738         WHEN OTHER                                               00340738
340739              MOVE SPACES              TO AUDIT-RECORD            00340739
340740              WRITE AUDIT-RECORD                                  00340740
340741              STRING "DATA SOURCE  : "    CTM-DTA-DATA-SRC-C      00340741
340742                     DELIMITED BY SIZE                            00340742
340743                                     INTO AUDIT-RECORD            00340743
340744              END-STRING                                          00340744
340745              WRITE AUDIT-RECORD                                  00340745
340746              MOVE SPACES              TO AUDIT-RECORD            00340746
340747                                                                  00340747
340748              STRING "CATALOG CODE:  "    CTM-LCL-CATALOG-C       00340748
340749                     DELIMITED BY SIZE                            00340749
340750                                     INTO AUDIT-RECORD            00340750
340751              END-STRING                                          00340751
340752              WRITE AUDIT-RECORD                                  00340752
340753              MOVE SPACES              TO AUDIT-RECORD            00340753
340754                                                                  00340754
340755              MOVE SQLCODE             TO DB2-ABEND-SQLCODE       00340755
340756              MOVE "FETCH"             TO DB2-ABEND-FUNCTION      00340756
340757              MOVE "MEXW031_CATMAP"    TO DB2-ABEND-TABLE         00340757
340758              MOVE DB2-ABEND-MSG       TO ABEND-MSG               00340758
340759              MOVE "8205P"             TO ABEND-PARAGRAPH         00340759
340760              PERFORM 9999I-ABEND                                 00340760
340761     END-EVALUATE                                                 00340761
340762     .                                                            00340762
340763                                                                  00340763
340764******************************************************************00340764
340765* CLOSES CURSOR MEXW031_CSR WHICH RETRIEVED THE OPTION CODE AND   00340765
340766* PRODUCT TYPE FOR NON 'NA' AND NON 'EA' DATA SOURCES.            00340766
340767******************************************************************00340767
340768 8207P-CLOSE-MEXW031-CSR.                                         00340768
340769                                                                  00340769
340770     EXEC SQL                                                     00340770
340771        CLOSE MEXW031_CSR                                         00340771
340772     END-EXEC                                                     00340772
340773                                                                  00340773
340774     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00340774
340775                                                                  00340775
340776     EVALUATE TRUE                                                00340776
340777         WHEN SC-DB2-SQLCODE-OK                                   00340777
340778              CONTINUE                                            00340778
340779         WHEN OTHER                                               00340779
340780              MOVE SQLCODE             TO DB2-ABEND-SQLCODE       00340780
340781              MOVE "CLOSE"             TO DB2-ABEND-FUNCTION      00340781
340782              MOVE "MEXW031_CATMAP"    TO DB2-ABEND-TABLE         00340782
340783              MOVE DB2-ABEND-MSG       TO ABEND-MSG               00340783
340784              MOVE "8207P"             TO ABEND-PARAGRAPH         00340784
340785              PERFORM 9999I-ABEND                                 00340785
340786     END-EVALUATE                                                 00340786
340787     .                                                            00340787
340788******************************************************************00340788
340789* AT THIS POINT, A CURSOR WILL BE CREATED USING TABLE MEXW003 TO  00340789
340790* SELECT ALL 40V STATUS CODES WITH AN FTC QAD CURRENT DATA SOURCE 00340790
340791* (WD). THE NEWEST ROW CONTAINS THE WHOLESALE GLOBAL DEALER CODE  00340791
340792* TO SEND TO VINCENT. AN "ORDER BY VST_STAT_Y DESC" IS USED       00340792
340793* TO ACCOMPLISH THIS, WITH THE STATIC TIMESTAMP BREAKING ANY TIES.00340793
340794******************************************************************00340794
340795 8300P-OPEN-40V-CSR.                                              00340795
340796                                                                  00340796
340797     EXEC SQL                                                     00340797
340798        OPEN MEXW003_40V_CSR                                      00340798
340799     END-EXEC                                                     00340799
340800                                                                  00340800
340801     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00340801
340802                                                                  00340802
340803     EVALUATE TRUE                                                00340803
340804         WHEN SC-DB2-SQLCODE-OK                                   00340804
340805              CONTINUE                                            00340805
340806                                                                  00340806
340807         WHEN OTHER                                               00340807
340808              MOVE SPACES              TO AUDIT-RECORD            00340808
340809              WRITE AUDIT-RECORD                                  00340809
340810              STRING "DATA SOURCE:        "                       00340810
340811                                          VST-DTA-DATA-SRC-C      00340811
340812                     DELIMITED BY SIZE                            00340812
340813                                     INTO AUDIT-RECORD            00340813
340814              END-STRING                                          00340814
340815              WRITE AUDIT-RECORD                                  00340815
340816              MOVE SPACES               TO AUDIT-RECORD           00340816
340817                                                                  00340817
340818              STRING "VEHICLE ORDER:      "                       00340818
340819                                          VST-VEH-ORD-ID-C        00340819
340820                     DELIMITED BY SIZE                            00340820
340821                                     INTO AUDIT-RECORD            00340821
340822              END-STRING                                          00340822
340823              WRITE AUDIT-RECORD                                  00340823
340824              MOVE SPACES               TO AUDIT-RECORD           00340824
340825                                                                  00340825
340826              STRING "CURR DATA SOURCE:   "                       00340826
340827                                          VST-DTA-DATA-SRC-C      00340827
340828                     DELIMITED BY SIZE                            00340828
340829                                     INTO AUDIT-RECORD            00340829
340830              END-STRING                                          00340830
340831              WRITE AUDIT-RECORD                                  00340831
340832              MOVE SPACES               TO AUDIT-RECORD           00340832
340833                                                                  00340833
340834              STRING "STATUS CODE:        "                       00340834
340835                                          VST-STA-STATUS-C        00340835
340836                     DELIMITED BY SIZE                            00340836
340837                                     INTO AUDIT-RECORD            00340837
340838              END-STRING                                          00340838
340839              WRITE AUDIT-RECORD                                  00340839
340840              MOVE SPACES               TO AUDIT-RECORD           00340840
340841                                                                  00340841
340842              MOVE SQLCODE             TO DB2-ABEND-SQLCODE       00340842
340843              MOVE "OPEN"              TO DB2-ABEND-FUNCTION      00340843
340844              MOVE "MEXW003_40V_CSR"   TO DB2-ABEND-TABLE         00340844
340845              MOVE DB2-ABEND-MSG       TO ABEND-MSG               00340845
340846              MOVE "8300P"             TO ABEND-PARAGRAPH         00340846
340847              PERFORM 9999I-ABEND                                 00340847
340848     END-EVALUATE                                                 00340848
340849     .                                                            00340849
340850                                                                  00340850
340851******************************************************************00340851
340852* FETCHES A ROW FROM MEXW003_40V_CSR WHICH WILL RETRIEVE THE      00340852
340853* MOST RECENT FTC QAD (WD) WHOLESALE GLOBAL DEALER CODE.          00340853
340854******************************************************************00340854
340855 8305P-FETCH-40V-ROW.                                             00340855
340856                                                                  00340856
340857     EXEC SQL                                                     00340857
340858        FETCH  MEXW003_40V_CSR                                    00340858
340859         INTO   :VST-GBL-LOC-C                                    00340859
340860     END-EXEC                                                     00340860
340861                                                                  00340861
340862     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00340862
340863                                                                  00340863
340864     EVALUATE TRUE                                                00340864
340865         WHEN SC-DB2-SQLCODE-OK                                   00340865
340866              ADD +1                   TO WS-NBR-ROWS-READ-MEXW00300340866
340867              SET MEXW003-40V-CSR-ROW-FOUND                       00340867
340868                                       TO TRUE                    00340868
340869         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00340869
340870              SET MEXW003-40V-CSR-ROW-NOT-FOUND                   00340870
340871                                       TO TRUE                    00340871
340872         WHEN OTHER                                               00340872
340873              MOVE SPACES              TO AUDIT-RECORD            00340873
340874              WRITE AUDIT-RECORD                                  00340874
340875              STRING "VEHICLE ORDER:      "                       00340875
340876                                          VST-VEH-ORD-ID-C        00340876
340877                     DELIMITED BY SIZE                            00340877
340878                                     INTO AUDIT-RECORD            00340878
340879              END-STRING                                          00340879
340880              WRITE AUDIT-RECORD                                  00340880
340881              MOVE SPACES               TO AUDIT-RECORD           00340881
340882              STRING "DATA SOURCE:        "                       00340882
340883                                          VST-DTA-DATA-SRC-C      00340883
340884                     DELIMITED BY SIZE                            00340884
340885                                     INTO AUDIT-RECORD            00340885
340886              END-STRING                                          00340886
340887              WRITE AUDIT-RECORD                                  00340887
340888              MOVE SPACES               TO AUDIT-RECORD           00340888
340889              STRING "CURR DATA SOURCE:   "                       00340889
340890                                          VST-DTA-DATA-SRC-C      00340890
340891                     DELIMITED BY SIZE                            00340891
340892                                     INTO AUDIT-RECORD            00340892
340893              END-STRING                                          00340893
340894              WRITE AUDIT-RECORD                                  00340894
340895              MOVE SPACES               TO AUDIT-RECORD           00340895
340896                                                                  00340896
340897              STRING "STATUS CODE:        "                       00340897
340898                                          VST-STA-STATUS-C        00340898
340899                     DELIMITED BY SIZE                            00340899
340900                                     INTO AUDIT-RECORD            00340900
340901              END-STRING                                          00340901
340902              WRITE AUDIT-RECORD                                  00340902
340903              MOVE SPACES               TO AUDIT-RECORD           00340903
340904                                                                  00340904
340905              MOVE SQLCODE             TO DB2-ABEND-SQLCODE       00340905
340906              MOVE "FETCH"             TO DB2-ABEND-FUNCTION      00340906
340907              MOVE "MEXW003_40V_CSR"   TO DB2-ABEND-TABLE         00340907
340908              MOVE DB2-ABEND-MSG       TO ABEND-MSG               00340908
340909              MOVE "8305P"             TO ABEND-PARAGRAPH         00340909
340910              PERFORM 9999I-ABEND                                 00340910
340911     END-EVALUATE                                                 00340911
340912     .                                                            00340912
340913                                                                  00340913
340914******************************************************************00340914
340915* CLOSES THE MEXW003_40V_CSR WHICH WAS USED TO RETRIEVE THE       00340915
340916* MOST RECENT FTC QAD (WD) WHOLESALE GLOBAL DEALER CODE.          00340916
340917******************************************************************00340917
340918 8307P-CLOSE-40V-CSR.                                             00340918
340919                                                                  00340919
340920     EXEC SQL                                                     00340920
340921        CLOSE MEXW003_40V_CSR                                     00340921
340922     END-EXEC                                                     00340922
340923                                                                  00340923
340924     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00340924
340925                                                                  00340925
340926     EVALUATE TRUE                                                00340926
340927         WHEN SC-DB2-SQLCODE-OK                                   00340927
340928              CONTINUE                                            00340928
340929         WHEN OTHER                                               00340929
340930              MOVE SQLCODE             TO DB2-ABEND-SQLCODE       00340930
340931              MOVE "CLOSE"             TO DB2-ABEND-FUNCTION      00340931
340932              MOVE "MEXW003_40V_CSR"   TO DB2-ABEND-TABLE         00340932
340933              MOVE DB2-ABEND-MSG       TO ABEND-MSG               00340933
340934              MOVE "8307P"             TO ABEND-PARAGRAPH         00340934
340935              PERFORM 9999I-ABEND                                 00340935
340936     END-EVALUATE                                                 00340936
340937     .                                                            00340937
340938***************************************************************** 00340938
340939* OPENS MEXW003_CSR                                               00340939
340940***************************************************************** 00340940
340941 8400P-OPEN-MEXW003-CSR.                                          00340941
340942                                                                  00340942
340943     EXEC SQL                                                     00340943
340944         OPEN MEXW003_CSR                                         00340944
340945     END-EXEC                                                     00340945
340946                                                                  00340946
340947     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00340947
340948     EVALUATE TRUE                                                00340948
340949        WHEN SC-DB2-SQLCODE-OK                                    00340949
340950             CONTINUE                                             00340950
340951        WHEN OTHER                                                00340951
340952             MOVE SPACES               TO AUDIT-RECORD            00340952
340953             WRITE AUDIT-RECORD                                   00340953
340954             STRING "DATA SOURCE:            "                    00340954
340955                                 VEH-DTA-DATA-SRC-C               00340955
340956                  DELIMITED BY SIZE  INTO AUDIT-RECORD            00340956
340957             END-STRING                                           00340957
340958             WRITE AUDIT-RECORD                                   00340958
340959             MOVE SPACES               TO AUDIT-RECORD            00340959
340960                                                                  00340960
340961             STRING "WS-PREV-RUN-TIMESTAMP:  "                    00340961
340962                                 WS-PREV-RUN-TIMESTAMP            00340962
340963                  DELIMITED BY SIZE  INTO AUDIT-RECORD            00340963
340964             END-STRING                                           00340964
340965             WRITE AUDIT-RECORD                                   00340965
340966             MOVE SPACES               TO AUDIT-RECORD            00340966
340967                                                                  00340967
340968             STRING "WS-CURR-DRBN-TIMESTAMP: "                    00340968
340969                                 WS-CURR-DRBN-TIMESTAMP           00340969
340970                  DELIMITED BY SIZE  INTO AUDIT-RECORD            00340970
340971             END-STRING                                           00340971
340972             WRITE AUDIT-RECORD                                   00340972
340973             MOVE SPACES               TO AUDIT-RECORD            00340973
340974                                                                  00340974
340975             STRING "CURRENT MODEL YEAR:     "                    00340975
340976                                 WS-HOLD-MDL-YR-Y                 00340976
340977                  DELIMITED BY SIZE  INTO AUDIT-RECORD            00340977
340978             END-STRING                                           00340978
340979             WRITE AUDIT-RECORD                                   00340979
340980             MOVE SPACES               TO AUDIT-RECORD            00340980
340981                                                                  00340981
340982             MOVE SQLCODE              TO DB2-ABEND-SQLCODE       00340982
340983             MOVE "OPEN"               TO DB2-ABEND-FUNCTION      00340983
340984             MOVE "MEXW003_CSR"        TO DB2-ABEND-TABLE         00340984
340985             MOVE DB2-ABEND-MSG        TO ABEND-MSG               00340985
340986             MOVE "8400P"              TO ABEND-PARAGRAPH         00340986
340987             PERFORM 9999I-ABEND                                  00340987
340988     END-EVALUATE                                                 00340988
340989     .                                                            00340989
340990                                                                  00340990
340991***************************************************************** 00340991
340992* FETCHES A ROW FROM MEXW003_CSR                                  00340992
340993***************************************************************** 00340993
340994 8405P-FETCH-MEXW003-CSR.                                         00340994
340995                                                                  00340995
340996     EXEC SQL                                                     00340996
340997         FETCH  MEXW003_CSR                                       00340997
340998          INTO  :VEH-VIN-FULL-C                                   00340998
340999               ,:VEH-ORD-ID-C                                     00340999
341000               ,:VEH-DTA-DATA-SRC-C                               00341000
341001               ,:VEH-BDT-MDL-YR-Y                                 00341001
341002               ,:VEH-DLR-DLR-C                                    00341002
341003               ,:VEH-WMI-WMI-C                                    00341003
341004               ,:VEH-LCL-PLT-C                                    00341004
341005               ,:VEH-LCL-BDYTYP-C                                 00341005
341006               ,:VEH-GBL-ORD-DLR-C                                00341006
341007               ,:VEH-GBL-SHIP-TO-C                                00341007
341008               ,:VEH-ORD-RCPT-Y                                   00341008
341009               ,:VEH-WDMO-FLEET-C                                 00341009
341010               ,:VEH-WDMO-ORD-TYP                                 00341010
341011               ,:VEH-CATALOG-C                                    00341011
341012               ,:VEH-GBL-CATALOG-C                                00341012
341013               ,:VEH-PO-Y                                         00341013
341014               ,:VEH-GEVIS-VL-C                                   00341014
341015               ,:VEH-COUNTRY-ISO3-C                               00341015
341016     END-EXEC                                                     00341016
341017                                                                  00341017
341018     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00341018
341019                                                                  00341019
341020     EVALUATE TRUE                                                00341020
341021        WHEN SC-DB2-SQLCODE-OK                                    00341021
341022             ADD +1                    TO                         00341022
341023                               WS-NBR-ROWS-READ-MEXW003-CSR       00341023
341024             SET MEXW003-CSR-FOUND     TO TRUE                    00341024
341025        WHEN SC-DB2-SQLCODE-END-OF-CURSOR                         00341025
341026             SET MEXW003-CSR-NOT-FOUND TO TRUE                    00341026
341027        WHEN OTHER                                                00341027
341028             MOVE SPACES               TO AUDIT-RECORD            00341028
341029             WRITE AUDIT-RECORD                                   00341029
341030             STRING "DATA SOURCE:            "                    00341030
341031                                 VEH-DTA-DATA-SRC-C               00341031
341032                  DELIMITED BY SIZE  INTO AUDIT-RECORD            00341032
341033             END-STRING                                           00341033
341034             WRITE AUDIT-RECORD                                   00341034
341035             MOVE SPACES               TO AUDIT-RECORD            00341035
341036                                                                  00341036
341037             STRING "WS-PREV-RUN-TIMESTAMP:  "                    00341037
341038                                 WS-PREV-RUN-TIMESTAMP            00341038
341039                  DELIMITED BY SIZE  INTO AUDIT-RECORD            00341039
341040             END-STRING                                           00341040
341041             WRITE AUDIT-RECORD                                   00341041
341042             MOVE SPACES               TO AUDIT-RECORD            00341042
341043                                                                  00341043
341044             STRING "WS-CURR-DRBN-TIMESTAMP: "                    00341044
341045                                 WS-CURR-DRBN-TIMESTAMP           00341045
341046                  DELIMITED BY SIZE  INTO AUDIT-RECORD            00341046
341047             END-STRING                                           00341047
341048             WRITE AUDIT-RECORD                                   00341048
341049             MOVE SPACES               TO AUDIT-RECORD            00341049
341050                                                                  00341050
341051             STRING "CURRENT MODEL YEAR:     "                    00341051
341052                                 WS-HOLD-MDL-YR-Y                 00341052
341053                  DELIMITED BY SIZE  INTO AUDIT-RECORD            00341053
341054             END-STRING                                           00341054
341055             WRITE AUDIT-RECORD                                   00341055
341056             MOVE SPACES               TO AUDIT-RECORD            00341056
341057                                                                  00341057
341058             MOVE SQLCODE              TO DB2-ABEND-SQLCODE       00341058
341059             MOVE "FETCH"              TO DB2-ABEND-FUNCTION      00341059
341060             MOVE "MEXW003_CSR"        TO DB2-ABEND-TABLE         00341060
341061             MOVE DB2-ABEND-MSG        TO ABEND-MSG               00341061
341062             MOVE "8405P"              TO ABEND-PARAGRAPH         00341062
341063             PERFORM 9999I-ABEND                                  00341063
341064     END-EVALUATE                                                 00341064
341065     .                                                            00341065
341066                                                                  00341066
341067***************************************************************** 00341067
341068* CLOSES MEXW003_CSR CURSOR                                       00341068
341069***************************************************************** 00341069
341070 8407P-CLOSE-MEXW003-CSR.                                         00341070
341071                                                                  00341071
341072     EXEC SQL                                                     00341072
341073         CLOSE MEXW003_CSR                                        00341073
341074     END-EXEC                                                     00341074
341075                                                                  00341075
341076     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00341076
341077                                                                  00341077
341078     IF  NOT SC-DB2-SQLCODE-OK                                    00341078
341079         MOVE SQLCODE                  TO DB2-ABEND-SQLCODE       00341079
341080         MOVE "CLOSE"                  TO DB2-ABEND-FUNCTION      00341080
341081         MOVE "MEXW003_CSR"            TO DB2-ABEND-TABLE         00341081
341082         MOVE DB2-ABEND-MSG            TO ABEND-MSG               00341082
341083         MOVE "8407P"                  TO ABEND-PARAGRAPH         00341083
341084         PERFORM 9999I-ABEND                                      00341084
341085     END-IF                                                       00341085
341086     .                                                            00341086
341087***************************************************************** 00341087
341088* OPENS MEXW008_CSR CURSOR                                        00341088
341089***************************************************************** 00341089
341090 8500P-OPEN-MEXW008-CSR.                                          00341090
341091                                                                  00341091
341092     EXEC SQL                                                     00341092
341093         OPEN MEXW008_CSR                                         00341093
341094     END-EXEC                                                     00341094
341095                                                                  00341095
341096     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00341096
341097     EVALUATE TRUE                                                00341097
341098        WHEN SC-DB2-SQLCODE-OK                                    00341098
341099             CONTINUE                                             00341099
341100        WHEN OTHER                                                00341100
341101             MOVE SPACES               TO AUDIT-RECORD            00341101
341102             WRITE AUDIT-RECORD                                   00341102
341103             STRING "DATA SOURCE:            "                    00341103
341104                                 VEH-DTA-DATA-SRC-C               00341104
341105                  DELIMITED BY SIZE  INTO AUDIT-RECORD            00341105
341106             END-STRING                                           00341106
341107             WRITE AUDIT-RECORD                                   00341107
341108             MOVE SPACES               TO AUDIT-RECORD            00341108
341109                                                                  00341109
341110             STRING "WS-PREV-RUN-TIMESTAMP:  "                    00341110
341111                                 WS-PREV-RUN-TIMESTAMP            00341111
341112                  DELIMITED BY SIZE  INTO AUDIT-RECORD            00341112
341113             END-STRING                                           00341113
341114             WRITE AUDIT-RECORD                                   00341114
341115             MOVE SPACES               TO AUDIT-RECORD            00341115
341116                                                                  00341116
341117             STRING "WS-CURR-DRBN-TIMESTAMP: "                    00341117
341118                                 WS-CURR-DRBN-TIMESTAMP           00341118
341119                  DELIMITED BY SIZE  INTO AUDIT-RECORD            00341119
341120             END-STRING                                           00341120
341121             WRITE AUDIT-RECORD                                   00341121
341122             MOVE SPACES               TO AUDIT-RECORD            00341122
341123                                                                  00341123
341124             STRING "CURRENT MODEL YEAR:     "                    00341124
341125                                 WS-HOLD-MDL-YR-Y                 00341125
341126                  DELIMITED BY SIZE  INTO AUDIT-RECORD            00341126
341127             END-STRING                                           00341127
341128             WRITE AUDIT-RECORD                                   00341128
341129             MOVE SPACES               TO AUDIT-RECORD            00341129
341130                                                                  00341130
341131             MOVE SQLCODE              TO DB2-ABEND-SQLCODE       00341131
341132             MOVE "OPEN"               TO DB2-ABEND-FUNCTION      00341132
341133             MOVE "MEXW008_CSR"        TO DB2-ABEND-TABLE         00341133
341134             MOVE DB2-ABEND-MSG        TO ABEND-MSG               00341134
341135             MOVE "8500P"              TO ABEND-PARAGRAPH         00341135
341136             PERFORM 9999I-ABEND                                  00341136
341137     END-EVALUATE                                                 00341137
341138     .                                                            00341138
341139                                                                  00341139
341140***************************************************************** 00341140
341141* FETCHES MEXW008_CSR CURSOR                                      00341141
341142***************************************************************** 00341142
341143 8505P-FETCH-MEXW008-CSR.                                         00341143
341144                                                                  00341144
341145     EXEC SQL                                                     00341145
341146         FETCH  MEXW008_CSR                                       00341146
341147          INTO  :VEH-VIN-FULL-C                                   00341147
341148               ,:VEH-ORD-ID-C                                     00341148
341149               ,:VEH-DTA-DATA-SRC-C                               00341149
341150               ,:VEH-BDT-MDL-YR-Y                                 00341150
341151               ,:VEH-DLR-DLR-C                                    00341151
341152               ,:VEH-WMI-WMI-C                                    00341152
341153               ,:VEH-LCL-PLT-C                                    00341153
341154               ,:VEH-LCL-BDYTYP-C                                 00341154
341155               ,:VEH-GBL-ORD-DLR-C                                00341155
341156               ,:VEH-GBL-SHIP-TO-C                                00341156
341157               ,:VEH-ORD-RCPT-Y                                   00341157
341158               ,:VEH-WDMO-FLEET-C                                 00341158
341159               ,:VEH-WDMO-ORD-TYP                                 00341159
341160               ,:VEH-CATALOG-C                                    00341160
341161               ,:VEH-GBL-CATALOG-C                                00341161
341162               ,:VEH-PO-Y                                         00341162
341163               ,:VEH-GEVIS-VL-C                                   00341163
341164               ,:VEH-COUNTRY-ISO3-C                               00341164
341165     END-EXEC                                                     00341165
341166                                                                  00341166
341167     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00341167
341168                                                                  00341168
341169     EVALUATE TRUE                                                00341169
341170        WHEN SC-DB2-SQLCODE-OK                                    00341170
341171             ADD +1                    TO                         00341171
341172                               WS-NBR-ROWS-READ-MEXW008-CSR       00341172
341173             SET MEXW008-CSR-FOUND     TO TRUE                    00341173
341174        WHEN SC-DB2-SQLCODE-END-OF-CURSOR                         00341174
341175             SET MEXW008-CSR-NOT-FOUND TO TRUE                    00341175
341176        WHEN OTHER                                                00341176
341177             MOVE SPACES               TO AUDIT-RECORD            00341177
341178             WRITE AUDIT-RECORD                                   00341178
341179             STRING "DATA SOURCE:            "                    00341179
341180                                 VEH-DTA-DATA-SRC-C               00341180
341181                  DELIMITED BY SIZE  INTO AUDIT-RECORD            00341181
341182             END-STRING                                           00341182
341183             WRITE AUDIT-RECORD                                   00341183
341184             MOVE SPACES               TO AUDIT-RECORD            00341184
341185                                                                  00341185
341186             STRING "WS-PREV-RUN-TIMESTAMP:  "                    00341186
341187                                 WS-PREV-RUN-TIMESTAMP            00341187
341188                  DELIMITED BY SIZE  INTO AUDIT-RECORD            00341188
341189             END-STRING                                           00341189
341190             WRITE AUDIT-RECORD                                   00341190
341191             MOVE SPACES               TO AUDIT-RECORD            00341191
341192                                                                  00341192
341193             STRING "WS-CURR-DRBN-TIMESTAMP: "                    00341193
341194                                 WS-CURR-DRBN-TIMESTAMP           00341194
341195                  DELIMITED BY SIZE  INTO AUDIT-RECORD            00341195
341196             END-STRING                                           00341196
341197             WRITE AUDIT-RECORD                                   00341197
341198             MOVE SPACES               TO AUDIT-RECORD            00341198
341199                                                                  00341199
341200             STRING "CURRENT MODEL YEAR:     "                    00341200
341201                                 WS-HOLD-MDL-YR-Y                 00341201
341202                  DELIMITED BY SIZE  INTO AUDIT-RECORD            00341202
341203             END-STRING                                           00341203
341204             WRITE AUDIT-RECORD                                   00341204
341205             MOVE SPACES               TO AUDIT-RECORD            00341205
341206                                                                  00341206
341207             MOVE SQLCODE              TO DB2-ABEND-SQLCODE       00341207
341208             MOVE "FETCH"              TO DB2-ABEND-FUNCTION      00341208
341209             MOVE "MEXW008_CSR"        TO DB2-ABEND-TABLE         00341209
341210             MOVE DB2-ABEND-MSG        TO ABEND-MSG               00341210
341211             MOVE "8505P"              TO ABEND-PARAGRAPH         00341211
341212             PERFORM 9999I-ABEND                                  00341212
341213     END-EVALUATE                                                 00341213
341214     .                                                            00341214
341215                                                                  00341215
341216***************************************************************** 00341216
341217* CLOSES MEXW008_CSR CURSOR                                       00341217
341218***************************************************************** 00341218
341219 8507P-CLOSE-MEXW008-CSR.                                         00341219
341220                                                                  00341220
341221     EXEC SQL                                                     00341221
341222         CLOSE MEXW008_CSR                                        00341222
341223     END-EXEC                                                     00341223
341224                                                                  00341224
341225     MOVE SQLCODE                      TO SC-DB2-SQLCODE          00341225
341226                                                                  00341226
341227     IF  NOT SC-DB2-SQLCODE-OK                                    00341227
341228         MOVE SQLCODE                  TO DB2-ABEND-SQLCODE       00341228
341229         MOVE "CLOSE"                  TO DB2-ABEND-FUNCTION      00341229
341230         MOVE "MEXW008_CSR"            TO DB2-ABEND-TABLE         00341230
341231         MOVE DB2-ABEND-MSG            TO ABEND-MSG               00341231
341232         MOVE "8507P"                  TO ABEND-PARAGRAPH         00341232
341233         PERFORM 9999I-ABEND                                      00341233
341234     END-IF                                                       00341234
341235     .                                                            00341235
341236/*****************************************************************00341236
341237* WRITE ABEND MESSAGES TO AUDIT FILE, ROLLBACK TO PREVIOUS       *00341237
341238* CHECKPOINT, CALL COREDUMP.                                     *00341238
341239******************************************************************00341239
341240 9999I-ABEND.                                                     00341240
341241                                                                  00341241
341242     IF ABEND-PROGRAM                   = SPACES                  00341242
341243         MOVE PL-PGM-NAME              TO ABEND-PROGRAM           00341243
341244     END-IF                                                       00341244
341245                                                                  00341245
341246     MOVE SPACES                       TO AUDIT-RECORD            00341246
341247     WRITE AUDIT-RECORD                                           00341247
341248                                                                  00341248
341249     MOVE ABEND-MSG                    TO AUDIT-RECORD            00341249
341250     WRITE AUDIT-RECORD                                           00341250
341251                                                                  00341251
341252     MOVE ABEND-MSG-2                  TO AUDIT-RECORD            00341252
341253     WRITE AUDIT-RECORD                                           00341253
341254                                                                  00341254
341255     MOVE SPACES                       TO AUDIT-RECORD            00341255
341256     WRITE AUDIT-RECORD                                           00341256
341257                                                                  00341257
341260     CALL "COREDUMP"                                              00341260
341300     .                                                            00341300
