000100 IDENTIFICATION DIVISION.                                         00000100
000200 PROGRAM-ID.    EXWWB911.                                         00000200
000300 AUTHOR.        DAWN MAHN.                                        00000300
000400 DATE-WRITTEN.  NOVEMBER 2011.                                    00000400
000500 DATE-COMPILED.                                                   00000500
000600                                                                  00000600
000700******************************************************************00000700
000800* PROGRAM DESCRIPTION                                             00000800
000900*                                                                 00000900
001000* EXWWB911 IS A BATCH PROGRAM THAT IS DESIGNED TO EXTRACT VEHICLE 00001000
001100* DATA, DEALER DATA FROM VARIOUS DB2 TABLES WHICH ARE OWNED AND   00001100
001200* MAINTAINED BY GEVIS AND TO CREATE AN OUTBOUND BRIDGE FILE WHICH 00001200
001300* WHICH WILL BE USED BY MARKETING ASSOCIATES.                     00001300
001400*                                                                 00001400
001500* PROGRAM PROCESSSING:                                            00001500
001600* THE PROGRAM WILL READ IN AN INPUT SYSPARM FILE WHICH WILL       00001600
001700* CONTAIN A LIST OF PRODUCERS TO BE PROCESSED.  IT WILL PROCESS   00001700
001800* ONE PRODUCER AT A TIME.  WHEN A PRODUCER IS FIRST READ IN, A    00001800
001900* DB2 CURSOR WILL BE OPENED WHICH DRIVES OFF OF TABLES MEXW001_   00001900
002000* VEH_ORDER AND MEWX008_VEH_RTL FOR FLEET SALES THAT HAVE BEEN    00002000
002100* UPDATED SINCE THE LAST RUN.  ONLY ROWS THAT ARE ASSOCIATED WITH 00002100
002200* A CURRENT WDMO DEALER WILL BE FURTHER PROCESSED AND OUTPUT      00002200
002300* TO THE OUTBOUND BRIDGE FILE.                                    00002300
002400*                                                                 00002400
002500* NOTE: THERE MAY BE INSTANCES WHERE SOME FIELDS EXTRACTED        00002500
002600* FROM THE GEVIS DB2 TABLES, MAY NOT BE POPULATED WITH DATA.      00002600
002700* IN THAT CASE, IF THE FIELD IS ALPHANUMERIC, SPACES WILL BE      00002700
002800* CONTAINED WITHIN THE CORRESPONDING OUTPUT FIELD AND IF THE      00002800
002900* FIELD IS NUMERIC, ZEROS WILL BE CONTAINED WITHIN THE COR-       00002900
003000* CORRESPONDING OUTPUT FIELD.                                     00003000
003100*                                                                 00003100
003200* NOTE: FILE FDEX.WW.PROD.EXWWB490.MKTASC.FLTSLS WILL BE PICKED   00003200
003300*       UP BY MARKETING ASSOCIATES USING FTP ID FDFTPMK.          00003300
003400******************************************************************00003400
003500*                       REVISION LOG                              00003500
003600*                                                                 00003600
003700* DATE    : 12/12/2011  PROGRAMMER: DAWN MAHN                     00003700
003800* ETRACKER: 10427340                                              00003800
003900* REASON  ; ORIGINAL PROGRAM CREATION.                            00003900
004000*                                                                 00004000
004100******************************************************************00004100
004200*                                                                 00004200
004300* DATE    : 03/18/2013  PROGRAMMER: ESTES DAVIS                   00004300
004400* ETRACKER: 11838861                                              00004400
004500* REASON  : CHANGE PROGRAM TO REMOVE THE CALL TO SUBROUTINE       00004500
004600*           EXWWSWER, IT IS  USE TO FORMAT THE WERS STRING        00004600
004700*           PROCESS                                               00004700
004800*                                                                 00004800
004900******************************************************************00004900
005000*                                                                 00005000
005100* DATE    : 05/20/2013  PROGRAMMER: DAWN MAHN                     00005100
005200* ETRACKER: 11108662                                              00005200
005300* REASON  : IF STATUS ROW IS NOT FOUND ON MEXW027 FOR SOURCE VI,  00005300
005400*           THE JOB WILL END WITH CC3 AND AN EMAIL WILL BE SENT   00005400
005500*           TO THE GEVIS HELP DESK.  THE TRANSACTION WILL NOT BE  00005500
005600*           WRITTEN TO THE OUTPUT FILE.                           00005600
005800*                                                                 00005800
005900******************************************************************00005900
006000* DATE    : 11/19/2015  PROGRAMMER: ESTES DAVIS                  *00006000
006100* ETRACKER: 13836661 (13880434 EMERGENCY CODE DROP)              *00006100
006200* REASON  : INCLUDED WERS PRODUCT TYPE TO                        *00006200
006300*           5114P-SELECT-MEXW034-GEVIS-VL PARAGRAPH. ALSO,       *00006300
006400*           INCLUDED VPT_PROD_TYP_C TO MEXW032_CATALOG           *00006400
006500*           TABLE SQL CALL IN 5112P-SELECT-MEXW032-WERS-VL       *00006500
006600*           PARAGRAPH.                                           *00006600
006700*                                                                *00006700
006800******************************************************************00006800
006820* DATE    : 10/12/2017  PROGRAMMER: DAWN MAHN                    *00006000
006830* ETRACKER: 15164314                                             *00006100
006840* REASON  : CHANGE MEXW003_40V_CSR TO PULL ONLY THE FTC          *00006200
006850*           WHOLESALE (VST_CUR_DATA_SRC_C = WD) INSTEAD          *00006300
006860*           OF PULLING ANY WHOLESALE REGARDLESS OF SOURCE.       *00006400
006890*                                                                *00006700
006891******************************************************************00006800
006900                                                                  00006900
007000 ENVIRONMENT DIVISION.                                            00007000
007100 INPUT-OUTPUT SECTION.                                            00007100
007200 FILE-CONTROL.                                                    00007200
007300                                                                  00007300
007400     SELECT AUDIT-FILE           ASSIGN TO AUDIT.                 00007400
007500     SELECT SYSPARM-FILE         ASSIGN TO PARMFILE.              00007500
007600     SELECT MKT-ASSOC-FILE       ASSIGN TO MKTASSOC.              00007600
007700                                                                  00007700
007800 DATA DIVISION.                                                   00007800
007900 FILE SECTION.                                                    00007900
008000                                                                  00008000
008100 FD  AUDIT-FILE.                                                  00008100
008200 01  AUDIT-RECORD.                                                00008200
008300     05  AUDIT-LABEL             PIC X(30).                       00008300
008400     05  AUDIT-DATA              PIC X(50).                       00008400
008500                                                                  00008500
008600 FD  SYSPARM-FILE.                                                00008600
008700 01  SYSPARM-RECORD              PIC X(80).                       00008700
008800                                                                  00008800
008900 FD  MKT-ASSOC-FILE.                                              00008900
009000 01  MKT-ASSOC-RECORD            PIC X(1000).                     00009000
009100                                                                  00009100
009200******************************************************************00009200
009300*                 W O R K I N G   S T O R A G E                  *00009300
009400******************************************************************00009400
009500 WORKING-STORAGE SECTION.                                         00009500
009600 77  PAN-VALET PICTURE X(24) VALUE "070PEXWWB911 12/12/11".       00009600
009700                                                                  00009700
009800******************************************************************00009800
009900* WORKING STORAGE COPYBOOKS                                       00009900
010000******************************************************************00010000
010100                                                                  00010100
010200 COPY CPEWD001.                                                   00010200
010300*MEXW001 TABLE LAYOUT                                             00010300
010400                                                                  00010400
010500 COPY CPEWD003.                                                   00010500
010600*MEXW003 TABLE LAYOUT                                             00010600
010700                                                                  00010700
010800 COPY CPEWD004.                                                   00010800
010900*MEXW004 TABLE LAYOUT                                             00010900
011000                                                                  00011000
011100 COPY CPEWD007.                                                   00011100
011200*MEXW007 TABLE LAYOUT                                             00011200
011300                                                                  00011300
011400 COPY CPEWD008.                                                   00011400
011500*MEXW008 TABLE LAYOUT                                             00011500
011600                                                                  00011600
011700 COPY CPESD016.                                                   00011700
011800*MEXS016_GENERIC2                                                 00011800
011900                                                                  00011900
012000 COPY CPEWD021.                                                   00012000
012100*MEXW021 TABLE LAYOUT                                             00012100
012200                                                                  00012200
012300 COPY CPEWD027.                                                   00012300
012400*MEXW027 TABLE LAYOUT                                             00012400
012500                                                                  00012500
012600 COPY CPEWD031.                                                   00012600
012700*MEXW031 TABLE LAYOUT                                             00012700
012800                                                                  00012800
012900 COPY CPEWD032.                                                   00012900
013000*MEXW032 TABLE LAYOUT                                             00013000
013100                                                                  00013100
013200 COPY CPEWD033.                                                   00013200
013300*MEXW033 TABLE LAYOUT                                             00013300
013400                                                                  00013400
013500 COPY CPEWD034.                                                   00013500
013600*MEXW034 TABLE LAYOUT                                             00013600
013700                                                                  00013700
013800 COPY CPEWD035.                                                   00013800
013900*MEXW035 TABLE LAYOUT                                             00013900
014000                                                                  00014000
014100 COPY CPESDB2.                                                    00014100
014200*SQLCA AND SQLCODES                                               00014200
014300                                                                  00014300
014400 COPY CPESGNTB.                                                   00014400
014500*GENERIC TABLE LAYOUTS - EXSE SYSTEM                              00014500
014600                                                                  00014600
014700 COPY CPEWGNTB.                                                   00014700
014800*GENERIC TABLE LAYOUT  - EXWW SYSTEM                              00014800
014900                                                                  00014900
015000 COPY CPESEBWS.                                                   00015000
015100*BMPSHELL WORKING STORAGE                                         00015100
015200                                                                  00015200
015300 COPY CPEWSSTK.                                                   00015300
015400*I/O PARAMETERS FOR SUBROUTINE EXWWSSTK                           00015400
015500                                                                  00015500
015600                                                                  00015600
015700******************************************************************00015700
015800* WORKING STORAGE LITERALS                                        00015800
015900******************************************************************00015900
016000 01 PROGRAM-LITERALS.                                             00016000
016100     05  PL-00A                      PIC  X(03) VALUE "00A".      00016100
016200     05  PL-001                      PIC  X(03) VALUE "001".      00016200
016300     05  PL-010                      PIC  X(03) VALUE "010".      00016300
016400     05  PL-10M                      PIC  X(03) VALUE "10M".      00016400
016500     05  PL-20M                      PIC  X(03) VALUE "20M".      00016500
016600     05  PL-20T                      PIC  X(03) VALUE "20T".      00016600
016700     05  PL-30P                      PIC  X(03) VALUE "30P".      00016700
016800     05  PL-30R                      PIC  X(03) VALUE "30R".      00016800
016900     05  PL-30T                      PIC  X(03) VALUE "30T".      00016900
017000     05  PL-40V                      PIC  X(03) VALUE "40V".      00017000
017100     05  PL-80F                      PIC  X(03) VALUE "80F".      00017100
017200     05  PL-90V                      PIC  X(03) VALUE "90V".      00017200
017300     05  PL-025                      PIC  X(03) VALUE "025".      00017300
017400     05  PL-185                      PIC  X(03) VALUE "185".      00017400
017500     05  PL-190                      PIC  X(03) VALUE "190".      00017500
017600     05  PL-600                      PIC  X(03) VALUE "600".      00017600
017700     05  PL-800                      PIC  X(03) VALUE "800".      00017700
017800     05  PL-801                      PIC  X(03) VALUE "801".      00017800
017900     05  PL-999                      PIC  X(03) VALUE "999".      00017900
018000     05  PL-TBL-VEH-STATUS           PIC X(18)                    00018000
018100                                     VALUE "MEXW003_VEH_STATUS".  00018100
018200     05  PL-TBL-VEH-WHS              PIC X(18)                    00018200
018300                                     VALUE "MEXW007_VEH_WHS   ".  00018300
018400     05  PL-TBL-MEXW003-07           PIC X(18)                    00018400
018500                                     VALUE "MEXW003/MEXW007   ".  00018500
018600     05  PL-TBL-MEXW003-08           PIC X(18)                    00018600
018700                                     VALUE "MEXW003/MEXW008   ".  00018700
018800     05  PL-TBL-MEXW004              PIC X(18)                    00018800
018900                                     VALUE "MEXW004_VEH_WERS_S".  00018900
019000     05  PL-TBL-VEH-RTL              PIC X(18)                    00019000
019100                                     VALUE "MEXW008_VEH_RTL   ".  00019100
019200     05  PL-TBL-GENERIC              PIC X(18)                    00019200
019300                                     VALUE "MEXS016_GENERIC2  ".  00019300
019400     05  PL-TBL-SUBLVL-ASG           PIC X(18)                    00019400
019500                                     VALUE "MEXW021_SUBLVL_ASG".  00019500
019600     05  PL-TBL-CONV                 PIC X(18)                    00019600
019700                                     VALUE "MEXW027_CONV      ".  00019700
019800     05  PL-TBL-VL-BRAND             PIC X(18)                    00019800
019900                                     VALUE "MEXW034_VL_BRAND  ".  00019900
020000     05  PL-TBL-BODY-TYPE            PIC X(18)                    00020000
020100                                     VALUE "MEXW033_BODY_TYPE ".  00020100
020200     05  PL-TBL-DLR-MSTR             PIC X(18)                    00020200
020300                                     VALUE "MEXW035_DLR_MSTR  ".  00020300
020400     05  PL-TBL-CATMAP               PIC X(18)                    00020400
020500                                     VALUE "MEXW031_CATMAP    ".  00020500
020600     05  PL-TBL-CATALOG              PIC X(18)                    00020600
020700                                     VALUE "MEXW032_CATALOG   ".  00020700
020800     05  PL-SALE-CHK-CSR             PIC X(18)                    00020800
020900                                     VALUE "SALE_CHK_CSR      ".  00020900
021000     05  PL-DB2-DATE-MIN             PIC  X(10)                   00021000
021100                                     VALUE "0001-01-01".          00021100
021200     05  PL-D                        PIC  X(01) VALUE "D".        00021200
021300     05  PL-E                        PIC  X(01) VALUE "E".        00021300
021400     05  PL-EX                       PIC  X(02) VALUE "EX".       00021400
021500     05  PL-Y                        PIC  X(01) VALUE "Y".        00021500
021600     05  PL-N                        PIC  X(01) VALUE "N".        00021600
021700     05  PL-STATUS                   PIC  X(06) VALUE "STATUS".   00021700
021800     05  PL-SYSTEM-ID                PIC  X(04) VALUE "EXWW".     00021800
021900     05  PL-VEHLINE                  PIC  X(08) VALUE "VEHLINE ". 00021900
022000     05  PL-USD                      PIC  X(04) VALUE "USD ".     00022000
022100     05  PL-WDMSALEM                 PIC  X(08) VALUE "WDMSALEM". 00022100
022200     05  PL-TABLE-ID                 PIC  X(08) VALUE "SYSPARM ". 00022200
022300     05  PL-KEY-DATA-TIMESTAMP       PIC  X(20) VALUE             00022300
022400                                     "EXWWB911TIMESTMP".          00022400
022500     05  PL-KEY-DATA-BATCHCTL        PIC  X(20) VALUE             00022500
022600                                     "EXWWB911BATCHCTL".          00022600
022700     05  PL-PGM-NAME                 PIC  X(08) VALUE "EXWWB911". 00022700
022800     05  PL-SUBRTN-NAME              PIC  X(08) VALUE "EXWWSSTK". 00022800
022900     05  PL-SYSTEM-CD                PIC  X(04) VALUE  "EXWW".    00022900
023000     05  PL-LAYOUT-ID                PIC  X(20) VALUE             00023000
023100                                     "WGEVMKTASOCEXTOUT010".      00023100
023200     05  PL-PROCESS-ID               PIC  X(20) VALUE             00023200
023300                                     "GEVMKTASOCEXTOUT010".       00023300
023400     05  PL-ENTITY-CD                PIC  X(05) VALUE             00023400
023500                                     "EXPNG".                     00023500
023600     05  PL-VEH-VIN-BLANK            PIC  X(17) VALUE             00023600
023700                                     "                 ".         00023700
023800     05  PL-BS                       PIC  X(02) VALUE "BS".       00023800
023900     05  PL-CA                       PIC  X(02) VALUE "CA".       00023900
024000     05  PL-NA                       PIC  X(02) VALUE "NA".       00024000
024100     05  PL-EA                       PIC  X(02) VALUE "EA".       00024100
024200     05  PL-A4                       PIC  X(02) VALUE "A4".       00024200
024300     05  PL-AB                       PIC  X(02) VALUE "AB".       00024300
024400     05  PL-D-2                      PIC  X(02) VALUE "D ".       00024400
024500     05  PL-DB                       PIC  X(02) VALUE "DB".       00024500
024600     05  PL-F1                       PIC  X(02) VALUE "F1".       00024600
024700     05  PL-F2                       PIC  X(02) VALUE "F2".       00024700
024800     05  PL-F3                       PIC  X(02) VALUE "F3".       00024800
024900     05  PL-F4                       PIC  X(02) VALUE "F4".       00024900
025000     05  PL-KI                       PIC  X(02) VALUE "KI".       00025000
025100     05  PL-K5                       PIC  X(02) VALUE "K5".       00025100
025200     05  PL-L2                       PIC  X(02) VALUE "L2".       00025200
025300     05  PL-L4                       PIC  X(02) VALUE "L4".       00025300
025400     05  PL-L5                       PIC  X(02) VALUE "L5".       00025400
025500     05  PL-T                        PIC  X(01) VALUE "T".        00025500
025600     05  PL-T-2                      PIC  X(02) VALUE "T ".       00025600
025700     05  PL-VI                       PIC  X(02) VALUE "VI".       00025700
025800     05  PL-3                        PIC  X(01) VALUE "3".        00025800
025900     05  PL-3-2                      PIC  X(02) VALUE "3 ".       00025900
026000     05  PL-4                        PIC  X(01) VALUE "4".        00026000
026100     05  PL-4-2                      PIC  X(02) VALUE "4 ".       00026100
026200     05  PL-7                        PIC  X(01) VALUE "7".        00026200
026300     05  PL-7-2                      PIC  X(02) VALUE "7 ".       00026300
026400     05  PL-WDM                      PIC  X(03) VALUE "WDM".      00026400
026500     05  PL-SPACES                   PIC  X(02) VALUE "  ".       00026500
026510     05  PL-WD                       PIC  X(02) VALUE "WD".       00026400
026600                                                                  00026600
026700******************************************************************00026700
026800* WORKING STORAGE SWITCHES                                        00026800
026900******************************************************************00026900
027000 01  PROGRAM-SWITCHES.                                            00027000
027100     05  PS-MEXW003-20T-SW           PIC X(01).                   00027100
027200         88 MEXW003-FOUND-20T        VALUE "Y".                   00027200
027300         88 MEXW003-NOT-FOUND-20T    VALUE "N".                   00027300
027400     05  PS-MEXW003-30P-SW           PIC X(01).                   00027400
027500         88 MEXW003-FOUND-30P        VALUE "Y".                   00027500
027600         88 MEXW003-NOT-FOUND-30P    VALUE "N".                   00027600
027700     05  PS-MEXW003-30R-SW           PIC X(01).                   00027700
027800         88 MEXW003-FOUND-30R        VALUE "Y".                   00027800
027900         88 MEXW003-NOT-FOUND-30R    VALUE "N".                   00027900
028000     05  PS-MEXW003-30T-SW           PIC X(01).                   00028000
028100         88 MEXW003-FOUND-30T        VALUE "Y".                   00028100
028200         88 MEXW003-NOT-FOUND-30T    VALUE "N".                   00028200
028300     05  PS-MEXW003-40V-SW           PIC X(01).                   00028300
028400         88 MEXW003-FOUND-40V        VALUE "Y".                   00028400
028500         88 MEXW003-NOT-FOUND-40V    VALUE "N".                   00028500
028600     05  PS-MEXW003-80F-SW           PIC X(01).                   00028600
028700         88 MEXW003-FOUND-80F        VALUE "Y".                   00028700
028800         88 MEXW003-NOT-FOUND-80F    VALUE "N".                   00028800
028900     05  PS-MEXW008-90V-SW           PIC X(01).                   00028900
029000         88 MEXW008-FOUND-90V        VALUE "Y".                   00029000
029100         88 MEXW008-NOT-FOUND-90V    VALUE "N".                   00029100
029200     05  PS-MEXW003-40V-CSR-ROW-FOUND                             00029200
029300                                     PIC X(01).                   00029300
029400         88 MEXW003-40V-CSR-ROW-FOUND                             00029400
029500                                     VALUE "Y".                   00029500
029600         88 MEXW003-40V-CSR-ROW-NOT-FOUND                         00029600
029700                                     VALUE "N".                   00029700
029800     05  PS-MEXW007-SW               PIC X(01).                   00029800
029900         88 MEXW007-FOUND            VALUE "Y".                   00029900
030000         88 MEXW007-NOT-FOUND        VALUE "N".                   00030000
030100     05  PS-MEXW008-SW               PIC X(01).                   00030100
030200         88 MEXW008-FOUND            VALUE "Y".                   00030200
030300         88 MEXW008-NOT-FOUND        VALUE "N".                   00030300
030400     05  PS-MEXW021-SW               PIC X(01).                   00030400
030500         88 MEXW021-FOUND            VALUE "Y".                   00030500
030600         88 MEXW021-NOT-FOUND        VALUE "N".                   00030600
030700     05  PS-MEXW027-SW               PIC X(01).                   00030700
030800         88 MEXW027-FOUND            VALUE "Y".                   00030800
030900         88 MEXW027-NOT-FOUND        VALUE "N".                   00030900
031000     05  WS-MEXW027-MULTIPLE-SW      PIC X(01).                   00031000
031100         88 MEXW027-MULTIPLE-FOUND   VALUE "Y".                   00031100
031200         88 MEXW027-MULTIPLE-NOT-FOUND                            00031200
031300                                     VALUE "N".                   00031300
031400     05  PS-MEXW031-SW               PIC X(01).                   00031400
031500         88 MEXW031-FOUND            VALUE "Y".                   00031500
031600         88 MEXW031-NOT-FOUND        VALUE "N".                   00031600
031700     05  PS-MEXW032-SW               PIC X(01).                   00031700
031800         88 MEXW032-FOUND            VALUE "Y".                   00031800
031900         88 MEXW032-NOT-FOUND        VALUE "N".                   00031900
032000     05  PS-MEXW033-SW               PIC X(01).                   00032000
032100         88 MEXW033-FOUND            VALUE "Y".                   00032100
032200         88 MEXW033-NOT-FOUND        VALUE "N".                   00032200
032300     05  PS-MEXW034-SW                PIC X(01).                  00032300
032400         88 MEXW034-FOUND            VALUE "Y".                   00032400
032500         88 MEXW034-NOT-FOUND        VALUE "N".                   00032500
032600     05  PS-MEXW035-SW               PIC X(01).                   00032600
032700         88 MEXW035-FOUND            VALUE "Y".                   00032700
032800         88 MEXW035-NOT-FOUND        VALUE "N".                   00032800
032900     05  PS-END-OF-SYSPARM-FILE      PIC X(01).                   00032900
033000         88 END-OF-SYSPARM-FILE      VALUE "Y".                   00033000
033100         88 NOT-END-OF-SYSPARM-FILE  VALUE "N".                   00033100
033200     05  PS-WDMO-DEALER              PIC X(01).                   00033200
033300         88 WDMO-DEALER              VALUE "Y".                   00033300
033400         88 NOT-WDMO-DEALER          VALUE "N".                   00033400
033500     05  PS-SEND-EMAIL               PIC X(01).                   00033500
033600         88 SEND-EMAIL               VALUE "Y".                   00033600
033700         88 NOT-SEND-EMAIL           VALUE "N".                   00033700
033800     05  PS-SALE-CHK-SW              PIC X(01).                   00033800
033900         88 SALE-CHK-FOUND           VALUE "Y".                   00033900
034000         88 SALE-CHK-NOT-FOUND       VALUE "N".                   00034000
034100     05  PS-WERS-STRING              PIC X(01).                   00034100
034200         88 WERS-STRING-FOUND-SW     VALUE "Y".                   00034200
034300         88 WERS-STRING-NOT-FOUND-SW VALUE "N".                   00034300
034400                                                                  00034400
034500******************************************************************00034500
034600* WORKING STORAGE VARIABLES                                       00034600
034700******************************************************************00034700
034800 01  PROGRAM-VARIABLES.                                           00034800
034900     05  PV-NBR-ROWS-READ-MEXW003    PIC S9(9) COMP.              00034900
035000     05  PV-NBR-ROWS-READ-MEXW004    PIC S9(9) COMP.              00035000
035100     05  PV-NBR-ROWS-READ-MEXW007    PIC S9(9) COMP.              00035100
035200     05  PV-NBR-ROWS-READ-MEXW008    PIC S9(9) COMP.              00035200
035300     05  PV-NBR-ROWS-READ-SALE-CHK   PIC S9(9) COMP.              00035300
035400     05  PV-NBR-ROWS-READ-MEXW021    PIC S9(9) COMP.              00035400
035500     05  PV-NBR-ROWS-READ-MEXW027    PIC S9(9) COMP.              00035500
035600     05  PV-NBR-ROWS-READ-MEXW031    PIC S9(9) COMP.              00035600
035700     05  PV-NBR-ROWS-READ-MEXW032    PIC S9(9) COMP.              00035700
035800     05  PV-NBR-ROWS-READ-MEXW033    PIC S9(9) COMP.              00035800
035900     05  PV-NBR-ROWS-READ-MEXW034    PIC S9(9) COMP.              00035900
036000     05  PV-NBR-ROWS-READ-MEXW035    PIC S9(9) COMP.              00036000
036100     05  PV-NBR-SYSPARM-RECS-READ    PIC S9(9) COMP.              00036100
036200     05  PV-NBR-EXWWSSTK-CALLS       PIC S9(9) COMP.              00036200
036300     05  PV-NBR-EXWWSSTK-NOTFOUND-CALLS                           00036300
036400                                     PIC S9(9) COMP.              00036400
036500     05  PV-NBR-MEXW027-NOTFOUND-CALLS                            00036500
036600                                     PIC S9(9) COMP.              00036600
036700     05  PV-NBR-MEXW035-NOTFOUND-CALLS                            00036700
036800                                     PIC S9(9) COMP.              00036800
036900     05  PV-NBR-OUTPUT-RECS-WRTN     PIC S9(9) COMP.              00036900
037000     05  PV-COUNT-DTL-NBR            PIC S9(9) COMP.              00037000
037100     05  PV-COUNT-LINE-NBR           PIC S9(9) COMP.              00037100
037200     05  PV-PREV-RUN-TIMESTAMP       PIC X(26).                   00037200
037300     05  PV-PREV-BATCH-NBR           PIC 9(05).                   00037300
037400     05  PV-CURRENT-BATCH-NBR        PIC 9(05).                   00037400
037500     05  PV-CURR-DRBN-TIMESTAMP      PIC X(26).                   00037500
037600     05  PV-VEH-BDT-MDL-YR-Y         PIC 9(04).99.                00037600
037700     05  PV-VEH-BDT-MDL-YR-Y-RDF                                  00037700
037800         REDEFINES PV-VEH-BDT-MDL-YR-Y.                           00037800
037900         15 PV-VEH-BDT-MDL-YR-CC     PIC X(02).                   00037900
038000         15 PV-VEH-BDT-MDL-YR-YY     PIC X(02).                   00038000
038100         15 PV-VEH-BDT-MDL-YR-FILLE  PIC X(01).                   00038100
038200         15 PV-VEH-BDT-MDL-YR-QTR    PIC X(02).                   00038200
038300     05  PV-VST-GBL-LOC-C-REFORMAT   PIC 9(06).                   00038300
038400     05  PV-DLR-SUPER-DLR-C-REFORMAT PIC 9(06).                   00038400
038500     05  PV-DTL-VEH-GBL-DLR-C-REFORMAT                            00038500
038600                                     PIC 9(06).                   00038600
038700     05  PV-PROCESS-SQLCODE-EDIT     PIC +++++.                   00038700
038800     05  PV-VALID-VARIABLES.                                      00038800
038900         10  PV-WERS-VL-C                PIC  X(02).              00038900
039000             88  PV-VALID-VEH-LINE-CDS   VALUE "KI", "K5", "DB".  00039000
039100                                                                  00039100
039200******************************************************************00039200
039300* DO NOT PUT ANY COPYBOOKS WITH AN 01 LEVEL IN THIS SECTION. THIS*00039300
039400* AREA IS USED STRICTLY FOR DATA TO BE SAVED IN THE CHKP AREA.   *00039400
039500******************************************************************00039500
039600                                                                  00039600
039700 COPY CPEWHUB.                                                    00039700
039800*E & G HUB HEADER/TRAILER LAYOUT                                  00039800
039900                                                                  00039900
040000                                                                  00040000
040100******************************************************************00040100
040200* RECORD LAYOUTS                                                 *00040200
040300******************************************************************00040300
040400                                                                  00040400
040500 01  WS-SYSPARM-DETAIL.                                           00040500
040600     05  WS-SYSPARM-DATA-SRC             PIC X(02).               00040600
040700     05  FILLER                          PIC X(78).               00040700
040800                                                                  00040800
040900 01  WS-MKT-ASSOC-DETAIL-RECORD.                                  00040900
041000     05  WS-DTL-HUB-LINE-NBR             PIC 9(06).               00041000
041100     05  WS-DTL-HUB-REC-ID               PIC X(25).               00041100
041200     05  WS-DTL-HUB-REC-ID-NBR REDEFINES                          00041200
041300         WS-DTL-HUB-REC-ID.                                       00041300
041400         10  WS-DTL-REC-ID-ZEROS         PIC 9(16).               00041400
041500         10  WS-DTL-REC-ID-NBR           PIC 9(09).               00041500
041600     05  WS-DTL-HUB-REC-TYPE             PIC X(03).               00041600
041700     05  WS-DTL-HUB-REC-SEQ-NBR          PIC 9(03).               00041700
041800     05  WS-DTL-VIN-FULL-C               PIC X(17).               00041800
041900     05  WS-DTL-DTA-DATA-SRC-C           PIC X(02).               00041900
042000     05  WS-DTL-BDT-MDL-YR-Y             PIC X(02).               00042000
042100     05  WS-DTL-GEVIS-VEH-LINE-C         PIC X(02).               00042100
042200     05  WS-DTL-LCL-BDYTYP-C             PIC X(05).               00042200
042300     05  WS-DTL-CUR-STA-STATUS-C         PIC X(03).               00042300
042400     05  WS-DTL-VEH-DIVISION-C           PIC X(01).               00042400
042500     05  WS-DTL-WMI-WMI-C                PIC X(03).               00042500
042600     05  WS-DTL-LCL-PLT-C                PIC X(03).               00042600
042700     05  WS-DTL-VWS-TOT-US-A             PIC S9(07)V99 COMP-3.    00042700
042800     05  WS-DTL-VEH-GBL-DLR-C            PIC X(06).               00042800
042900     05  WS-DTL-ORIG-VST-GBL-LOC-C       PIC X(06).               00042900
043000     05  WS-DTL-CURR-VST-GBL-LOC-C       PIC X(06).               00043000
043100     05  WS-DTL-SHIP-TO-DLR-C            PIC X(06).               00043100
043200     05  WS-DTL-CURR-STOCKING-DLR-C      PIC X(06).               00043200
043300     05  WS-DTL-CURR-DLR-C               PIC X(06).               00043300
043400     05  WS-DTL-WDMO-FLEET-C             PIC X(05).               00043400
043500     05  WS-DTL-VRS-LCL-FLEET-C          PIC X(06).               00043500
043600     05  WS-DTL-VRS-CST-FIRST-N          PIC X(30).               00043600
043700     05  WS-DTL-VRS-CST-MID-INIT-X       PIC X(01).               00043700
043800     05  WS-DTL-VRS-CST-LAST-N           PIC X(30).               00043800
043900     05  WS-DTL-VRS-CST-ADDR-1-X         PIC X(40).               00043900
044000     05  WS-DTL-VRS-CST-ADD-DIV2-N       PIC X(40).               00044000
044100     05  WS-DTL-VRS-CST-ADD-DIV1-C       PIC X(02).               00044100
044200     05  WS-DTL-VRS-CST-POSTAL-C         PIC X(10).               00044200
044300     05  WS-DTL-VRS-SALESPERSON-C        PIC X(11).               00044300
044400     05  WS-DTL-VRS-TYP-LCL-CUST-C       PIC X(01).               00044400
044500     05  WS-DTL-VEH-WDMO-ORD-TYP         PIC X(01).               00044500
044600     05  WS-DTL-VEH-ORD-RCPT-Y           PIC X(08).               00044600
044700     05  WS-DTL-VEH-SCHD-VST-TARGET-Y    PIC X(08).               00044700
044800     05  WS-DTL-VEH-PRODUCE-VST-STAT-Y   PIC X(08).               00044800
044900     05  WS-DTL-VEH-RELEASE-VST-STAT-Y   PIC X(08).               00044900
045000     05  WS-DTL-VEH-ARRIVAL-VST-STAT-Y   PIC X(08).               00045000
045100     05  WS-DTL-VEH-INVOICE-VST-STAT-Y   PIC X(08).               00045100
045200     05  WS-DTL-VEH-STOCK-VST-STAT-Y     PIC X(08).               00045200
045300     05  WS-DTL-VEH-RETAIL-VST-STAT-Y    PIC X(08).               00045300
045400     05  WS-DTL-VEH-DELIVER-VST-STAT-Y   PIC X(08).               00045400
045500     05  WS-DTL-VEH-SLSRCPT-VST-STAT-Y   PIC X(08).               00045500
045600     05  WS-DTL-VEH-WARRANT-VST-STAT-Y   PIC X(08).               00045600
045700     05  WS-DTL-VEH-CATALOG-C            PIC X(15).               00045700
045800     05  WS-DTL-WERS-VEH-LINE-C          PIC X(02).               00045800
045900     05  WS-DTL-WERS-BODY-STYLE-C        PIC X(03).               00045900
046000     05  WS-DTL-WERS-BRAND-C             PIC X(01).               00046000
046100     05  WS-DTL-VEH-PO-Y                 PIC X(08).               00046100
046200     05  WS-DTL-VLN-GEVIS-VL-N           PIC X(40).               00046200
046300     05  WS-DTL-FILLER-01                PIC X(550).              00046300
046400                                                                  00046400
046500     05  INPUT-OUTPUT-PARAMETERS           PIC X(4020).           00046500
046600                                                                  00046600
046700******************************************************************00046700
046800* MAIN DRIVING CURSOR                                             00046800
046900* THIS CURSOR WILL BE USED TO JOIN THE MEXW001 AND MEXW008 TABLES 00046900
047000* TO GATHER FLEET SAMES DATA THAT WAS ADDED/UPDATED AFTER THE     00047000
047100* THE LAST RUN.                                                   00047100
047200*                                                                 00047200
047300* NOTE: THE DATA SOURCE IS POPULATED FROM THE INPUT SYSPARM FILE. 00047300
047400******************************************************************00047400
047500                                                                  00047500
047600     EXEC SQL                                                     00047600
047700         DECLARE  SALE_CHK_CSR CURSOR FOR                         00047700
047800          SELECT  VEH.VEH_VIN_FULL_C                              00047800
047900                 ,VEH.VEH_ORD_ID_C                                00047900
048000                 ,VEH.DTA_DATA_SRC_C                              00048000
048100                 ,VEH.BDT_MDL_YR_Y                                00048100
048200                 ,VEH.WMI_WMI_C                                   00048200
048300                 ,VEH.VEH_LCL_PLT_C                               00048300
048400                 ,VEH.VEH_LCL_BDYTYP_C                            00048400
048500                 ,VEH.VEH_GBL_ORD_DLR_C                           00048500
048600                 ,VEH.VEH_GBL_SHIP_TO_C                           00048600
048700                 ,VEH.VEH_ORD_RCPT_Y                              00048700
048800                 ,VEH.VEH_WDMO_FLEET_C                            00048800
048900                 ,VEH.VEH_WDMO_ORD_TYP                            00048900
049000                 ,VEH.VEH_CATALOG_C                               00049000
049100                 ,VEH.VEH_GBL_CATALOG_C                           00049100
049200                 ,VEH.VEH_PO_Y                                    00049200
049300                 ,VEH.VEH_GEVIS_VL_C                              00049300
049400                 ,VEH.COUNTRY_ISO3_C                              00049400
049500            FROM  MEXW001_VEH_ORDER VEH                           00049500
049600                 ,MEXW008_VEH_RTL   VRS                           00049600
049700           WHERE  VRS.DTA_DATA_SRC_C = :VRS-DTA-DATA-SRC-C        00049700
049800             AND  VRS.VRS_UPDT_S     > :PV-PREV-RUN-TIMESTAMP     00049800
049900             AND  VRS.VRS_ACTIVE_F   = :PL-Y                      00049900
050000             AND  VRS.VRS_TYP_LCL_CUST_C IN (:PL-F1,              00050000
050100                                             :PL-7,               00050100
050200                                             :PL-F2,              00050200
050300                                             :PL-3,               00050300
050400                                             :PL-F3,              00050400
050500                                             :PL-T,               00050500
050600                                             :PL-F4,              00050600
050700                                             :PL-4,               00050700
050800                                             :PL-L2,              00050800
050900                                             :PL-L4,              00050900
051000                                             :PL-D)               00051000
051100             AND  VEH.VEH_ORD_ID_C   = VRS.VEH_ORD_ID_C           00051100
051200             AND  VEH.DTA_DATA_SRC_C = VRS.DTA_DATA_SRC_C         00051200
051300             AND  VEH.VEH_VIN_FULL_C > :PL-VEH-VIN-BLANK          00051300
051400             AND  VEH.VEH_ACTIVE_F   = :PL-Y                      00051400
051500     END-EXEC                                                     00051500
051600                                                                  00051600
051700******************************************************************00051700
051800* THIS CURSOR WILL BE USED TO SELECT ONE ROW FROM TABLE MEXW031   00051800
051900* FOR NON 'NA' AND NON 'EA' DATA SOURCES.  THE RETRIEVED VALUES   00051900
052000* WILL BE USED IN PLACE OF THE LOCAL BODY STYLE CODE THAT WAS     00052000
052100* OBTAINED FROM TABLE MEXW001.                                    00052100
052200******************************************************************00052200
052300     EXEC SQL                                                     00052300
052400         DECLARE  MEXW031_CSR CURSOR FOR                          00052400
052500         SELECT  OPT_OPTION_C                                     00052500
052600                ,VPT_PROD_TYP_C                                   00052600
052700           FROM  MEXW031_CATMAP                                   00052700
052800          WHERE  DTA_DATA_SRC_C    = :CTM-DTA-DATA-SRC-C          00052800
052900            AND  CTM_LCL_CATALOG_C = :CTM-LCL-CATALOG-C           00052900
053000            AND  OFM_OPTION_FAM_C IN (:PL-BS, :PL-CA)             00053000
053100            OPTIMIZE FOR 1 ROW                                    00053100
053200     END-EXEC                                                     00053200
053300                                                                  00053300
053400******************************************************************00053400
053500* THIS CURSOR IS BEING USED IN ORDER TO RETRIEVE THE ORIGINAL     00053500
053600* INVOICING DEALER FROM TABLE MEXW003 BY FETCHING THE NEWEST      00053600
053700* ROW CONTAINING A "40V" STATUS CODE AND A SENDING SOURCE OF WD.  00053700
053800******************************************************************00053800
053900     EXEC SQL                                                     00053900
054000        DECLARE  MEXW003_40V_CSR CURSOR FOR                       00054000
054100         SELECT  VST_GBL_LOC_C                                    00054100
054200           FROM  MEXW003_VEH_STATUS                               00054200
054300          WHERE  VEH_ORD_ID_C       = :VST-VEH-ORD-ID-C                 00
054400            AND  DTA_DATA_SRC_C     = :VST-DTA-DATA-SRC-C               00
054500            AND  STA_STATUS_C       = :VST-STA-STATUS-C                 00
054600            AND  VST_ACTIVE_F       = :VST-ACTIVE-F                     00
054700            AND  VST_STAT_TYP_C     = :VST-STAT-TYP-C                   00
054710            AND  VST_CUR_DATA_SRC_C = :VST-CUR-DATA-SRC-C
054800       ORDER BY  VST_STAT_Y  DESC                                 00054800
054810                ,VST_STATIC_ISRT_REC_S  DESC
054900     END-EXEC                                                     00054900
055000                                                                  00055000
055100                                                                  00055100
055200******************************************************************00055200
055300*            LINKAGE SECTION                                      00055300
055400******************************************************************00055400
055500 LINKAGE SECTION.                                                 00055500
055600                                                                  00055600
055700                                                                  00055700
055800******************************************************************00055800
055900*              P R O C E D U R E   D I V I S I O N               *00055900
056000******************************************************************00056000
056100 PROCEDURE DIVISION.                                              00056100
056200                                                                  00056200
056300******************************************************************00056300
056400*                        M A I N L I N E                         *00056400
056500* JOB WILL END WITH A RETURN-CODE 3 UNDER THE FOLLOWING          *00056500
056600* CONDITIONS:                                                    *00056600
056700*                                                                *00056700
056800*  1. IF AN ORDER-ID AND PRODUCTION SOURCES IS NOT FOUND (+100)  *00056800
056900*     WHEN EXWWSSTK SUBROUTINE WAS CALLED.                       *00056900
057000*                                                                *00057000
057100* AN EMAIL WILL BE SENT TO THE HELPDESK.                         *00057100
057200******************************************************************00057200
057300 0000P-MAINLINE.                                                  00057300
057400                                                                  00057400
057500     PERFORM 0400P-INITIALIZE-OTHER                               00057500
057600     PERFORM 1000P-PROCESS UNTIL END-OF-SYSPARM-FILE              00057600
057700     PERFORM 0700P-CONCLUDE-OTHER                                 00057700
057800     IF SEND-EMAIL                                                00057800
057900        MOVE 3 TO RETURN-CODE                                     00057900
058000     END-IF                                                       00058000
058100                                                                  00058100
058200     GOBACK                                                       00058200
058300     .                                                            00058300
058400                                                                  00058400
058500******************************************************************00058500
058600* PROGRAM SPECIFIC INITIALIZATION                                *00058600
058700******************************************************************00058700
058800 0400P-INITIALIZE-OTHER.                                          00058800
058900                                                                  00058900
059000     OPEN INPUT  SYSPARM-FILE                                     00059000
059100          EXTEND AUDIT-FILE                                       00059100
059200          OUTPUT MKT-ASSOC-FILE                                   00059200
059300                                                                  00059300
059400     SET NOT-END-OF-SYSPARM-FILE       TO TRUE                    00059400
059500                                                                  00059500
059600     INITIALIZE  WS-MKT-ASSOC-DETAIL-RECORD                       00059600
059700                 PROGRAM-SWITCHES                                 00059700
059800                 PROGRAM-VARIABLES                                00059800
059900                                                                  00059900
060000     PERFORM 7000P-OBTAIN-DRBN-TIMESTAMP                          00060000
060100                                                                  00060100
060200     PERFORM 7200P-SELECT-PRV-RUN-TIMESTAMP                       00060200
060300                                                                  00060300
060400     MOVE GNT-ATTRIBUTE-DATA           TO PV-PREV-RUN-TIMESTAMP   00060400
060500                                                                  00060500
060600     PERFORM 7300P-GET-BATCH-NBR                                  00060600
060700                                                                  00060700
060800     MOVE GNT-ATTRIBUTE-DATA (1:5)     TO PV-PREV-BATCH-NBR       00060800
060900                                                                  00060900
061000     IF PV-PREV-BATCH-NBR = 99999                                 00061000
061100        MOVE 0                         TO PV-PREV-BATCH-NBR       00061100
061200     END-IF                                                       00061200
061300                                                                  00061300
061400     COMPUTE PV-CURRENT-BATCH-NBR = PV-PREV-BATCH-NBR + 1         00061400
061500                                                                  00061500
061600     MOVE WHEN-COMPILED                TO SV-COMPILE-DATE-TIME    00061600
061700                                                                  00061700
061800     PERFORM 9100P-GET-CURRENT-DATE-TIME                          00061800
061900     PERFORM 9200P-WRITE-AUDIT-HEADER                             00061900
062000                                                                  00062000
062100     PERFORM 8000P-GET-SYSPARM-RECORD                             00062100
062200                                                                  00062200
062300     PERFORM 7400P-POPULATE-HUB-HEADER                            00062300
062400     .                                                            00062400
062500                                                                  00062500
062600******************************************************************00062600
062700* PROGRAM SPECIFIC CONCLUSION                                    *00062700
062800******************************************************************00062800
062900 0700P-CONCLUDE-OTHER.                                            00062900
063000                                                                  00063000
063100     PERFORM 7250P-UPDATE-TIMESTAMP                               00063100
063200     PERFORM 7350P-UPDATE-BATCH-NBR                               00063200
063300                                                                  00063300
063400     PERFORM 7450P-POPULATE-HUB-TRAILER                           00063400
063500                                                                  00063500
063600     PERFORM 6020P-WRITE-AUDIT-DETAIL                             00063600
063700                                                                  00063700
063800     PERFORM 9100P-GET-CURRENT-DATE-TIME                          00063800
063900     PERFORM 9300P-WRITE-AUDIT-TRAILER                            00063900
064000                                                                  00064000
064100     CLOSE SYSPARM-FILE                                           00064100
064200           AUDIT-FILE                                             00064200
064300           MKT-ASSOC-FILE                                         00064300
064400     .                                                            00064400
064500                                                                  00064500
064600******************************************************************00064600
064700* MAIN DRIVING PARAGRAPH CALLED FROM 0000P-MAINLINE.  A LOOP WILL 00064700
064800* BE PERFORMED WHICH WILL PROCESS ALL VEHICLES FOR A PRODUCTION   00064800
064900* SOURCE.  AT THE END OF THE LOOP, THE NEXT PRODUCTION SOURCE     00064900
065000* WILL BE READ IN.                                                00065000
065100******************************************************************00065100
065200 1000P-PROCESS.                                                   00065200
065300                                                                  00065300
065400     PERFORM 2100P-OPEN-SALE-CHK-CSR                              00065400
065500     PERFORM 2120P-FETCH-SALE-CHK-CSR                             00065500
065600     PERFORM 2040P-PROCESS-SALE-CHK-CSR                           00065600
065700       UNTIL SALE-CHK-NOT-FOUND                                   00065700
065800     PERFORM 2140P-CLOSE-SALE-CHK-CSR                             00065800
065900                                                                  00065900
066000     PERFORM 8000P-GET-SYSPARM-RECORD                             00066000
066100     .                                                            00066100
066200                                                                  00066200
066300***************************************************************** 00066300
066400* THIS PARAGRAPH IS USED TO PROCESS ROWS SELECTED FROM THE        00066400
066500* SALE_CHK_CSR. FIRST, WE WILL VERIFY IF THE DEALER IS WDMO       00066500
066600* BASED AND IF IT IS, WE WILL THEN MOVE ALL DATA FOR THE          00066600
066700* VEHICLE TO THE OUTPUT RECORD.  AFTERWARDS, THE NEXT ROW WILL    00066700
066800* BE SELECTED FROM THE SALE_CHK_CSR.                              00066800
066900***************************************************************** 00066900
067000 2040P-PROCESS-SALE-CHK-CSR.                                      00067000
067100                                                                  00067100
067200     PERFORM 2050P-VERIFY-WDMO-DEALER                             00067200
067300     IF WDMO-DEALER AND SSTK-SUCCESSFUL                           00067300
067400        PERFORM 5000P-PROCESS-GEVIS-DETAIL-REC                    00067400
067500     END-IF                                                       00067500
067600     PERFORM 2120P-FETCH-SALE-CHK-CSR                             00067600
067700     .                                                            00067700
067800                                                                  00067800
067900***************************************************************** 00067900
068000* A CALL IS PLACED TO SUBROUTINE EXWWSSTK IN ORDER TO OBTAIN THE  00068000
068100* CURRENT STOCKING DEALER FOR A VEHICLE.  AFTERWARDS, USING THE   00068100
068200* CURRENT STOCKING DEALER (IF ONE WAS FOUND), A CALL WILL BE      00068200
068300* PLACED TO TABLE MEXW035 TO DETERMINE WHETHER OR NOT THE STOCK-  00068300
068400* ING DEALER IS WDMO BASED.                                       00068400
068500***************************************************************** 00068500
068600 2050P-VERIFY-WDMO-DEALER.                                        00068600
068700     PERFORM 2060P-CALL-EXWWSSTK                                  00068700
068800     IF SSTK-SUCCESSFUL                                           00068800
068900                                                                  00068900
069000        MOVE SSTK-GBL-STK-DLR-C        TO                         00069000
069100                                        PV-VST-GBL-LOC-C-REFORMAT 00069100
069200        MOVE PV-VST-GBL-LOC-C-REFORMAT TO DLR-DLR-DLR-C           00069200
069300        PERFORM 5050P-GET-MEXW035-DATA                            00069300
069400        IF MEXW035-FOUND                                          00069400
069500                                                                  00069500
069600           IF DLR-SUB-SUBLVL1-C  = PL-WDM                         00069600
069700              SET WDMO-DEALER          TO TRUE                    00069700
069800           ELSE                                                   00069800
069900              SET NOT-WDMO-DEALER      TO TRUE                    00069900
070000           END-IF                                                 00070000
070100                                                                  00070100
070200        ELSE                                                      00070200
070300           SET NOT-WDMO-DEALER         TO TRUE                    00070300
070400        END-IF                                                    00070400
070500                                                                  00070500
070600     END-IF                                                       00070600
070700     .                                                            00070700
070800                                                                  00070800
070900***************************************************************** 00070900
071000* USING PRODUCTION SOURCE AND ORDER-ID, A CALL WILL NOW BE PLACED 00071000
071100* TO SUBROUTINE EXWWSSTK TO OBTAIN THE CURRENT STOCKING DEALER,   00071100
071200* CURRENT STOCKING DEALER STATUS CODE AND CURRENT STOCKING        00071200
071300* DEALER STATUS DATE.                                             00071300
071400***************************************************************** 00071400
071500 2060P-CALL-EXWWSSTK.                                             00071500
071600     INITIALIZE SSTK-I-O-DATA                                     00071600
071700     SET SSTK-INQUIRY-MODE            TO TRUE                     00071700
071800     MOVE VEH-ORD-ID-C                TO SSTK-VEH-ORD-ID-C        00071800
071900     MOVE VEH-DTA-DATA-SRC-C          TO SSTK-DTA-DATA-SRC-C      00071900
072000                                                                  00072000
072100     CALL  "EXWWSSTK"  USING SSTK-I-O-DATA                        00072100
072200                                                                  00072200
072300     EVALUATE TRUE                                                00072300
072400                                                                  00072400
072500        WHEN SSTK-SUCCESSFUL                                      00072500
072600             ADD +1                   TO PV-NBR-EXWWSSTK-CALLS    00072600
072700                                                                  00072700
072800        WHEN SSTK-DB2-ERROR                                       00072800
072900             PERFORM 2070P-SSTK-FATAL-ERROR                       00072900
073000                                                                  00073000
073100     END-EVALUATE                                                 00073100
073200     .                                                            00073200
073300                                                                  00073300
073400******************************************************************00073400
073500* THIS PARAGRAPH HANDLES THE FATAL ERROR TOMBSTONE FORMATTING OF  00073500
073600* THE CALL THAT WAS PLACED TO SUBROUTINE EXWWSSTK.                00073600
073700******************************************************************00073700
073800 2070P-SSTK-FATAL-ERROR.                                          00073800
073900     MOVE SPACES                      TO AUDIT-RECORD             00073900
074000     WRITE AUDIT-RECORD                                           00074000
074100                                                                  00074100
074200     MOVE "PGM NAME: "                TO AUDIT-LABEL              00074200
074300     MOVE SSTK-PGM-ID                 TO AUDIT-DATA               00074300
074400     WRITE AUDIT-RECORD                                           00074400
074500                                                                  00074500
074600     MOVE "RET CODE: "                TO AUDIT-LABEL              00074600
074700     MOVE SSTK-RETURN-CD              TO AUDIT-DATA               00074700
074800     WRITE AUDIT-RECORD                                           00074800
074900                                                                  00074900
075000     MOVE "PARAGRAPH: "               TO AUDIT-LABEL              00075000
075100     MOVE SSTK-PARAGRAPH              TO AUDIT-DATA               00075100
075200     WRITE AUDIT-RECORD                                           00075200
075300                                                                  00075300
075400     MOVE SPACES                      TO AUDIT-RECORD             00075400
075500     WRITE AUDIT-RECORD                                           00075500
075600                                                                  00075600
075700     MOVE "TBL NAME1: "               TO AUDIT-LABEL              00075700
075800     MOVE SSTK-DB2-TABLE1             TO AUDIT-DATA               00075800
075900     WRITE AUDIT-RECORD                                           00075900
076000                                                                  00076000
076100     IF SSTK-DB2-TABLE2 > SPACES                                  00076100
076200        MOVE "TBL NAME2: "            TO AUDIT-LABEL              00076200
076300        MOVE SSTK-DB2-TABLE2          TO AUDIT-DATA               00076300
076400        WRITE AUDIT-RECORD                                        00076400
076500     END-IF                                                       00076500
076600                                                                  00076600
076700     IF SSTK-DB2-TABLE3 > SPACES                                  00076700
076800        MOVE "TBL NAME3: "            TO AUDIT-LABEL              00076800
076900        MOVE SSTK-DB2-TABLE3          TO AUDIT-DATA               00076900
077000        WRITE AUDIT-RECORD                                        00077000
077100     END-IF                                                       00077100
077200                                                                  00077200
077300     IF SSTK-DB2-TABLE4 > SPACES                                  00077300
077400        MOVE "TBL NAME4: "            TO AUDIT-LABEL              00077400
077500        MOVE SSTK-DB2-TABLE4          TO AUDIT-DATA               00077500
077600        WRITE AUDIT-RECORD                                        00077600
077700     END-IF                                                       00077700
077800                                                                  00077800
077900     IF SSTK-DB2-TABLE5 > SPACES                                  00077900
078000        MOVE "TBL NAME5: "            TO AUDIT-LABEL              00078000
078100        MOVE SSTK-DB2-TABLE5          TO AUDIT-DATA               00078100
078200        WRITE AUDIT-RECORD                                        00078200
078300     END-IF                                                       00078300
078400                                                                  00078400
078500     MOVE SPACES                      TO AUDIT-RECORD             00078500
078600     WRITE AUDIT-RECORD                                           00078600
078700                                                                  00078700
078800     MOVE "HOST VAR1: "               TO AUDIT-LABEL              00078800
078900     MOVE SSTK-HOST-VAR1              TO AUDIT-DATA               00078900
079000     WRITE AUDIT-RECORD                                           00079000
079100                                                                  00079100
079200     IF SSTK-HOST-VAR2 > SPACES                                   00079200
079300        MOVE "HOST VAR2: "            TO AUDIT-LABEL              00079300
079400        MOVE SSTK-HOST-VAR2           TO AUDIT-DATA               00079400
079500        WRITE AUDIT-RECORD                                        00079500
079600     END-IF                                                       00079600
079700                                                                  00079700
079800     IF SSTK-HOST-VAR3 > SPACES                                   00079800
079900        MOVE "HOST VAR3: "            TO AUDIT-LABEL              00079900
080000        MOVE SSTK-HOST-VAR3           TO AUDIT-DATA               00080000
080100        WRITE AUDIT-RECORD                                        00080100
080200     END-IF                                                       00080200
080300                                                                  00080300
080400     IF SSTK-HOST-VAR4 > SPACES                                   00080400
080500        MOVE "HOST VAR4: "            TO AUDIT-LABEL              00080500
080600        MOVE SSTK-HOST-VAR4           TO AUDIT-DATA               00080600
080700        WRITE AUDIT-RECORD                                        00080700
080800     END-IF                                                       00080800
080900                                                                  00080900
081000     IF SSTK-HOST-VAR5 > SPACES                                   00081000
081100        MOVE "HOST VAR5: "            TO AUDIT-LABEL              00081100
081200        MOVE SSTK-HOST-VAR5           TO AUDIT-DATA               00081200
081300        WRITE AUDIT-RECORD                                        00081300
081400     END-IF                                                       00081400
081500                                                                  00081500
081600     IF SSTK-HOST-VAR6 > SPACES                                   00081600
081700        MOVE "HOST VAR6: "            TO AUDIT-LABEL              00081700
081800        MOVE SSTK-HOST-VAR6           TO AUDIT-DATA               00081800
081900        WRITE AUDIT-RECORD                                        00081900
082000     END-IF                                                       00082000
082100                                                                  00082100
082200     IF SSTK-HOST-VAR7 > SPACES                                   00082200
082300        MOVE "HOST VAR7: "            TO AUDIT-LABEL              00082300
082400        MOVE SSTK-HOST-VAR7           TO AUDIT-DATA               00082400
082500        WRITE AUDIT-RECORD                                        00082500
082600     END-IF                                                       00082600
082700                                                                  00082700
082800     IF SSTK-HOST-VAR8 > SPACES                                   00082800
082900        MOVE "HOST VAR8: "            TO AUDIT-LABEL              00082900
083000        MOVE SSTK-HOST-VAR8           TO AUDIT-DATA               00083000
083100        WRITE AUDIT-RECORD                                        00083100
083200     END-IF                                                       00083200
083300                                                                  00083300
083400     MOVE SPACES                      TO AUDIT-RECORD             00083400
083500     WRITE AUDIT-RECORD                                           00083500
083600                                                                  00083600
083700     MOVE "SQL CODE: "                TO AUDIT-LABEL              00083700
083800     MOVE SSTK-SQL-RETURN-CODE        TO PV-PROCESS-SQLCODE-EDIT  00083800
083900     MOVE PV-PROCESS-SQLCODE-EDIT     TO AUDIT-DATA               00083900
084000     WRITE AUDIT-RECORD                                           00084000
084100                                                                  00084100
084200     IF SSTK-SQL-WARNING > SPACES                                 00084200
084300        MOVE "SQL-WARN: "             TO AUDIT-LABEL              00084300
084400        MOVE  SSTK-SQL-WARNING        TO AUDIT-DATA               00084400
084500        WRITE AUDIT-RECORD                                        00084500
084600     END-IF                                                       00084600
084700                                                                  00084700
084800     MOVE "SQL-FUNC: "                TO AUDIT-LABEL              00084800
084900     MOVE SSTK-SQL-FUNCTION           TO AUDIT-DATA               00084900
085000     WRITE AUDIT-RECORD                                           00085000
085100                                                                  00085100
085200     MOVE "SQL-MSG1: "                TO AUDIT-LABEL              00085200
085300     MOVE  SSTK-SQL-MSG1              TO AUDIT-DATA               00085300
085400     WRITE AUDIT-RECORD                                           00085400
085500                                                                  00085500
085600     MOVE "SQL-MSG2: "                TO AUDIT-LABEL              00085600
085700     MOVE SSTK-SQL-MSG2               TO AUDIT-DATA               00085700
085800     WRITE AUDIT-RECORD                                           00085800
085900                                                                  00085900
086000     MOVE "SQL-MSG3: "                TO AUDIT-LABEL              00086000
086100     MOVE SSTK-SQL-MSG3               TO AUDIT-DATA               00086100
086200     WRITE AUDIT-RECORD                                           00086200
086300                                                                  00086300
086400     MOVE "SQL-MSG4: "                TO AUDIT-LABEL              00086400
086500     MOVE SSTK-SQL-MSG4               TO AUDIT-DATA               00086500
086600     WRITE AUDIT-RECORD                                           00086600
086700                                                                  00086700
086800     MOVE SPACES                      TO AUDIT-RECORD             00086800
086900     WRITE AUDIT-RECORD                                           00086900
087000                                                                  00087000
087100     IF SSTK-SQL-RETURN-CODE = 100                                00087100
087200        SET SEND-EMAIL                TO TRUE                     00087200
087300        ADD +1 TO PV-NBR-EXWWSSTK-NOTFOUND-CALLS                  00087300
087400     ELSE                                                         00087400
087500        PERFORM 9999C-CALL-COREDUMP                               00087500
087600     END-IF                                                       00087600
087700     .                                                            00087700
087800                                                                  00087800
087900***************************************************************** 00087900
088000* OPENS THE SALES CHECK CURSOR WHICH RETRIEVES ALL SALES THAT     00088000
088100* HAVE OCCURRED SINCE THE LAST RUN.                               00088100
088200***************************************************************** 00088200
088300 2100P-OPEN-SALE-CHK-CSR.                                         00088300
088400                                                                  00088400
088500     MOVE WS-SYSPARM-DATA-SRC         TO VRS-DTA-DATA-SRC-C       00088500
088600     MOVE PL-Y                        TO VRS-ACTIVE-F             00088600
088700                                                                  00088700
088800     EXEC SQL                                                     00088800
088900         OPEN SALE_CHK_CSR                                        00088900
089000     END-EXEC                                                     00089000
089100                                                                  00089100
089200     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00089200
089300                                                                  00089300
089400     IF  NOT SC-DB2-SQLCODE-OK                                    00089400
089500         MOVE SQLCODE                 TO DB2-ABEND-SQLCODE        00089500
089600         MOVE "OPEN"                  TO DB2-ABEND-FUNCTION       00089600
089700         MOVE PL-SALE-CHK-CSR         TO DB2-ABEND-TABLE          00089700
089800         MOVE DB2-ABEND-MSG           TO ABEND-MSG                00089800
089900         MOVE "2100P"                 TO ABEND-PARAGRAPH          00089900
090000         PERFORM 9999P-ABEND                                      00090000
090100     END-IF                                                       00090100
090200     .                                                            00090200
090300                                                                  00090300
090400***************************************************************** 00090400
090500* FETCHES A ROW FROM THE SALES CHECK CURSOR WHICH RETRIEVES ALL   00090500
090600* SALES THAT HAVE OCCURRED SINCE THE LAST RUN.                    00090600
090700***************************************************************** 00090700
090800 2120P-FETCH-SALE-CHK-CSR.                                        00090800
090900                                                                  00090900
091000     EXEC SQL                                                     00091000
091100         FETCH  SALE_CHK_CSR                                      00091100
091200          INTO  :VEH-VIN-FULL-C                                   00091200
091300               ,:VEH-ORD-ID-C                                     00091300
091400               ,:VEH-DTA-DATA-SRC-C                               00091400
091500               ,:VEH-BDT-MDL-YR-Y                                 00091500
091600               ,:VEH-WMI-WMI-C                                    00091600
091700               ,:VEH-LCL-PLT-C                                    00091700
091800               ,:VEH-LCL-BDYTYP-C                                 00091800
091900               ,:VEH-GBL-ORD-DLR-C                                00091900
092000               ,:VEH-GBL-SHIP-TO-C                                00092000
092100               ,:VEH-ORD-RCPT-Y                                   00092100
092200               ,:VEH-WDMO-FLEET-C                                 00092200
092300               ,:VEH-WDMO-ORD-TYP                                 00092300
092400               ,:VEH-CATALOG-C                                    00092400
092500               ,:VEH-GBL-CATALOG-C                                00092500
092600               ,:VEH-PO-Y                                         00092600
092700               ,:VEH-GEVIS-VL-C                                   00092700
092800               ,:VEH-COUNTRY-ISO3-C                               00092800
092900     END-EXEC                                                     00092900
093000                                                                  00093000
093100     MOVE SQLCODE                    TO SC-DB2-SQLCODE            00093100
093200                                                                  00093200
093300     EVALUATE TRUE                                                00093300
093400        WHEN SC-DB2-SQLCODE-OK                                    00093400
093500             ADD +1                  TO PV-NBR-ROWS-READ-SALE-CHK 00093500
093600             SET SALE-CHK-FOUND      TO TRUE                      00093600
093700        WHEN SC-DB2-SQLCODE-END-OF-CURSOR                         00093700
093800             SET SALE-CHK-NOT-FOUND  TO TRUE                      00093800
093900        WHEN OTHER                                                00093900
094000             MOVE SQLCODE            TO DB2-ABEND-SQLCODE         00094000
094100             MOVE "FETCH"            TO DB2-ABEND-FUNCTION        00094100
094200             MOVE PL-SALE-CHK-CSR    TO DB2-ABEND-TABLE           00094200
094300             MOVE DB2-ABEND-MSG      TO ABEND-MSG                 00094300
094400             MOVE "2120P"            TO ABEND-PARAGRAPH           00094400
094500             PERFORM 9999P-ABEND                                  00094500
094600     END-EVALUATE                                                 00094600
094700     .                                                            00094700
094800                                                                  00094800
094900***************************************************************** 00094900
095000* CLOSES THE SALES CHECK CURSOR WHICH RETRIEVES ALL SALES THAT    00095000
095100* HAVE OCCURRED SINCE THE LAST RUN.                               00095100
095200***************************************************************** 00095200
095300 2140P-CLOSE-SALE-CHK-CSR.                                        00095300
095400                                                                  00095400
095500     EXEC SQL                                                     00095500
095600         CLOSE SALE_CHK_CSR                                       00095600
095700     END-EXEC                                                     00095700
095800                                                                  00095800
095900     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00095900
096000                                                                  00096000
096100     IF  NOT SC-DB2-SQLCODE-OK                                    00096100
096200         MOVE SQLCODE                 TO DB2-ABEND-SQLCODE        00096200
096300         MOVE "CLOSE"                 TO DB2-ABEND-FUNCTION       00096300
096400         MOVE PL-SALE-CHK-CSR         TO DB2-ABEND-TABLE          00096400
096500         MOVE DB2-ABEND-MSG           TO ABEND-MSG                00096500
096600         MOVE "2140P"                 TO ABEND-PARAGRAPH          00096600
096700         PERFORM 9999P-ABEND                                      00096700
096800     END-IF                                                       00096800
096900     .                                                            00096900
097000                                                                  00097000
097100***************************************************************** 00097100
097200* AT THIS POINT, THE VEHICLE HAS BEEN IDENTIFED AS HAVING A       00097200
097300* CURRENT STOCKING DEALER THAT IS CLASSIFIED AS WDMO.  NOW, OTHER 00097300
097400* DATA WILL BE GATHERED FOR THE VEHICLE AND THEN MOVED AND        00097400
097500* WRITTEN TO THE OUTPUT FILE.                                     00097500
097600*                                                                 00097600
097700***************************************************************** 00097700
097800 5000P-PROCESS-GEVIS-DETAIL-REC.                                  00097800
097900                                                                  00097900
098000     SET WERS-STRING-NOT-FOUND-SW     TO TRUE                     00098000
098100     INITIALIZE                          MEXW004-VEH-WERS-STRING  00098100
098200                                         VWR-WERS-STRING-X-TEXT   00098200
098300                                                                  00098300
098400     MOVE VEH-DTA-DATA-SRC-C          TO VWR-DTA-DATA-SRC-C       00098400
098500     MOVE VEH-ORD-ID-C                TO VWR-VEH-ORD-ID-C         00098500
098600                                                                  00098600
098700     PERFORM 7600P-SELECT-WERS-DATA-W004                          00098700
098800                                                                  00098800
098900     MOVE PL-E                        TO WS-DTL-VEH-DIVISION-C    00098900
099000                                                                  00099000
099100     PERFORM 5020P-MOVE-MEXW001-TO-DTL                            00099100
099200     PERFORM 5060P-OBTAIN-RETAIL-DATA                             00099200
099300     PERFORM 5040P-MOVE-SSTK-CURRENT-TO-DTL                       00099300
099400     PERFORM 5080P-OBTAIN-WHOLESALE-DATA                          00099400
099500     PERFORM 5100P-OBTAIN-WERS-DATA                               00099500
099600                                                                  00099600
099700     PERFORM 5120P-OBTAIN-MEXW003-20T                             00099700
099800     IF MEXW003-FOUND-20T                                         00099800
099900        STRING VST-STAT-Y (1:4)                                   00099900
100000               VST-STAT-Y (6:2)                                   00100000
100100               VST-STAT-Y (9:2)                                   00100100
100200          DELIMITED BY SIZE                                       00100200
100300          INTO WS-DTL-VEH-SCHD-VST-TARGET-Y                       00100300
100400        END-STRING                                                00100400
100500     END-IF                                                       00100500
100600                                                                  00100600
100700     PERFORM 5140P-OBTAIN-MEXW003-30R                             00100700
100800     IF MEXW003-FOUND-30R                                         00100800
100900        STRING VST-STAT-Y (1:4)                                   00100900
101000               VST-STAT-Y (6:2)                                   00101000
101100               VST-STAT-Y (9:2)                                   00101100
101200          DELIMITED BY SIZE                                       00101200
101300          INTO WS-DTL-VEH-PRODUCE-VST-STAT-Y                      00101300
101400        END-STRING                                                00101400
101500     ELSE                                                         00101500
101600        PERFORM 5160P-OBTAIN-MEXW003-30P                          00101600
101700        IF MEXW003-FOUND-30P                                      00101700
101800           STRING VST-STAT-Y (1:4)                                00101800
101900                  VST-STAT-Y (6:2)                                00101900
102000                  VST-STAT-Y (9:2)                                00102000
102100             DELIMITED BY SIZE                                    00102100
102200             INTO WS-DTL-VEH-PRODUCE-VST-STAT-Y                   00102200
102300           END-STRING                                             00102300
102400        END-IF                                                    00102400
102500     END-IF                                                       00102500
102600                                                                  00102600
102700     PERFORM 5180P-OBTAIN-MEXW003-30T                             00102700
102800     IF MEXW003-FOUND-30T                                         00102800
102900        STRING VST-STAT-Y (1:4)                                   00102900
103000               VST-STAT-Y (6:2)                                   00103000
103100               VST-STAT-Y (9:2)                                   00103100
103200          DELIMITED BY SIZE                                       00103200
103300          INTO WS-DTL-VEH-RELEASE-VST-STAT-Y                      00103300
103400        END-STRING                                                00103400
103500     END-IF                                                       00103500
103600                                                                  00103600
103700     PERFORM 5200P-OBTAIN-MEXW003-80F                             00103700
103800     IF MEXW003-FOUND-80F                                         00103800
103900        STRING VST-STAT-Y (1:4)                                   00103900
104000               VST-STAT-Y (6:2)                                   00104000
104100               VST-STAT-Y (9:2)                                   00104100
104200          DELIMITED BY SIZE                                       00104200
104300          INTO WS-DTL-VEH-ARRIVAL-VST-STAT-Y                      00104300
104400        END-STRING                                                00104400
104500     END-IF                                                       00104500
104600                                                                  00104600
104700     PERFORM 5220P-OPEN-40V-CSR                                   00104700
104800     PERFORM 5230P-FETCH-40V-ROW                                  00104800
104900     IF MEXW003-40V-CSR-ROW-FOUND                                 00104900
105000        MOVE VST-GBL-LOC-C           TO WS-DTL-ORIG-VST-GBL-LOC-C 00105000
105100     END-IF                                                       00105100
105200                                                                  00105200
105300     PERFORM 5240P-CLOSE-40V-CSR                                  00105300
105400     IF   PV-COUNT-DTL-NBR  = 999999                              00105400
105500          MOVE ZERO                  TO PV-COUNT-DTL-NBR          00105500
105600     END-IF                                                       00105600
105700     IF   PV-COUNT-LINE-NBR = 999999                              00105700
105800          MOVE ZERO                  TO PV-COUNT-LINE-NBR         00105800
105900     END-IF                                                       00105900
106000     IF MEXW027-FOUND                                             00106000
106100         INITIALIZE WS-DTL-HUB-REC-ID-NBR                         00106100
106200         ADD  +1                     TO PV-COUNT-DTL-NBR          00106200
106300                                        PV-COUNT-LINE-NBR         00106300
106400         MOVE PV-COUNT-LINE-NBR      TO WS-DTL-REC-ID-NBR         00106400
106500                                        WS-DTL-HUB-LINE-NBR       00106500
106600         MOVE PL-001                 TO WS-DTL-HUB-REC-SEQ-NBR    00106600
106700         MOVE PL-010                 TO WS-DTL-HUB-REC-TYPE       00106700
106800         MOVE WS-MKT-ASSOC-DETAIL-RECORD                          00106800
106900                                     TO MKT-ASSOC-RECORD          00106900
107000         WRITE MKT-ASSOC-RECORD                                   00107000
107100         ADD +1                      TO PV-NBR-OUTPUT-RECS-WRTN   00107100
107200     END-IF                                                       00107200
107300                                                                  00107300
107400     INITIALIZE  WS-MKT-ASSOC-DETAIL-RECORD                       00107400
107500     .                                                            00107500
107600                                                                  00107600
107700***************************************************************** 00107700
107800* DATA THAT WAS PREVIOUSLY FETCHED FROM TABLE MEXW001 WILL NOW    00107800
107900* BE MOVED TO THE OUTPUT RECORD.                                  00107900
108000*                                                                 00108000
108100* THE BODY STYLE INFORMATION WILL BE RETRIEVED FROM TABLE         00108100
108200* TABLE MEXW031_CATMAP FOR NON 'NA' AND NON 'EA' SOURCES.         00108200
108300*                                                                 00108300
108400* NOTE: IF THE NON 'NA' AND NON 'EA' SOURCES ARE NOT FOUND ON     00108400
108500* TABLE MEXW031, THEN WE WILL MOVE THE VEH-LCL-BDYTYP-C WHICH     00108500
108600* WAS RETRIEVED FROM TABLE MEXW001.                               00108600
108700*                                                                 00108700
108800* THE MEXW031-CSR WHEN EXECUTED, BRINGS BACK ONE ROW.             00108800
108900*                                                                 00108900
109000* BODY STYLE - VWR-WERS-STRING-TEXT(10:2) IS THE WERS OPTION      00109000
109100*              CODE FOR BODY STYLE FROM TABLE MEXW004             00109100
109200* WHEN MEXW031-CSR IS EXECUTED, IT ONLY BRINGS BACK ONE ROW       00109200
109300* FOR PROCESSING.                                                 00109300
109400*                                                                 00109400
109500***************************************************************** 00109500
109600 5020P-MOVE-MEXW001-TO-DTL.                                       00109600
109700                                                                  00109700
109800     MOVE VEH-VIN-FULL-C              TO WS-DTL-VIN-FULL-C        00109800
109900     MOVE VEH-DTA-DATA-SRC-C          TO WS-DTL-DTA-DATA-SRC-C    00109900
110000     MOVE VEH-BDT-MDL-YR-Y            TO PV-VEH-BDT-MDL-YR-Y      00110000
110100     MOVE PV-VEH-BDT-MDL-YR-YY        TO WS-DTL-BDT-MDL-YR-Y      00110100
110200     MOVE VEH-WMI-WMI-C               TO WS-DTL-WMI-WMI-C         00110200
110300     MOVE VEH-LCL-PLT-C               TO WS-DTL-LCL-PLT-C         00110300
110400                                                                  00110400
110500     IF  WERS-STRING-FOUND-SW                                     00110500
110600         MOVE VWR-WERS-STRING-X-TEXT(10:2)                        00110600
110700                                      TO WS-DTL-LCL-BDYTYP-C      00110700
110800     ELSE                                                         00110800
110900        PERFORM 5300P-OPEN-MEXW031-CSR                            00110900
111000        PERFORM 5320P-FETCH-MEXW031-CSR                           00111000
111100        PERFORM 5340P-CLOSE-MEXW031-CSR                           00111100
111200                                                                  00111200
111300        IF MEXW031-FOUND                                          00111300
111400           MOVE CTM-OPT-OPTION-C      TO WS-DTL-LCL-BDYTYP-C      00111400
111500        ELSE                                                      00111500
111600           MOVE VEH-LCL-BDYTYP-C      TO WS-DTL-LCL-BDYTYP-C      00111600
111700        END-IF                                                    00111700
111800                                                                  00111800
111900     END-IF                                                       00111900
112000                                                                  00112000
112100     MOVE VEH-GBL-ORD-DLR-C           TO DLR-DLR-DLR-C            00112100
112200     PERFORM 5050P-GET-MEXW035-DATA                               00112200
112300     IF MEXW035-FOUND                                             00112300
112400                                                                  00112400
112500        IF DLR-SUPER-DLR-C = ZEROS                                00112500
112600           MOVE SPACES                TO WS-DTL-VEH-GBL-DLR-C     00112600
112700        ELSE                                                      00112700
112800           MOVE DLR-SUPER-DLR-C       TO                          00112800
112900                PV-DTL-VEH-GBL-DLR-C-REFORMAT                     00112900
113000           MOVE PV-DTL-VEH-GBL-DLR-C-REFORMAT                     00113000
113100                                      TO WS-DTL-VEH-GBL-DLR-C     00113100
113200        END-IF                                                    00113200
113300                                                                  00113300
113400     ELSE                                                         00113400
113500        MOVE SPACES                   TO WS-DTL-VEH-GBL-DLR-C     00113500
113600     END-IF                                                       00113600
113700*    ----------------------------------------------------------   00113700
113800*    THE SHIP TO DEALER IS THE DEALER THAT WAS REPORTED AT THE    00113800
113900*    TIME OF THE ORDER, SO IF IT'S EQUAL TO SPACES, WE WILL USE   00113900
114000*    THE ORIGINAL ORDERING DEALER.                                00114000
114100*    ----------------------------------------------------------   00114100
114200     IF   VEH-GBL-SHIP-TO-C                                       00114200
114300        > SPACES                                                  00114300
114400          MOVE VEH-GBL-SHIP-TO-C      TO WS-DTL-SHIP-TO-DLR-C     00114400
114500     ELSE                                                         00114500
114600          MOVE WS-DTL-VEH-GBL-DLR-C   TO WS-DTL-SHIP-TO-DLR-C     00114600
114700     END-IF                                                       00114700
114800     STRING VEH-ORD-RCPT-Y (1:4)                                  00114800
114900            VEH-ORD-RCPT-Y (6:2)                                  00114900
115000            VEH-ORD-RCPT-Y (9:2)                                  00115000
115100       DELIMITED BY SIZE                                          00115100
115200       INTO WS-DTL-VEH-ORD-RCPT-Y                                 00115200
115300     END-STRING                                                   00115300
115400     MOVE VEH-WDMO-FLEET-C            TO WS-DTL-WDMO-FLEET-C      00115400
115500     MOVE VEH-WDMO-ORD-TYP            TO WS-DTL-VEH-WDMO-ORD-TYP  00115500
115600     MOVE VEH-GBL-CATALOG-C           TO WS-DTL-VEH-CATALOG-C     00115600
115700     IF VEH-PO-Y > PL-DB2-DATE-MIN                                00115700
115800        STRING VEH-PO-Y (1:4)                                     00115800
115900               VEH-PO-Y (6:2)                                     00115900
116000               VEH-PO-Y (9:2)                                     00116000
116100          DELIMITED BY SIZE                                       00116100
116200          INTO WS-DTL-VEH-PO-Y                                    00116200
116300        END-STRING                                                00116300
116400     END-IF                                                       00116400
116500     MOVE VEH-GEVIS-VL-C              TO WS-DTL-GEVIS-VEH-LINE-C  00116500
116600     .                                                            00116600
116700                                                                  00116700
116800******************************************************************00116800
116900* THE CURRENT DEALER/STOCKING DEALER, CURRENT STATUS CODE AND     00116900
117000* CURRENT STATUS CODE DATE WERE RETRIEVED EARLIER.  NOW THE CUR-  00117000
117100* RENT VEHICLE'S STATUS CODE WILL BE USED TO OBTAIN THE VINCENT   00117100
117200* EQUIVALENT FROM TABLE MEXW027 USING "VI" AS THE PRODUCTION      00117200
117300* SOURCE.                                                         00117300
117400* NOTE: DURING DEVELOPMENT OF THIS PROGRAM, IT WAS DECIDED TO     00117400
117500* INSERT GLOBAL/LOCAL CODES ON THE MEXW027 CONVERSION TABLE,      00117500
117600* WITH THE VALUES THAT VINCENT USES FOR THEIR VRULES PROCESSING.  00117600
117700* RATHER THAN HARD CODING THE VALUES IN THIS PROGRAM AND THE      00117700
117800* STORED PROCEDURE (EXWWGEVP), IT IS BETTER TO MAKE A DIRECT CALL 00117800
117900* TO THE TABLE WHERE THE CODES CAN BE MORE EASILY CHANGED, SHOULD 00117900
118000* A CHANGE ARISE IN THE FUTURE.                                   00118000
118100* A CHECK HAS BEEN ADDED TO SEND VINCENT A STATUS CODE OF 600     00118100
118200* INSTEAD OF 800 WHEN THERE ARE NO SALES TYPE OR SALES DATE       00118200
118300* AVAILABLE.                                                      00118300
118400******************************************************************00118400
118500 5040P-MOVE-SSTK-CURRENT-TO-DTL.                                  00118500
118600                                                                  00118600
118700     INITIALIZE PS-MEXW027-SW                                     00118700
118800                                                                  00118800
118900     MOVE SSTK-GBL-STK-DLR-C        TO                            00118900
119000          PV-VST-GBL-LOC-C-REFORMAT                               00119000
119100     MOVE PV-VST-GBL-LOC-C-REFORMAT TO DLR-DLR-DLR-C              00119100
119200     PERFORM 5050P-GET-MEXW035-DATA                               00119200
119300     IF MEXW035-FOUND                                             00119300
119400                                                                  00119400
119500        IF DLR-SUPER-DLR-C = ZEROS                                00119500
119600           MOVE SPACES              TO WS-DTL-CURR-STOCKING-DLR-C 00119600
119700                WS-DTL-CURR-DLR-C                                 00119700
119800        ELSE                                                      00119800
119900           MOVE DLR-SUPER-DLR-C     TO                            00119900
120000                PV-DLR-SUPER-DLR-C-REFORMAT                       00120000
120100           MOVE PV-DLR-SUPER-DLR-C-REFORMAT                       00120100
120200                                    TO                            00120200
120300                WS-DTL-CURR-STOCKING-DLR-C                        00120300
120400                WS-DTL-CURR-DLR-C                                 00120400
120500        END-IF                                                    00120500
120600                                                                  00120600
120700     ELSE                                                         00120700
120800        MOVE SPACES                 TO WS-DTL-CURR-STOCKING-DLR-C 00120800
120900                                       WS-DTL-CURR-DLR-C          00120900
121000     END-IF                                                       00121000
121100                                                                  00121100
121200     IF WS-DTL-CURR-STOCKING-DLR-C > SPACES                       00121200
121300        STRING SSTK-CUR-STAT-Y (1:4)                              00121300
121400               SSTK-CUR-STAT-Y (6:2)                              00121400
121500               SSTK-CUR-STAT-Y (9:2)                              00121500
121600            DELIMITED BY SIZE                                     00121600
121700          INTO WS-DTL-VEH-STOCK-VST-STAT-Y                        00121700
121800        END-STRING                                                00121800
121900     END-IF                                                       00121900
122000     IF SSTK-CUR-STAT-C > SPACES                                  00122000
122100        PERFORM 5045P-SELECT-MEXW027-DATA                         00122100
122200                                                                  00122200
122300        IF MEXW027-NOT-FOUND                                      00122300
122400           PERFORM 9050P-MISSING-MEXW027-ROW                      00122400
122500        END-IF                                                    00122500
122600                                                                  00122600
122700        IF MEXW027-FOUND                                          00122700
122800           MOVE CNT-LCL-DATA-X (1:3)  TO WS-DTL-CUR-STA-STATUS-C  00122800
122900        END-IF                                                    00122900
123000     END-IF                                                       00123000
123100                                                                  00123100
123200     IF WS-DTL-CUR-STA-STATUS-C = PL-800                          00123200
123300        IF   VRS-TYP-LCL-CUST-C = PL-A4                           00123300
123400             MOVE PL-801              TO WS-DTL-CUR-STA-STATUS-C  00123400
123500        ELSE                                                      00123500
123600           IF   WS-DTL-VRS-TYP-LCL-CUST-C     = SPACES            00123600
123700             OR WS-DTL-VEH-SLSRCPT-VST-STAT-Y = SPACES            00123700
123800                MOVE PL-600           TO WS-DTL-CUR-STA-STATUS-C  00123800
123900           END-IF                                                 00123900
124000        END-IF                                                    00124000
124100     END-IF                                                       00124100
124200     .                                                            00124200
124300                                                                  00124300
124400******************************************************************00124400
124500* THE VINCENT EQUIVALENT STATUS CODE WILL NOW BE OBTAINED FOR THE 00124500
124600* CURRENT STATUS CODE THAT WAS RETRIEVED FROM SUBROUTINE EXWWSSTK.00124600
124700* SPECIAL NOTE:  WHEN ADDING ROWS TO TABLE MEXW027 FOR VINCENT,   00124700
124800* THE GLOBAL STATUS CODES MUST BE UNIQUE. THE FOLLOWING RULE      00124800
124900* ALSO APPLIES- THERE CAN EXIST ONE LOCAL STATUS CODE THAT CAN    00124900
125000* BE ASSIGNED TO SEVERAL DIFFERENT GLOBAL STATUS CODES (I.E.      00125000
125100* LOCAL CODE = 600 HAS MULTIPLE GLOBAL CODES OF 80J & 90U).       00125100
125200******************************************************************00125200
125300 5045P-SELECT-MEXW027-DATA.                                       00125300
125400                                                                  00125400
125500     MOVE SSTK-CUR-STAT-C             TO CNT-GBL-DATA-X           00125500
125600     MOVE PL-STATUS                   TO CNT-CND-CNV-TYP-C        00125600
125700     MOVE PL-VI                       TO CNT-DTA-DATA-SRC-C       00125700
125800     EXEC SQL                                                     00125800
125900         SELECT  CNT_LCL_DATA_X                                   00125900
126000           INTO :CNT-LCL-DATA-X                                   00126000
126100           FROM  MEXW027_CONV                                     00126100
126200          WHERE  CND_CNV_TYP_C     = :CNT-CND-CNV-TYP-C           00126200
126300            AND  DTA_DATA_SRC_C    = :CNT-DTA-DATA-SRC-C          00126300
126400            AND  CNT_GBL_DATA_X    = :CNT-GBL-DATA-X              00126400
126500     END-EXEC                                                     00126500
126600                                                                  00126600
126700     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00126700
126800                                                                  00126800
126900     EVALUATE TRUE                                                00126900
127000         WHEN SC-DB2-SQLCODE-OK                                   00127000
127100              ADD +1                  TO PV-NBR-ROWS-READ-MEXW027 00127100
127200              SET MEXW027-FOUND       TO TRUE                     00127200
127300                                                                  00127300
127400         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00127400
127500              SET MEXW027-NOT-FOUND   TO TRUE                     00127500
127600                                                                  00127600
127700         WHEN OTHER                                               00127700
127800              MOVE SQLCODE            TO DB2-ABEND-SQLCODE        00127800
127900              MOVE "SELECT"           TO DB2-ABEND-FUNCTION       00127900
128000              MOVE PL-TBL-CONV        TO DB2-ABEND-TABLE          00128000
128100              MOVE DB2-ABEND-MSG      TO ABEND-MSG                00128100
128200              MOVE "5045P"            TO ABEND-PARAGRAPH          00128200
128300              PERFORM 9999P-ABEND                                 00128300
128400     END-EVALUATE                                                 00128400
128500     .                                                            00128500
128600                                                                  00128600
128700 5050P-GET-MEXW035-DATA.                                          00128700
128800******************************************************************00128800
128900* A CALL WILL BE PLACED TO TABLE MEXW035 IN EITHER OF TWO SIT-    00128900
129000* UATIONS.  1) TO OBTAIN THE SUPER DEALER CODE WHICH WILL BE      00129000
129100* USED IN PLACE OF THE GLOBAL ORDERING DEALER CODE AND/OR GLOBAL  00129100
129200* CURRENT STOCKING DEALER CODE.  2)  TO DETERMINE WHETHER OR NOT  00129200
129300* THE CURRENT STOCKING DEALER IS WDMO BASED.                      00129300
129400******************************************************************00129400
129500     EXEC SQL                                                     00129500
129600         SELECT                                                   00129600
129700                 SUB_SUBLVL1_C                                    00129700
129800                ,DLR_SUPER_DLR_C                                  00129800
129900           INTO :DLR-SUB-SUBLVL1-C                                00129900
130000               ,:DLR-SUPER-DLR-C                                  00130000
130100           FROM  MEXW035_DLR_MSTR                                 00130100
130200          WHERE  DLR_DLR_C           = :DLR-DLR-DLR-C             00130200
130300     END-EXEC                                                     00130300
130400                                                                  00130400
130500     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00130500
130600                                                                  00130600
130700     EVALUATE TRUE                                                00130700
130800         WHEN SC-DB2-SQLCODE-OK                                   00130800
130900              ADD +1                  TO PV-NBR-ROWS-READ-MEXW035 00130900
131000              SET MEXW035-FOUND       TO TRUE                     00131000
131100                                                                  00131100
131200         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00131200
131300              SET MEXW035-NOT-FOUND   TO TRUE                     00131300
131400              PERFORM 9000P-MISSING-MEXW035-ROW                   00131400
131500                                                                  00131500
131600         WHEN OTHER                                               00131600
131700              MOVE SQLCODE            TO DB2-ABEND-SQLCODE        00131700
131800              MOVE "SELECT"           TO DB2-ABEND-FUNCTION       00131800
131900              MOVE PL-TBL-DLR-MSTR    TO DB2-ABEND-TABLE          00131900
132000              MOVE DB2-ABEND-MSG      TO ABEND-MSG                00132000
132100              MOVE "5050P"            TO ABEND-PARAGRAPH          00132100
132200              PERFORM 9999P-ABEND                                 00132200
132300     END-EVALUATE                                                 00132300
132400     .                                                            00132400
132500                                                                  00132500
132600******************************************************************00132600
132700* A JOIN WILL BE DONE ON TABLES MEXW003 & MEXW008 TO OBTAIN       00132700
132800* VARIOUS RETAIL DATA (IF THE VEHICLE IS IN RETAIL STATUS).       00132800
132900* NOTE: THE RETAILED STATUS DATE WILL BE USED TO POPULATE THE     00132900
133000* DELIVERY DATE WHICH IS THE SAME.                                00133000
133100******************************************************************00133100
133200 5060P-OBTAIN-RETAIL-DATA.                                        00133200
133300                                                                  00133300
133400     PERFORM 5065P-SELECT-MEXW008-90V-DATA                        00133400
133500     IF MEXW008-FOUND-90V                                         00133500
133600        STRING VST-STAT-Y (1:4)                                   00133600
133700               VST-STAT-Y (6:2)                                   00133700
133800               VST-STAT-Y (9:2)                                   00133800
133900          DELIMITED BY SIZE                                       00133900
134000          INTO WS-DTL-VEH-RETAIL-VST-STAT-Y                       00134000
134100        END-STRING                                                00134100
134200        MOVE WS-DTL-VEH-RETAIL-VST-STAT-Y                         00134200
134300          TO WS-DTL-VEH-DELIVER-VST-STAT-Y                        00134300
134400        PERFORM 5070P-POPULATE-RETAIL-OUTPUT                      00134400
134500     END-IF                                                       00134500
134600     .                                                            00134600
134700                                                                  00134700
134800******************************************************************00134800
134900* A JOIN WILL BE DONE ON TABLES MEXW003 & MEXW008 TO OBTAIN       00134900
135000* VARIOUS RETAILED DATA (IF THE VEHICLE HAS REACHED RETAIL STATUS)00135000
135100******************************************************************00135100
135200 5065P-SELECT-MEXW008-90V-DATA.                                   00135200
135300                                                                  00135300
135400     MOVE VEH-ORD-ID-C                TO VST-VEH-ORD-ID-C         00135400
135500     MOVE VEH-DTA-DATA-SRC-C          TO VST-DTA-DATA-SRC-C       00135500
135600     MOVE PL-90V                      TO VST-STA-STATUS-C         00135600
135700     MOVE PL-Y                        TO VST-LAST-OCCUR-F         00135700
135800          VST-ACTIVE-F                                            00135800
135900                                                                  00135900
136000     EXEC SQL                                                     00136000
136100         SELECT                                                   00136100
136200                 A.VST_STAT_Y                                     00136200
136300                ,B.VRS_LCL_FLEET_C                                00136300
136400                ,B.VRS_CST_FIRST_N                                00136400
136500                ,B.VRS_CST_BUS_1_N                                00136500
136600                ,B.VRS_CST_BUS_2_N                                00136600
136700                ,B.VRS_CST_MID_INIT_X                             00136700
136800                ,B.VRS_CST_LAST_N                                 00136800
136900                ,B.VRS_CST_ADDR_1_X                               00136900
137000                ,B.VRS_CST_ADD_DIV2_N                             00137000
137100                ,B.VRS_CST_ADD_DIV1_C                             00137100
137200                ,B.VRS_CST_POSTAL_C                               00137200
137300                ,B.VRS_SALESPERSON_C                              00137300
137400                ,B.VRS_TYP_LCL_CUST_C                             00137400
137500                ,B.VRS_RPT_SALE_Y                                 00137500
137600                ,B.VRS_WARR_STRT_Y                                00137600
137700           INTO  :VST-STAT-Y                                      00137700
137800                ,:VRS-LCL-FLEET-C                                 00137800
137900                ,:VRS-CST-FIRST-N                                 00137900
138000                ,:VRS-CST-BUS-1-N                                 00138000
138100                ,:VRS-CST-BUS-2-N                                 00138100
138200                ,:VRS-CST-MID-INIT-X                              00138200
138300                ,:VRS-CST-LAST-N                                  00138300
138400                ,:VRS-CST-ADDR-1-X                                00138400
138500                ,:VRS-CST-ADD-DIV2-N                              00138500
138600                ,:VRS-CST-ADD-DIV1-C                              00138600
138700                ,:VRS-CST-POSTAL-C                                00138700
138800                ,:VRS-SALESPERSON-C                               00138800
138900                ,:VRS-TYP-LCL-CUST-C                              00138900
139000                ,:VRS-RPT-SALE-Y                                  00139000
139100                ,:VRS-WARR-STRT-Y                                 00139100
139200           FROM  MEXW003_VEH_STATUS A                             00139200
139300                ,MEXW008_VEH_RTL B                                00139300
139400          WHERE  A.VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C          00139400
139500            AND  A.DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C        00139500
139600            AND  A.STA_STATUS_C      = :VST-STA-STATUS-C          00139600
139700            AND  A.VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F          00139700
139800            AND  A.VST_ACTIVE_F      = :VST-ACTIVE-F              00139800
139900            AND  A.VST_ACTIVE_F      = B.VRS_ACTIVE_F             00139900
140000            AND  A.STA_STATUS_C      = B.STA_STATUS_C             00140000
140100            AND  A.VEH_ORD_ID_C      = B.VEH_ORD_ID_C             00140100
140200            AND  A.DTA_DATA_SRC_C    = B.DTA_DATA_SRC_C           00140200
140300            AND  SUBSTR(A.VST_LCL_LOC_C, 1,7)                     00140300
140400                                     = B.VRS_LCL_DLR_C            00140400
140500            AND  A.VST_STAT_Y        = B.VRS_RETAIL_Y             00140500
140600     END-EXEC                                                     00140600
140700                                                                  00140700
140800     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00140800
140900                                                                  00140900
141000     EVALUATE TRUE                                                00141000
141100         WHEN SC-DB2-SQLCODE-OK                                   00141100
141200              ADD +1                  TO PV-NBR-ROWS-READ-MEXW008 00141200
141300              SET MEXW008-FOUND-90V   TO TRUE                     00141300
141400                                                                  00141400
141500         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00141500
141600              SET MEXW008-NOT-FOUND-90V TO TRUE                   00141600
141700                                                                  00141700
141800         WHEN OTHER                                               00141800
141900              MOVE SQLCODE            TO DB2-ABEND-SQLCODE        00141900
142000              MOVE "SELECT"           TO DB2-ABEND-FUNCTION       00142000
142100              MOVE PL-TBL-MEXW003-08  TO DB2-ABEND-TABLE          00142100
142200              MOVE DB2-ABEND-MSG      TO ABEND-MSG                00142200
142300              MOVE "5065P"            TO ABEND-PARAGRAPH          00142300
142400              PERFORM 9999P-ABEND                                 00142400
142500     END-EVALUATE                                                 00142500
142600     .                                                            00142600
142700                                                                  00142700
142800******************************************************************00142800
142900* IF A 90V STATUS WAS FOUND FOR THE VEHICLE, THEN VARIOUS RETAIL  00142900
143000* SALES DATA WILL BE MOVED TO CORRESPONDING OUTPUT FIELDS.  IF    00143000
143100* THE 90V STATUS WAS NOT FOUND FOR THE VEHICLE, THEN SPACES WILL  00143100
143200* BE MOVED TO THOSE OUTPUT FIELDS.                                00143200
143300* PER CUSTOMER, IF CUSTOMER FIRST NAME & LAST NAME IS BLANK, THEN 00143300
143400* THE BUSINESS NAME WILL BE MOVED TO THE FIRST NAME FIELD         00143400
143500******************************************************************00143500
143600 5070P-POPULATE-RETAIL-OUTPUT.                                    00143600
143700                                                                  00143700
143800     MOVE VRS-LCL-FLEET-C             TO WS-DTL-VRS-LCL-FLEET-C   00143800
143900                                                                  00143900
144000     IF    VRS-CST-FIRST-N = SPACES                               00144000
144100       AND VRS-CST-LAST-N  = SPACES                               00144100
144200          MOVE VRS-CST-BUS-1-N (1:30) TO WS-DTL-VRS-CST-FIRST-N   00144200
144300          MOVE VRS-CST-BUS-2-N (1:30) TO WS-DTL-VRS-CST-LAST-N    00144300
144400                                                                  00144400
144500     ELSE                                                         00144500
144600                                                                  00144600
144700          MOVE VRS-CST-FIRST-N       TO WS-DTL-VRS-CST-FIRST-N    00144700
144800          MOVE VRS-CST-MID-INIT-X    TO WS-DTL-VRS-CST-MID-INIT-X 00144800
144900          MOVE VRS-CST-LAST-N        TO WS-DTL-VRS-CST-LAST-N     00144900
145000     END-IF                                                       00145000
145100                                                                  00145100
145200     MOVE VRS-CST-ADDR-1-X           TO WS-DTL-VRS-CST-ADDR-1-X   00145200
145300     MOVE VRS-CST-ADD-DIV2-N         TO WS-DTL-VRS-CST-ADD-DIV2-N 00145300
145400     MOVE VRS-CST-ADD-DIV1-C         TO WS-DTL-VRS-CST-ADD-DIV1-C 00145400
145500     MOVE VRS-CST-POSTAL-C           TO WS-DTL-VRS-CST-POSTAL-C   00145500
145600     MOVE VRS-SALESPERSON-C          TO WS-DTL-VRS-SALESPERSON-C  00145600
145700                                                                  00145700
145800     PERFORM 5075P-POPULATE-CONCEPS-SLSTYP                        00145800
145900                                                                  00145900
146000*--- VEHICLE SALES RECEIPT DATE- IF IT EXISTS (> 0001-01-01)      00146000
146100     IF VRS-RPT-SALE-Y > PL-DB2-DATE-MIN                          00146100
146200        STRING VRS-RPT-SALE-Y (1:4)                               00146200
146300               VRS-RPT-SALE-Y (6:2)                               00146300
146400               VRS-RPT-SALE-Y (9:2)                               00146400
146500            DELIMITED BY SIZE                                     00146500
146600          INTO WS-DTL-VEH-SLSRCPT-VST-STAT-Y                      00146600
146700        END-STRING                                                00146700
146800     END-IF                                                       00146800
146900*    ----------------------------------------------------------   00146900
147000*    IF VEHICLE WARRANTY START DATE DOES NOT EXIST (0001-01-01)   00147000
147100*    WE WILL USE THE RETAIL SALES DATE, IF THE RETAIL SALES       00147100
147200*    DATE EXISTS (> 0001-01-01).                                  00147200
147300*    ----------------------------------------------------------   00147300
147400     IF   VRS-WARR-STRT-Y > PL-DB2-DATE-MIN                       00147400
147500          STRING VRS-WARR-STRT-Y (1:4)                            00147500
147600                 VRS-WARR-STRT-Y (6:2)                            00147600
147700                 VRS-WARR-STRT-Y (9:2)                            00147700
147800             DELIMITED BY SIZE                                    00147800
147900              INTO WS-DTL-VEH-WARRANT-VST-STAT-Y                  00147900
148000          END-STRING                                              00148000
148100     ELSE                                                         00148100
148200          IF VRS-RPT-SALE-Y  > PL-DB2-DATE-MIN                    00148200
148300             MOVE WS-DTL-VEH-SLSRCPT-VST-STAT-Y                   00148300
148400               TO WS-DTL-VEH-WARRANT-VST-STAT-Y                   00148400
148500          END-IF                                                  00148500
148600     END-IF                                                       00148600
148700     .                                                            00148700
148800                                                                  00148800
148900******************************************************************00148900
149000* THE GEVIS CUSTOMER TYPE CODE WILL BE CONVERTED TO A CONCEPS     00149000
149100* SALES TYPE CODE.                                                00149100
149200******************************************************************00149200
149300 5075P-POPULATE-CONCEPS-SLSTYP.                                   00149300
149400                                                                  00149400
149500     EVALUATE VRS-TYP-LCL-CUST-C                                  00149500
149600         WHEN PL-F1                                               00149600
149700         WHEN PL-7-2                                              00149700
149800             MOVE PL-7               TO WS-DTL-VRS-TYP-LCL-CUST-C 00149800
149900                                                                  00149900
150000         WHEN PL-F2                                               00150000
150100         WHEN PL-3-2                                              00150100
150200             MOVE PL-3               TO WS-DTL-VRS-TYP-LCL-CUST-C 00150200
150300                                                                  00150300
150400         WHEN PL-F3                                               00150400
150500         WHEN PL-T-2                                              00150500
150600             MOVE PL-T               TO WS-DTL-VRS-TYP-LCL-CUST-C 00150600
150700                                                                  00150700
150800         WHEN PL-F4                                               00150800
150900         WHEN PL-4-2                                              00150900
151000             MOVE PL-4               TO WS-DTL-VRS-TYP-LCL-CUST-C 00151000
151100                                                                  00151100
151200         WHEN PL-L2                                               00151200
151300         WHEN PL-L4                                               00151300
151400         WHEN PL-D-2                                              00151400
151500             MOVE PL-D               TO WS-DTL-VRS-TYP-LCL-CUST-C 00151500
151600                                                                  00151600
151700     END-EVALUATE                                                 00151700
151800     .                                                            00151800
151900                                                                  00151900
152000******************************************************************00152000
152100* TABLES MEXW003 & MEXW007 WILL BE JOINED IN ORDER TO OBTAIN      00152100
152200* VARIOUS WHOLESALE INFORMATION, IF THE VEHICLE HAS REACHED THAT  00152200
152300* STAGE.                                                          00152300
152400* NOTE: THE VEHICLE TOTAL AMOUNT MUST BE IN UNITED STATES DOLLAR  00152400
152500* CURRENCY (USD).  IF IT IS NOT, THEN ZERO WILL BE MOVED TO THE   00152500
152600* FIELD.                                                          00152600
152700******************************************************************00152700
152800 5080P-OBTAIN-WHOLESALE-DATA.                                     00152800
152900                                                                  00152900
153000     PERFORM 5085P-SELECT-MEXW003-40V                             00153000
153100     IF MEXW003-FOUND-40V                                         00153100
153200        MOVE VST-GBL-LOC-C           TO WS-DTL-CURR-VST-GBL-LOC-C 00153200
153300        STRING VST-STAT-Y (1:4)                                   00153300
153400               VST-STAT-Y (6:2)                                   00153400
153500               VST-STAT-Y (9:2)                                   00153500
153600          DELIMITED BY SIZE                                       00153600
153700          INTO WS-DTL-VEH-INVOICE-VST-STAT-Y                      00153700
153800        END-STRING                                                00153800
153900        IF VWS-CUR-CURRENCY-C = PL-USD                            00153900
154000           MOVE VWS-TOT-LCL-A        TO WS-DTL-VWS-TOT-US-A       00154000
154100        ELSE                                                      00154100
154200           MOVE ZERO                 TO WS-DTL-VWS-TOT-US-A       00154200
154300        END-IF                                                    00154300
154400     END-IF                                                       00154400
154500     .                                                            00154500
154600                                                                  00154600
154700******************************************************************00154700
154800* A JOIN ON TABLES MEXW003 & MEXW007 WILL BE DONE INTO ORDER TO   00154800
154900* RETRIEVE THE CURRENT INVOICE DEALER, THE INVOICING PREPARATION  00154900
155000* DATE, THE CURRENCY CODE AND THE VEHICLE TOTAL AMOUNT.           00155000
155100******************************************************************00155100
155200 5085P-SELECT-MEXW003-40V.                                        00155200
155300                                                                  00155300
155400     MOVE VEH-ORD-ID-C                TO VST-VEH-ORD-ID-C         00155400
155500     MOVE VEH-DTA-DATA-SRC-C          TO VST-DTA-DATA-SRC-C       00155500
155600     MOVE PL-40V                      TO VST-STA-STATUS-C         00155600
155700     MOVE PL-Y                        TO VST-LAST-OCCUR-F         00155700
155800          VST-ACTIVE-F                                            00155800
155900                                                                  00155900
156000     EXEC SQL                                                     00156000
156100         SELECT A.VST_GBL_LOC_C                                   00156100
156200               ,A.VST_STAT_Y                                      00156200
156300               ,B.VWS_TOT_LCL_A                                   00156300
156400               ,B.CUR_CURRENCY_C                                  00156400
156500          INTO  :VST-GBL-LOC-C                                    00156500
156600               ,:VST-STAT-Y                                       00156600
156700               ,:VWS-TOT-LCL-A                                    00156700
156800               ,:VWS-CUR-CURRENCY-C                               00156800
156900          FROM  MEXW003_VEH_STATUS A                              00156900
157000               ,MEXW007_VEH_WHS B                                 00157000
157100         WHERE  A.VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C           00157100
157200           AND  A.DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C         00157200
157300           AND  A.STA_STATUS_C      = :VST-STA-STATUS-C           00157300
157400           AND  A.VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F           00157400
157500           AND  A.VST_ACTIVE_F      = :VST-ACTIVE-F               00157500
157600           AND  A.VST_ACTIVE_F      = B.VWS_ACTIVE_F              00157600
157700           AND  A.STA_STATUS_C      = B.STA_STATUS_C              00157700
157800           AND  A.VEH_ORD_ID_C      = B.VEH_ORD_ID_C              00157800
157900           AND  A.DTA_DATA_SRC_C    = B.DTA_DATA_SRC_C            00157900
158000           AND  A.VST_STAT_Y        = B.VWS_DATE_Y                00158000
158100           AND  SUBSTR(A.VST_LCL_LOC_C, 1,7)                      00158100
158200                                    = B.VWS_LCL_DLR_C             00158200
158300     END-EXEC                                                     00158300
158400                                                                  00158400
158500     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00158500
158600                                                                  00158600
158700     EVALUATE TRUE                                                00158700
158800         WHEN SC-DB2-SQLCODE-OK                                   00158800
158900              ADD +1                  TO PV-NBR-ROWS-READ-MEXW007 00158900
159000              SET MEXW003-FOUND-40V   TO TRUE                     00159000
159100                                                                  00159100
159200         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00159200
159300              SET MEXW003-NOT-FOUND-40V TO TRUE                   00159300
159400                                                                  00159400
159500         WHEN OTHER                                               00159500
159600              MOVE SQLCODE              TO DB2-ABEND-SQLCODE      00159600
159700              MOVE "SELECT"             TO DB2-ABEND-FUNCTION     00159700
159800              MOVE PL-TBL-MEXW003-07    TO DB2-ABEND-TABLE        00159800
159900              MOVE DB2-ABEND-MSG        TO ABEND-MSG              00159900
160000              MOVE "5085P"              TO ABEND-PARAGRAPH        00160000
160100              PERFORM 9999P-ABEND                                 00160100
160200     END-EVALUATE                                                 00160200
160300     .                                                            00160300
160400                                                                  00160400
160500******************************************************************00160500
160600* THE WERS VEHICLE LINE CODE WILL BE OBTAINED FROM TABLE MEXW034  00160600
160700* OR FROM TABLE MEXW004_WERS_VL_STRING.                           00160700
160800* IF 'EA' OR 'NA' SOURCED, THE WERS VEHICLE LINE IS OBTAINED FROM 00160800
160900* MEXW034 DB2 TABLE USING THE PROD SOURCE AND GEVIS VEHICLE LINE, 00160900
161000* WHICH WAS OBTAINED FROM MEXW001 DB2 TABLE.                      00161000
161100* FOR ALL OTHER SOURCES, IF THE ORDER IS FOUND ON MEXW004 DB2     00161100
161200* TABLE, USE THE WERS VEHICLE LINE FROM MEXW004 DB2 TABLE AND     00161200
161300* GEVIS VEHICLE LINE FROM MEXW034 DB2 TABLE WERS PRODUCT TYPE CODE00161300
161400* AND WERS BODY USE TO MAKE UP THE WERS BODY STYLE.               00161400
161500* IF NOT FOUND ON MEXW004 DB2 TABLE, USE WERS VEHICLE LINE        00161500
161600* FROM MEXW0032 (CATALOG CODE), PRODUCT TYPE AND WERS BODY USE    00161600
161700* TO MAKE UP WERS BODY STYLE.                                     00161700
161800* IF NOT FOUND ON MEXW004 OR MEXW031/MEXW032 DB2 TABLES, WE ARE   00161800
161900* ASSUMING THE ORDER IS FROM HISTORY FOR 'NA' AND 'EA', USE       00161900
162000* MEXW034 DB2 TABLE PRODUCT TYPE CODE AND BODY TYPE FROM MEXW033  00162000
162100* USE TO MAKE UP THE BODY STYLE.                                  00162100
162200******************************************************************00162200
162300 5100P-OBTAIN-WERS-DATA.                                          00162300
162400                                                                  00162400
162500     SET MEXW034-NOT-FOUND             TO TRUE                    00162500
162600                                                                  00162600
162700     IF VEH-DTA-DATA-SRC-C = PL-EA OR PL-NA                       00162700
162800        IF VEH-GEVIS-VL-C  > PL-SPACES                            00162800
162900           PERFORM 5110P-SELECT-W034-DATA                         00162900
163000        END-IF                                                    00163000
163100                                                                  00163100
163200        IF MEXW034-FOUND                                          00163200
163300           MOVE VLN-WERS-VL-C          TO  WS-DTL-WERS-VEH-LINE-C 00163300
163400           MOVE VLN-WERS-BRAND-C (2:1) TO WS-DTL-WERS-BRAND-C     00163400
163500           MOVE VLN-GEVIS-VL-N         TO WS-DTL-VLN-GEVIS-VL-N   00163500
163600        END-IF                                                    00163600
163700                                                                  00163700
163800     ELSE                                                         00163800
163900                                                                  00163900
164000         IF  WERS-STRING-FOUND-SW                                 00164000
164100             PERFORM 5102P-WERS-STRING-PROCESS                    00164100
164200                                                                  00164200
164300         ELSE                                                     00164300
164400             PERFORM 5112P-SELECT-MEXW032-WERS-VL                 00164400
164500                                                                  00164500
164600             IF  MEXW032-FOUND                                    00164600
164700                 PERFORM 5104P-CATALOG-CODE-PROCESS               00164700
164800                                                                  00164800
164900             END-IF                                               00164900
165000         END-IF                                                   00165000
165100     END-IF                                                       00165100
165200                                                                  00165200
165300     MOVE SPACES                      TO WS-DTL-WERS-BODY-STYLE-C 00165300
165400                                                                  00165400
165500     IF  WERS-STRING-FOUND-SW                                     00165500
165600         STRING VWR-WERS-PRD-TP-C                                 00165600
165700              , VWR-WERS-STRING-X-TEXT(10:2)                      00165700
165800                  DELIMITED BY SIZE INTO WS-DTL-WERS-BODY-STYLE-C 00165800
165900         END-STRING                                               00165900
166000                                                                  00166000
166100     ELSE                                                         00166100
166200         IF  MEXW031-FOUND                                        00166200
166300             STRING CTM-VPT-PROD-TYP-C                            00166300
166400                  , CTM-OPT-OPTION-C                              00166400
166500                  DELIMITED BY SIZE INTO WS-DTL-WERS-BODY-STYLE-C 00166500
166600             END-STRING                                           00166600
166700                                                                  00166700
166800         ELSE                                                     00166800
166900             IF  VEH-DTA-DATA-SRC-C  =  PL-EA   OR  PL-NA         00166900
167000                 PERFORM 5115P-SELECT-MEXW033-DATA                00167000
167100                                                                  00167100
167200                 IF  MEXW033-FOUND                                00167200
167300                     IF  BDT-WERS-BDY-TYP-C  >  SPACES            00167300
167400                         STRING VLN-WERS-PRD-TP-C                 00167400
167500                              , BDT-WERS-BDY-TYP-C                00167500
167600                         DELIMITED BY SIZE                        00167600
167700                                    INTO WS-DTL-WERS-BODY-STYLE-C 00167700
167800                        END-STRING                                00167800
167900                                                                  00167900
168000                     END-IF                                       00168000
168100                 END-IF                                           00168100
168200             END-IF                                               00168200
168300         END-IF                                                   00168300
168400     END-IF                                                       00168400
168500     .                                                            00168500
168600                                                                  00168600
168700******************************************************************00168700
168800* PROCESS FEATURE DATA FROM WERS STRING W004 TABLE                00168800
168900*                                                                 00168900
169000* EVALUATE WERS VEHICLE LINE.  THESE ARE HANDLED AS               00169000
169100* EXEPTIONS AS THEY CAN APPEAR MUTIPLE TIMES FOR                  00169100
169200* DIFFERENT GEVIS VEHICLE LINES.                                  00169200
169300*                                                                 00169300
169400******************************************************************00169400
169500 5102P-WERS-STRING-PROCESS.                                       00169500
169600                                                                  00169600
169700     MOVE VWR-WERS-VL-C               TO PV-WERS-VL-C             00169700
169800                                                                  00169800
169900     IF  PV-VALID-VEH-LINE-CDS                                    00169900
170000         PERFORM 5110P-SELECT-W034-DATA                           00170000
170100         EVALUATE VWR-WERS-VL-C                                   00170100
170200             WHEN PL-KI                                           00170200
170300             WHEN PL-K5                                           00170300
170400                  MOVE PL-L5          TO VLN-GEVIS-VL-C           00170400
170500                  MOVE PL-AB          TO VLN-WERS-BRAND-C         00170500
170600                  SET MEXW034-FOUND   TO TRUE                     00170600
170700                                                                  00170700
170800             WHEN PL-DB                                           00170800
170900                  MOVE PL-DB          TO VLN-GEVIS-VL-C           00170900
171000                  MOVE PL-AB          TO VLN-WERS-BRAND-C         00171000
171100                  SET MEXW034-FOUND   TO TRUE                     00171100
171200         END-EVALUATE                                             00171200
171300     ELSE                                                         00171300
171400         PERFORM 5110P-SELECT-W034-DATA                           00171400
171500                                                                  00171500
171600     END-IF                                                       00171600
171700                                                                  00171700
171800     IF  VLN-GEVIS-VL-N = LOW-VALUES                              00171800
171900         MOVE SPACES TO VLN-GEVIS-VL-N                            00171900
172000     END-IF                                                       00172000
172100                                                                  00172100
172200     IF  MEXW034-FOUND                                            00172200
172300         MOVE VLN-GEVIS-VL-C          TO WS-DTL-GEVIS-VEH-LINE-C  00172300
172400         MOVE VWR-WERS-VL-C           TO WS-DTL-WERS-VEH-LINE-C   00172400
172500         MOVE VLN-WERS-BRAND-C (2:1)  TO WS-DTL-WERS-BRAND-C      00172500
172600         MOVE VLN-GEVIS-VL-N          TO WS-DTL-VLN-GEVIS-VL-N    00172600
172700     ELSE                                                         00172700
172800         MOVE VEH-GEVIS-VL-C          TO WS-DTL-GEVIS-VEH-LINE-C  00172800
172900         MOVE VWR-WERS-VL-C           TO WS-DTL-WERS-VEH-LINE-C   00172900
173000         MOVE SPACES                  TO WS-DTL-WERS-BRAND-C      00173000
173100         MOVE SPACES                  TO WS-DTL-VLN-GEVIS-VL-N    00173100
173200     END-IF                                                       00173200
173300     .                                                            00173300
173400                                                                  00173400
173500******************************************************************00173500
173600* PROCESS CATALOG CODE                                            00173600
173700*                                                                 00173700
173800* EVALUATE CATALOG CODE VEHICLE LINE.  THESE ARE HANDLED AS       00173800
173900* EXEPTIONS AS THEY CAN APPEAR MUTIPLE TIMES FOR                  00173900
174000* DIFFERENT GEVIS VEHICLE LINES.                                  00174000
174100*                                                                 00174100
174200******************************************************************00174200
174300 5104P-CATALOG-CODE-PROCESS.                                      00174300
174400                                                                  00174400
174500     MOVE CTG-VHL-VEH-LINE-C          TO PV-WERS-VL-C             00174500
174600                                                                  00174600
174700     IF  PV-VALID-VEH-LINE-CDS                                    00174700
174800         PERFORM 5114P-SELECT-MEXW034-GEVIS-VL                    00174800
174900         EVALUATE CTG-VHL-VEH-LINE-C                              00174900
175000             WHEN PL-KI                                           00175000
175100             WHEN PL-K5                                           00175100
175200                  MOVE PL-L5          TO VLN-GEVIS-VL-C           00175200
175300                  MOVE PL-AB          TO VLN-WERS-BRAND-C         00175300
175400                  SET MEXW034-FOUND   TO TRUE                     00175400
175500                                                                  00175500
175600             WHEN PL-DB                                           00175600
175700                  MOVE PL-DB          TO VLN-GEVIS-VL-C           00175700
175800                  MOVE PL-AB          TO VLN-WERS-BRAND-C         00175800
175900                  SET MEXW034-FOUND   TO TRUE                     00175900
176000                                                                  00176000
176100         END-EVALUATE                                             00176100
176200     ELSE                                                         00176200
176300          PERFORM 5114P-SELECT-MEXW034-GEVIS-VL                   00176300
176400                                                                  00176400
176500     END-IF                                                       00176500
176600                                                                  00176600
176700     IF MEXW034-FOUND                                             00176700
176800          MOVE VLN-GEVIS-VL-C         TO WS-DTL-GEVIS-VEH-LINE-C  00176800
176900          MOVE CTG-VHL-VEH-LINE-C     TO WS-DTL-WERS-VEH-LINE-C   00176900
177000          MOVE VLN-WERS-BRAND-C (2:1) TO WS-DTL-WERS-BRAND-C      00177000
177100          MOVE VLN-GEVIS-VL-N         TO WS-DTL-VLN-GEVIS-VL-N    00177100
177200     END-IF                                                       00177200
177300     .                                                            00177300
177400                                                                  00177400
177500******************************************************************00177500
177600* RETRIEVES THE WERS VEHICLE LINE DATA USING THE GEVIS VEHICLE    00177600
177700* LINE CODE AND PRODUCTION SOURCE.                                00177700
177800* NOTE: THIS ONLY APPLIES TO 'NA' AND 'EA' DATA SOURCES.          00177800
177900******************************************************************00177900
178000 5110P-SELECT-W034-DATA.                                          00178000
178100                                                                  00178100
178200     MOVE VEH-DTA-DATA-SRC-C          TO VLN-DTA-DATA-SRC-C       00178200
178300     MOVE VEH-GEVIS-VL-C              TO VLN-GEVIS-VL-C           00178300
178400     MOVE PL-Y                        TO VLN-ACTIVE-F             00178400
178500                                                                  00178500
178600     EXEC SQL                                                     00178600
178700         SELECT   VLN_WERS_VL_C                                   00178700
178800                 ,VLN_WERS_PRD_TP_C                               00178800
178900                 ,VLN_WERS_BRAND_C                                00178900
179000                 ,VLN_GEVIS_VL_N                                  00179000
179100           INTO  :VLN-WERS-VL-C                                   00179100
179200                ,:VLN-WERS-PRD-TP-C                               00179200
179300                ,:VLN-WERS-BRAND-C                                00179300
179400                ,:VLN-GEVIS-VL-N                                  00179400
179500           FROM  MEXW034_VL_BRAND                                 00179500
179600          WHERE  DTA_DATA_SRC_C    = :VLN-DTA-DATA-SRC-C          00179600
179700            AND  VLN_GEVIS_VL_C    = :VLN-GEVIS-VL-C              00179700
179800            AND  VLN_ACTIVE_F      = :VLN-ACTIVE-F                00179800
179900     END-EXEC                                                     00179900
180000                                                                  00180000
180100     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00180100
180200                                                                  00180200
180300     EVALUATE TRUE                                                00180300
180400         WHEN SC-DB2-SQLCODE-OK                                   00180400
180500              ADD +1                  TO PV-NBR-ROWS-READ-MEXW034 00180500
180600              SET MEXW034-FOUND       TO TRUE                     00180600
180700                                                                  00180700
180800         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00180800
180900              SET MEXW034-NOT-FOUND   TO TRUE                     00180900
181000                                                                  00181000
181100         WHEN OTHER                                               00181100
181200              MOVE SQLCODE            TO DB2-ABEND-SQLCODE        00181200
181300              MOVE "SELECT"           TO DB2-ABEND-FUNCTION       00181300
181400              MOVE PL-TBL-VL-BRAND    TO DB2-ABEND-TABLE          00181400
181500              MOVE DB2-ABEND-MSG      TO ABEND-MSG                00181500
181600              MOVE "5110P"            TO ABEND-PARAGRAPH          00181600
181700              PERFORM 9999P-ABEND                                 00181700
181800     END-EVALUATE                                                 00181800
181900     .                                                            00181900
182000                                                                  00182000
182100******************************************************************00182100
182200* BY USING THE DATA OBTAINED FROM TABLE MEXW001 IN THE WHERE      00182200
182300* CLAUSE, THE WERS VEHICLE LINE WILL NOW BE SELECTED.             00182300
182400* NOTE: THIS ONLY APPLIES TO NON 'NA' AND NON 'EA' DATA SOURCES.  00182400
182500******************************************************************00182500
182600 5112P-SELECT-MEXW032-WERS-VL.                                    00182600
182700     MOVE VEH-DTA-DATA-SRC-C          TO CTG-DTA-DATA-SRC-C       00182700
182800     MOVE VEH-CATALOG-C               TO CTG-LCL-CATALOG-C        00182800
182900                                                                  00182900
183000     EXEC SQL                                                     00183000
183100       SELECT  VHL_VEH_LINE_C                                     00183100
183200             , VPT_PROD_TYP_C                                     00183200
183300         INTO :CTG-VHL-VEH-LINE-C                                 00183300
183400             ,:CTG-VPT-PROD-TYP-C                                 00183400
183500         FROM  MEXW032_CATALOG                                    00183500
183600        WHERE DTA_DATA_SRC_C    =  :CTG-DTA-DATA-SRC-C            00183600
183700          AND CTG_LCL_CATALOG_C =  :CTG-LCL-CATALOG-C             00183700
183800     END-EXEC                                                     00183800
183900                                                                  00183900
184000     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00184000
184100                                                                  00184100
184200     EVALUATE TRUE                                                00184200
184300         WHEN SC-DB2-SQLCODE-OK                                   00184300
184400              ADD +1                  TO PV-NBR-ROWS-READ-MEXW032 00184400
184500              SET MEXW032-FOUND       TO TRUE                     00184500
184600                                                                  00184600
184700         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00184700
184800              SET MEXW032-NOT-FOUND   TO TRUE                     00184800
184900                                                                  00184900
185000         WHEN OTHER                                               00185000
185100              MOVE SQLCODE            TO DB2-ABEND-SQLCODE        00185100
185200              MOVE "SELECT"           TO DB2-ABEND-FUNCTION       00185200
185300              MOVE PL-TBL-CATALOG     TO DB2-ABEND-TABLE          00185300
185400              MOVE DB2-ABEND-MSG      TO ABEND-MSG                00185400
185500              MOVE "5112P"            TO ABEND-PARAGRAPH          00185500
185600              PERFORM 9999P-ABEND                                 00185600
185700     END-EVALUATE                                                 00185700
185800     .                                                            00185800
185900                                                                  00185900
186000******************************************************************00186000
186100* RETRIEVES THE GEVIS VEHICLE LINE DATA USING THE DATA SOURCE AND 00186100
186200* WERS VEHICLE LINE CODE.                                         00186200
186300* NOTE: THIS ONLY APPLIES TO NON 'NA' AND NON 'EA' DATA SOURCES.  00186300
186400******************************************************************00186400
186500 5114P-SELECT-MEXW034-GEVIS-VL.                                   00186500
186600     MOVE VEH-DTA-DATA-SRC-C          TO VLN-DTA-DATA-SRC-C       00186600
186700     MOVE CTG-VHL-VEH-LINE-C          TO VLN-WERS-VL-C            00186700
186800     MOVE CTG-VPT-PROD-TYP-C          TO VLN-WERS-PRD-TP-C        00186800
186900     MOVE PL-Y                        TO VLN-ACTIVE-F             00186900
187000                                                                  00187000
187100     EXEC SQL                                                     00187100
187200        SELECT  VLN_GEVIS_VL_C                                    00187200
187300               ,VLN_WERS_PRD_TP_C                                 00187300
187400               ,VLN_WERS_BRAND_C                                  00187400
187500               ,VLN_GEVIS_VL_N                                    00187500
187600          INTO :VLN-GEVIS-VL-C                                    00187600
187700              ,:VLN-WERS-PRD-TP-C                                 00187700
187800              ,:VLN-WERS-BRAND-C                                  00187800
187900              ,:VLN-GEVIS-VL-N                                    00187900
188000          FROM  MEXW034_VL_BRAND                                  00188000
188100         WHERE  DTA_DATA_SRC_C    = :VLN-DTA-DATA-SRC-C           00188100
188200           AND  VLN_WERS_VL_C     = :VLN-WERS-VL-C                00188200
188300           AND  VLN_ACTIVE_F      = :VLN-ACTIVE-F                 00188300
188400           AND  VLN_WERS_PRD_TP_C = :VLN-WERS-PRD-TP-C            00188400
188500     END-EXEC                                                     00188500
188600                                                                  00188600
188700     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00188700
188800                                                                  00188800
188900     EVALUATE TRUE                                                00188900
189000         WHEN SC-DB2-SQLCODE-OK                                   00189000
189100              ADD +1                  TO PV-NBR-ROWS-READ-MEXW034 00189100
189200              SET MEXW034-FOUND       TO TRUE                     00189200
189300                                                                  00189300
189400         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00189400
189500              SET MEXW034-NOT-FOUND   TO TRUE                     00189500
189600                                                                  00189600
189700         WHEN OTHER                                               00189700
189800              MOVE SQLCODE            TO DB2-ABEND-SQLCODE        00189800
189900              MOVE "SELECT"           TO DB2-ABEND-FUNCTION       00189900
190000              MOVE PL-TBL-VL-BRAND    TO DB2-ABEND-TABLE          00190000
190100              MOVE DB2-ABEND-MSG      TO ABEND-MSG                00190100
190200              MOVE "5114P"            TO ABEND-PARAGRAPH          00190200
190300              PERFORM 9999P-ABEND                                 00190300
190400     END-EVALUATE                                                 00190400
190500     .                                                            00190500
190600                                                                  00190600
190700******************************************************************00190700
190800* BY USING THE DATA OBTAINED FROM TABLE MEXW001 IN THE WHERE      00190800
190900* CLAUSE, THE WERS BODY TYPE WILL NOW BE OBTAINED.                00190900
191000******************************************************************00191000
191100 5115P-SELECT-MEXW033-DATA.                                       00191100
191200                                                                  00191200
191300     MOVE VEH-DTA-DATA-SRC-C          TO BDT-PROD-SRC-C           00191300
191400     MOVE VEH-BDT-MDL-YR-Y            TO BDT-START-YR-R           00191400
191500                                         BDT-END-YR-R             00191500
191600     MOVE VEH-LCL-BDYTYP-C            TO BDT-BDY-TYP-C            00191600
191700                                                                  00191700
191800     EXEC SQL                                                     00191800
191900                                                                  00191900
192000         SELECT  BDT_WERS_BDY_TYP_C                               00192000
192100           INTO :BDT-WERS-BDY-TYP-C                               00192100
192200           FROM  MEXW033_BODY_TYPE                                00192200
192300          WHERE  BDT_PROD_SRC_C  = :BDT-PROD-SRC-C                00192300
192400            AND  BDT_BDY_TYP_C   = :BDT-BDY-TYP-C                 00192400
192500            AND  BDT_START_YR_R <= :BDT-START-YR-R                00192500
192600            AND  BDT_END_YR_R   >= :BDT-END-YR-R                  00192600
192700     END-EXEC                                                     00192700
192800                                                                  00192800
192900     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00192900
193000     EVALUATE TRUE                                                00193000
193100         WHEN SC-DB2-SQLCODE-OK                                   00193100
193200              ADD +1                  TO PV-NBR-ROWS-READ-MEXW033 00193200
193300              SET MEXW033-FOUND       TO TRUE                     00193300
193400                                                                  00193400
193500         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00193500
193600              SET MEXW033-NOT-FOUND   TO TRUE                     00193600
193700                                                                  00193700
193800         WHEN OTHER                                               00193800
193900              MOVE SQLCODE            TO DB2-ABEND-SQLCODE        00193900
194000              MOVE "SELECT"           TO DB2-ABEND-FUNCTION       00194000
194100              MOVE PL-TBL-BODY-TYPE   TO DB2-ABEND-TABLE          00194100
194200              MOVE DB2-ABEND-MSG      TO ABEND-MSG                00194200
194300              MOVE "5115P"            TO ABEND-PARAGRAPH          00194300
194400              PERFORM 9999P-ABEND                                 00194400
194500     END-EVALUATE                                                 00194500
194600     .                                                            00194600
194700                                                                  00194700
194800******************************************************************00194800
194900* A ROW CONTAINING THE MOST RECENT 20T STATUS CODE WHICH CONSISTS 00194900
195000* OF THE DATE THAT THE VEHICLE WAS PRODUCED WILL BE RETRIEVED.    00195000
195100******************************************************************00195100
195200 5120P-OBTAIN-MEXW003-20T.                                        00195200
195300                                                                  00195300
195400     MOVE VEH-ORD-ID-C                  TO VST-VEH-ORD-ID-C       00195400
195500     MOVE VEH-DTA-DATA-SRC-C            TO VST-DTA-DATA-SRC-C     00195500
195600     MOVE PL-20T                        TO VST-STA-STATUS-C       00195600
195700     MOVE PL-Y                          TO VST-LAST-OCCUR-F       00195700
195800                                           VST-ACTIVE-F           00195800
195900                                                                  00195900
196000     EXEC SQL                                                     00196000
196100         SELECT  VST_STAT_Y                                       00196100
196200           INTO :VST-STAT-Y                                       00196200
196300           FROM  MEXW003_VEH_STATUS                               00196300
196400          WHERE  VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C            00196400
196500            AND  DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C          00196500
196600            AND  STA_STATUS_C      = :VST-STA-STATUS-C            00196600
196700            AND  VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F            00196700
196800            AND  VST_ACTIVE_F      = :VST-ACTIVE-F                00196800
196900     END-EXEC                                                     00196900
197000                                                                  00197000
197100     MOVE SQLCODE                       TO SC-DB2-SQLCODE         00197100
197200                                                                  00197200
197300     EVALUATE TRUE                                                00197300
197400         WHEN SC-DB2-SQLCODE-OK                                   00197400
197500              ADD +1                    TO                        00197500
197600              PV-NBR-ROWS-READ-MEXW003                            00197600
197700              SET MEXW003-FOUND-20T     TO TRUE                   00197700
197800                                                                  00197800
197900         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00197900
198000              SET MEXW003-NOT-FOUND-20T TO TRUE                   00198000
198100                                                                  00198100
198200         WHEN OTHER                                               00198200
198300              MOVE SQLCODE              TO DB2-ABEND-SQLCODE      00198300
198400              MOVE "SELECT"             TO DB2-ABEND-FUNCTION     00198400
198500              MOVE PL-TBL-VEH-STATUS    TO DB2-ABEND-TABLE        00198500
198600              MOVE DB2-ABEND-MSG        TO ABEND-MSG              00198600
198700              MOVE "5120P"              TO ABEND-PARAGRAPH        00198700
198800              PERFORM 9999P-ABEND                                 00198800
198900     END-EVALUATE                                                 00198900
199000     .                                                            00199000
199100                                                                  00199100
199200******************************************************************00199200
199300* RETRIEVES THE MOST RECENT 30R STATUS CODE WHICH CONSISTS OF THE 00199300
199400* DATE THAT THE VEHICLE WAS PRODUCED AND PASSED THE PLANT INSPEC- 00199400
199500* TION. IF NOT FOUND, THEN A 30P STATUS CODE WILL BE SELECTED.    00199500
199600* THE 30P CONSISTS OF THE DATE THAT THE VEHICLE WAS PRODUCED, BUT 00199600
199700* INSPECTION DID NOT OCCUR.                                       00199700
199800******************************************************************00199800
199900 5140P-OBTAIN-MEXW003-30R.                                        00199900
200000                                                                  00200000
200100     MOVE VEH-ORD-ID-C                  TO VST-VEH-ORD-ID-C       00200100
200200     MOVE VEH-DTA-DATA-SRC-C            TO VST-DTA-DATA-SRC-C     00200200
200300     MOVE PL-30R                        TO VST-STA-STATUS-C       00200300
200400     MOVE PL-Y                          TO VST-LAST-OCCUR-F       00200400
200500                                           VST-ACTIVE-F           00200500
200600                                                                  00200600
200700     EXEC SQL                                                     00200700
200800         SELECT  VST_STAT_Y                                       00200800
200900           INTO :VST-STAT-Y                                       00200900
201000           FROM  MEXW003_VEH_STATUS                               00201000
201100          WHERE  VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C            00201100
201200            AND  DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C          00201200
201300            AND  STA_STATUS_C      = :VST-STA-STATUS-C            00201300
201400            AND  VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F            00201400
201500            AND  VST_ACTIVE_F      = :VST-ACTIVE-F                00201500
201600     END-EXEC                                                     00201600
201700                                                                  00201700
201800     MOVE SQLCODE                       TO SC-DB2-SQLCODE         00201800
201900                                                                  00201900
202000     EVALUATE TRUE                                                00202000
202100         WHEN SC-DB2-SQLCODE-OK                                   00202100
202200              ADD +1                    TO                        00202200
202300              PV-NBR-ROWS-READ-MEXW003                            00202300
202400              SET MEXW003-FOUND-30R     TO TRUE                   00202400
202500                                                                  00202500
202600         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00202600
202700              SET MEXW003-NOT-FOUND-30R TO TRUE                   00202700
202800                                                                  00202800
202900         WHEN OTHER                                               00202900
203000              MOVE SQLCODE              TO DB2-ABEND-SQLCODE      00203000
203100              MOVE "SELECT"             TO DB2-ABEND-FUNCTION     00203100
203200              MOVE PL-TBL-VEH-STATUS    TO DB2-ABEND-TABLE        00203200
203300              MOVE DB2-ABEND-MSG        TO ABEND-MSG              00203300
203400              MOVE "5140P"              TO ABEND-PARAGRAPH        00203400
203500              PERFORM 9999P-ABEND                                 00203500
203600     END-EVALUATE                                                 00203600
203700     .                                                            00203700
203800                                                                  00203800
203900******************************************************************00203900
204000* RETRIEVES THE MOST RECENT 30P STATUS CODE WHICH CONSISTS OF THE 00204000
204100* DATE THAT THE VEHICLE WAS PRODUCED, BUT NOT INSPECTED.          00204100
204200******************************************************************00204200
204300 5160P-OBTAIN-MEXW003-30P.                                        00204300
204400                                                                  00204400
204500     MOVE VEH-ORD-ID-C                  TO VST-VEH-ORD-ID-C       00204500
204600     MOVE VEH-DTA-DATA-SRC-C            TO VST-DTA-DATA-SRC-C     00204600
204700     MOVE PL-30P                        TO VST-STA-STATUS-C       00204700
204800     MOVE PL-Y                          TO VST-LAST-OCCUR-F       00204800
204900                                           VST-ACTIVE-F           00204900
205000                                                                  00205000
205100     EXEC SQL                                                     00205100
205200         SELECT  VST_STAT_Y                                       00205200
205300           INTO :VST-STAT-Y                                       00205300
205400           FROM  MEXW003_VEH_STATUS                               00205400
205500          WHERE  VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C            00205500
205600            AND  DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C          00205600
205700            AND  STA_STATUS_C      = :VST-STA-STATUS-C            00205700
205800            AND  VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F            00205800
205900            AND  VST_ACTIVE_F      = :VST-ACTIVE-F                00205900
206000     END-EXEC                                                     00206000
206100                                                                  00206100
206200     MOVE SQLCODE                       TO SC-DB2-SQLCODE         00206200
206300                                                                  00206300
206400     EVALUATE TRUE                                                00206400
206500         WHEN SC-DB2-SQLCODE-OK                                   00206500
206600              ADD +1                    TO                        00206600
206700              PV-NBR-ROWS-READ-MEXW003                            00206700
206800              SET MEXW003-FOUND-30P     TO TRUE                   00206800
206900                                                                  00206900
207000         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00207000
207100              SET MEXW003-NOT-FOUND-30P TO TRUE                   00207100
207200                                                                  00207200
207300         WHEN OTHER                                               00207300
207400              MOVE SQLCODE              TO DB2-ABEND-SQLCODE      00207400
207500              MOVE "SELECT"             TO DB2-ABEND-FUNCTION     00207500
207600              MOVE PL-TBL-VEH-STATUS    TO DB2-ABEND-TABLE        00207600
207700              MOVE DB2-ABEND-MSG        TO ABEND-MSG              00207700
207800              MOVE "5160P"              TO ABEND-PARAGRAPH        00207800
207900              PERFORM 9999P-ABEND                                 00207900
208000     END-EVALUATE                                                 00208000
208100     .                                                            00208100
208200                                                                  00208200
208300******************************************************************00208300
208400* RETRIEVES THE MOST RECENT 30T STATUS CODE WHICH CONSISTS OF THE 00208400
208500* DATE THAT THE VEHICLE WAS RELEASED FROM THE ASSEMBLY PLANT.     00208500
208600******************************************************************00208600
208700 5180P-OBTAIN-MEXW003-30T.                                        00208700
208800                                                                  00208800
208900     MOVE VEH-ORD-ID-C                  TO VST-VEH-ORD-ID-C       00208900
209000     MOVE VEH-DTA-DATA-SRC-C            TO VST-DTA-DATA-SRC-C     00209000
209100     MOVE PL-30T                        TO VST-STA-STATUS-C       00209100
209200     MOVE PL-Y                          TO VST-LAST-OCCUR-F       00209200
209300                                           VST-ACTIVE-F           00209300
209400                                                                  00209400
209500     EXEC SQL                                                     00209500
209600         SELECT  VST_STAT_Y                                       00209600
209700           INTO :VST-STAT-Y                                       00209700
209800           FROM  MEXW003_VEH_STATUS                               00209800
209900          WHERE  VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C            00209900
210000            AND  DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C          00210000
210100            AND  STA_STATUS_C      = :VST-STA-STATUS-C            00210100
210200            AND  VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F            00210200
210300            AND  VST_ACTIVE_F      = :VST-ACTIVE-F                00210300
210400     END-EXEC                                                     00210400
210500                                                                  00210500
210600     MOVE SQLCODE                       TO SC-DB2-SQLCODE         00210600
210700                                                                  00210700
210800     EVALUATE TRUE                                                00210800
210900         WHEN SC-DB2-SQLCODE-OK                                   00210900
211000              ADD +1                    TO                        00211000
211100              PV-NBR-ROWS-READ-MEXW003                            00211100
211200              SET MEXW003-FOUND-30T     TO TRUE                   00211200
211300                                                                  00211300
211400         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00211400
211500              SET MEXW003-NOT-FOUND-30T TO TRUE                   00211500
211600                                                                  00211600
211700         WHEN OTHER                                               00211700
211800              MOVE SQLCODE              TO DB2-ABEND-SQLCODE      00211800
211900              MOVE "SELECT"             TO DB2-ABEND-FUNCTION     00211900
212000              MOVE PL-TBL-VEH-STATUS    TO DB2-ABEND-TABLE        00212000
212100              MOVE DB2-ABEND-MSG        TO ABEND-MSG              00212100
212200              MOVE "5180P"              TO ABEND-PARAGRAPH        00212200
212300              PERFORM 9999P-ABEND                                 00212300
212400     END-EVALUATE                                                 00212400
212500     .                                                            00212500
212600                                                                  00212600
212700******************************************************************00212700
212800* RETRIEVES THE MOST RECENT 80F STATUS CODE WHICH CONSISTS OF THE 00212800
212900* DATE THAT THE VEHICLE HAS ARRIVED AT THE FINAL DESTINATION.     00212900
213000******************************************************************00213000
213100 5200P-OBTAIN-MEXW003-80F.                                        00213100
213200     MOVE VEH-ORD-ID-C                  TO VST-VEH-ORD-ID-C       00213200
213300     MOVE VEH-DTA-DATA-SRC-C            TO VST-DTA-DATA-SRC-C     00213300
213400     MOVE PL-80F                        TO VST-STA-STATUS-C       00213400
213500     MOVE PL-Y                          TO VST-LAST-OCCUR-F       00213500
213600                                           VST-ACTIVE-F           00213600
213700                                                                  00213700
213800     EXEC SQL                                                     00213800
213900         SELECT  VST_STAT_Y                                       00213900
214000           INTO :VST-STAT-Y                                       00214000
214100           FROM  MEXW003_VEH_STATUS                               00214100
214200          WHERE  VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C            00214200
214300            AND  DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C          00214300
214400            AND  STA_STATUS_C      = :VST-STA-STATUS-C            00214400
214500            AND  VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F            00214500
214600            AND  VST_ACTIVE_F      = :VST-ACTIVE-F                00214600
214700     END-EXEC                                                     00214700
214800                                                                  00214800
214900     MOVE SQLCODE                       TO SC-DB2-SQLCODE         00214900
215000                                                                  00215000
215100     EVALUATE TRUE                                                00215100
215200         WHEN SC-DB2-SQLCODE-OK                                   00215200
215300              ADD +1                    TO                        00215300
215400              PV-NBR-ROWS-READ-MEXW003                            00215400
215500              SET MEXW003-FOUND-80F     TO TRUE                   00215500
215600                                                                  00215600
215700         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00215700
215800              SET MEXW003-NOT-FOUND-80F TO TRUE                   00215800
215900                                                                  00215900
216000         WHEN OTHER                                               00216000
216100              MOVE SQLCODE              TO DB2-ABEND-SQLCODE      00216100
216200              MOVE "SELECT"             TO DB2-ABEND-FUNCTION     00216200
216300              MOVE PL-TBL-VEH-STATUS    TO DB2-ABEND-TABLE        00216300
216400              MOVE DB2-ABEND-MSG        TO ABEND-MSG              00216400
216500              MOVE "5200P"              TO ABEND-PARAGRAPH        00216500
216600              PERFORM 9999P-ABEND                                 00216600
216700     END-EVALUATE                                                 00216700
216800     .                                                            00216800
216900                                                                  00216900
217000******************************************************************00217000
217100* AT THIS POINT, A CURSOR WILL BE CREATED USING TABLE MEXW003 TO  00217100
217200* SELECT ALL 40V STATUS CODES.  THE ROW WHICH IS THE OLDEST       00217200
217300* REPRESENTS THE ROW WITH THE ORIGINAL INVOICING DEALER.          00217300
217400* AN ORDER BY VST_STAT_Y WILL BE USED TO ACCOMPLISH THIS.         00217400
217500******************************************************************00217500
217600 5220P-OPEN-40V-CSR.                                              00217600
217700                                                                  00217700
217800     MOVE VEH-ORD-ID-C                TO VST-VEH-ORD-ID-C         00217800
217900     MOVE VEH-DTA-DATA-SRC-C          TO VST-DTA-DATA-SRC-C       00217900
218000     MOVE PL-40V                      TO VST-STA-STATUS-C         00218000
218100     MOVE PL-D                        TO VST-STAT-TYP-C           00218100
218200     MOVE PL-Y                        TO VST-ACTIVE-F             00218200
218210     MOVE PL-WD                       TO VST-CUR-DATA-SRC-C
218300                                                                  00218300
218400     EXEC SQL                                                     00218400
218500        OPEN MEXW003_40V_CSR                                      00218500
218600     END-EXEC                                                     00218600
218700                                                                  00218700
218800     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00218800
218900                                                                  00218900
219000     EVALUATE TRUE                                                00219000
219100         WHEN SC-DB2-SQLCODE-OK                                   00219100
219200              CONTINUE                                            00219200
219300                                                                  00219300
219400         WHEN OTHER                                               00219400
219500              MOVE SQLCODE            TO DB2-ABEND-SQLCODE        00219500
219600              MOVE "OPEN"             TO DB2-ABEND-FUNCTION       00219600
219700              MOVE PL-TBL-VEH-STATUS  TO DB2-ABEND-TABLE          00219700
219800              MOVE DB2-ABEND-MSG      TO ABEND-MSG                00219800
219900              MOVE "5220P"            TO ABEND-PARAGRAPH          00219900
220000              PERFORM 9999P-ABEND                                 00220000
220100     END-EVALUATE                                                 00220100
220200     .                                                            00220200
220300                                                                  00220300
220400******************************************************************00220400
220500* FETCHES A ROW FROM MEXW003_40V_CSR WHICH WILL RETRIEVE THE      00220500
220600* ORIGINAL INVOICING DEALER.                                      00220600
220700******************************************************************00220700
220800 5230P-FETCH-40V-ROW.                                             00220800
220900                                                                  00220900
221000     EXEC SQL                                                     00221000
221100        FETCH  MEXW003_40V_CSR                                    00221100
221200         INTO :VST-GBL-LOC-C                                      00221200
221300     END-EXEC                                                     00221300
221400                                                                  00221400
221500     MOVE SQLCODE                           TO SC-DB2-SQLCODE     00221500
221600                                                                  00221600
221700     EVALUATE TRUE                                                00221700
221800         WHEN SC-DB2-SQLCODE-OK                                   00221800
221900              ADD +1                        TO                    00221900
222000                  PV-NBR-ROWS-READ-MEXW003                        00222000
222100              SET MEXW003-40V-CSR-ROW-FOUND TO TRUE               00222100
222200                                                                  00222200
222300         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00222300
222400              SET MEXW003-40V-CSR-ROW-NOT-FOUND                   00222400
222500                                            TO TRUE               00222500
222600                                                                  00222600
222700         WHEN OTHER                                               00222700
222800              MOVE SQLCODE                  TO DB2-ABEND-SQLCODE  00222800
222900              MOVE "FETCH"                  TO DB2-ABEND-FUNCTION 00222900
223000              MOVE PL-TBL-VEH-STATUS        TO DB2-ABEND-TABLE    00223000
223100              MOVE DB2-ABEND-MSG            TO ABEND-MSG          00223100
223200              MOVE "5230P"                  TO ABEND-PARAGRAPH    00223200
223300              PERFORM 9999P-ABEND                                 00223300
223400     END-EVALUATE                                                 00223400
223500     .                                                            00223500
223600                                                                  00223600
223700******************************************************************00223700
223800* CLOSES THE MEXW003_40V_CSR WHICH WAS USED TO RETRIEVE THE ORIG- 00223800
223900* INAL INVOICING DEALER.                                          00223900
224000******************************************************************00224000
224100 5240P-CLOSE-40V-CSR.                                             00224100
224200                                                                  00224200
224300     EXEC SQL                                                     00224300
224400        CLOSE MEXW003_40V_CSR                                     00224400
224500     END-EXEC                                                     00224500
224600                                                                  00224600
224700     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00224700
224800                                                                  00224800
224900     EVALUATE TRUE                                                00224900
225000         WHEN SC-DB2-SQLCODE-OK                                   00225000
225100              CONTINUE                                            00225100
225200                                                                  00225200
225300         WHEN OTHER                                               00225300
225400              MOVE SQLCODE            TO DB2-ABEND-SQLCODE        00225400
225500              MOVE "CLOSE"            TO DB2-ABEND-FUNCTION       00225500
225600              MOVE PL-TBL-VEH-STATUS  TO DB2-ABEND-TABLE          00225600
225700              MOVE DB2-ABEND-MSG      TO ABEND-MSG                00225700
225800              MOVE "5240P"            TO ABEND-PARAGRAPH          00225800
225900              PERFORM 9999P-ABEND                                 00225900
226000     END-EVALUATE                                                 00226000
226100     .                                                            00226100
226200                                                                  00226200
226300******************************************************************00226300
226400* A CURSOR WILL BE CREATED USING TABLE MEXW031.  ALL NON 'NA' AND 00226400
226500* NON 'EA' SOURCES WILL SELECT FROM IT.  THE RETRIEVED VALUES     00226500
226600* WILL BE SENT IN PLACE OF THE LOCAL BODY STYLE CODE THAT WAS     00226600
226700* OBTAINED FROM TABLE MEXW001_VEH_ORDER.                          00226700
226800******************************************************************00226800
226900 5300P-OPEN-MEXW031-CSR.                                          00226900
227000                                                                  00227000
227100     MOVE VEH-DTA-DATA-SRC-C          TO CTM-DTA-DATA-SRC-C       00227100
227200     MOVE VEH-CATALOG-C               TO CTM-LCL-CATALOG-C        00227200
227300                                                                  00227300
227400     EXEC SQL                                                     00227400
227500        OPEN MEXW031_CSR                                          00227500
227600     END-EXEC                                                     00227600
227700                                                                  00227700
227800     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00227800
227900                                                                  00227900
228000     EVALUATE TRUE                                                00228000
228100         WHEN SC-DB2-SQLCODE-OK                                   00228100
228200              CONTINUE                                            00228200
228300                                                                  00228300
228400         WHEN OTHER                                               00228400
228500              MOVE SQLCODE            TO DB2-ABEND-SQLCODE        00228500
228600              MOVE "OPEN"             TO DB2-ABEND-FUNCTION       00228600
228700              MOVE PL-TBL-CATMAP      TO DB2-ABEND-TABLE          00228700
228800              MOVE DB2-ABEND-MSG      TO ABEND-MSG                00228800
228900              MOVE "5300P"            TO ABEND-PARAGRAPH          00228900
229000              PERFORM 9999P-ABEND                                 00229000
229100     END-EVALUATE                                                 00229100
229200     .                                                            00229200
229300                                                                  00229300
229400******************************************************************00229400
229500* FETCHES A ROW FROM MEXW031_CSR WHICH WILL RETRIEVE OPTION CODE  00229500
229600* AND PRODUCT TYPE WHICH WILL BE COMBINED AND THEN USED TO POP-   00229600
229700* ULATE THE WERS BODY STYLE CODE FOR NON 'NA' AND NON 'EA' DATA   00229700
229800* SOURCES.                                                        00229800
229900******************************************************************00229900
230000 5320P-FETCH-MEXW031-CSR.                                         00230000
230100                                                                  00230100
230200     EXEC SQL                                                     00230200
230300        FETCH  MEXW031_CSR                                        00230300
230400         INTO :CTM-OPT-OPTION-C                                   00230400
230500             ,:CTM-VPT-PROD-TYP-C                                 00230500
230600     END-EXEC                                                     00230600
230700                                                                  00230700
230800     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00230800
230900                                                                  00230900
231000     EVALUATE TRUE                                                00231000
231100         WHEN SC-DB2-SQLCODE-OK                                   00231100
231200              ADD +1                  TO PV-NBR-ROWS-READ-MEXW031 00231200
231300              SET MEXW031-FOUND       TO TRUE                     00231300
231400                                                                  00231400
231500         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00231500
231600              SET MEXW031-NOT-FOUND   TO TRUE                     00231600
231700                                                                  00231700
231800         WHEN OTHER                                               00231800
231900              MOVE SQLCODE            TO DB2-ABEND-SQLCODE        00231900
232000              MOVE "FETCH"            TO DB2-ABEND-FUNCTION       00232000
232100              MOVE PL-TBL-CATMAP      TO DB2-ABEND-TABLE          00232100
232200              MOVE DB2-ABEND-MSG      TO ABEND-MSG                00232200
232300              MOVE "5320P"            TO ABEND-PARAGRAPH          00232300
232400              PERFORM 9999P-ABEND                                 00232400
232500     END-EVALUATE                                                 00232500
232600     .                                                            00232600
232700                                                                  00232700
232800******************************************************************00232800
232900* CLOSES CURSOR MEXW031_CSE WHICH RETRIEVED THE OPTION CODE AND   00232900
233000* PRODUCT TYPE FOR NON 'NA' AND NON 'EA' DATA SOURCES.            00233000
233100******************************************************************00233100
233200 5340P-CLOSE-MEXW031-CSR.                                         00233200
233300                                                                  00233300
233400     EXEC SQL                                                     00233400
233500        CLOSE MEXW031_CSR                                         00233500
233600     END-EXEC                                                     00233600
233700                                                                  00233700
233800     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00233800
233900                                                                  00233900
234000     EVALUATE TRUE                                                00234000
234100         WHEN SC-DB2-SQLCODE-OK                                   00234100
234200              CONTINUE                                            00234200
234300                                                                  00234300
234400         WHEN OTHER                                               00234400
234500              MOVE SQLCODE            TO DB2-ABEND-SQLCODE        00234500
234600              MOVE "CLOSE"            TO DB2-ABEND-FUNCTION       00234600
234700              MOVE PL-TBL-CATMAP      TO DB2-ABEND-TABLE          00234700
234800              MOVE DB2-ABEND-MSG      TO ABEND-MSG                00234800
234900              MOVE "5340P"            TO ABEND-PARAGRAPH          00234900
235000              PERFORM 9999P-ABEND                                 00235000
235100     END-EVALUATE                                                 00235100
235200     .                                                            00235200
235300                                                                  00235300
235400******************************************************************00235400
235500* THIS PARAGRAPH WILL WRITE ALL THE AUDIT INFORMATION OUT TO THE  00235500
235600* AUDIT REPORT.                                                   00235600
235700******************************************************************00235700
235800 6020P-WRITE-AUDIT-DETAIL.                                        00235800
235900                                                                  00235900
236000     MOVE SPACES                          TO AUDIT-RECORD         00236000
236100     WRITE AUDIT-RECORD                                           00236100
236200                                                                  00236200
236300     MOVE ALL "="                         TO AUDIT-RECORD         00236300
236400     WRITE AUDIT-RECORD                                           00236400
236500                                                                  00236500
236600     MOVE SPACES                          TO AUDIT-RECORD         00236600
236700     WRITE AUDIT-RECORD                                           00236700
236800                                                                  00236800
236900     MOVE "TTL ROWS READ FROM SALE-CHK:"  TO AUDIT-LABEL          00236900
237000     MOVE PV-NBR-ROWS-READ-SALE-CHK       TO AUDIT-DATA           00237000
237100     WRITE AUDIT-RECORD                                           00237100
237200                                                                  00237200
237300     MOVE "TTL ROWS READ FROM MEXW003 :"  TO AUDIT-LABEL          00237300
237400     MOVE PV-NBR-ROWS-READ-MEXW003        TO AUDIT-DATA           00237400
237500     WRITE AUDIT-RECORD                                           00237500
237600                                                                  00237600
237700     MOVE "TTL ROWS READ FROM MEXW004 :"  TO AUDIT-LABEL          00237700
237800     MOVE PV-NBR-ROWS-READ-MEXW004        TO AUDIT-DATA           00237800
237900     WRITE AUDIT-RECORD                                           00237900
238000                                                                  00238000
238100     MOVE "TTL ROWS READ FROM MEXW007 :"  TO AUDIT-LABEL          00238100
238200     MOVE PV-NBR-ROWS-READ-MEXW007        TO AUDIT-DATA           00238200
238300     WRITE AUDIT-RECORD                                           00238300
238400                                                                  00238400
238500     MOVE "TTL ROWS READ FROM MEXW008 :"  TO AUDIT-LABEL          00238500
238600     MOVE PV-NBR-ROWS-READ-MEXW008        TO AUDIT-DATA           00238600
238700     WRITE AUDIT-RECORD                                           00238700
238800                                                                  00238800
238900     MOVE "TTL ROWS READ FROM MEXW027 :"  TO AUDIT-LABEL          00238900
239000     MOVE PV-NBR-ROWS-READ-MEXW027        TO AUDIT-DATA           00239000
239100     WRITE AUDIT-RECORD                                           00239100
239200                                                                  00239200
239300     MOVE "TTL ROWS READ FROM MEXW031 :"  TO AUDIT-LABEL          00239300
239400     MOVE PV-NBR-ROWS-READ-MEXW031        TO AUDIT-DATA           00239400
239500     WRITE AUDIT-RECORD                                           00239500
239600                                                                  00239600
239700     MOVE "TTL ROWS READ FROM MEXW032 :"  TO AUDIT-LABEL          00239700
239800     MOVE PV-NBR-ROWS-READ-MEXW032        TO AUDIT-DATA           00239800
239900     WRITE AUDIT-RECORD                                           00239900
240000                                                                  00240000
240100     MOVE "TTL ROWS READ FROM MEXW033 :"  TO AUDIT-LABEL          00240100
240200     MOVE PV-NBR-ROWS-READ-MEXW033        TO AUDIT-DATA           00240200
240300     WRITE AUDIT-RECORD                                           00240300
240400                                                                  00240400
240500     MOVE "TTL ROWS READ FROM MEXW034 :"  TO AUDIT-LABEL          00240500
240600     MOVE PV-NBR-ROWS-READ-MEXW034        TO AUDIT-DATA           00240600
240700     WRITE AUDIT-RECORD                                           00240700
240800                                                                  00240800
240900     MOVE "TTL ROWS READ FROM MEXW035 :"  TO AUDIT-LABEL          00240900
241000     MOVE PV-NBR-ROWS-READ-MEXW035        TO AUDIT-DATA           00241000
241100     WRITE AUDIT-RECORD                                           00241100
241200                                                                  00241200
241300     MOVE "TTL SYSPARM RECORDS READ   :"  TO AUDIT-LABEL          00241300
241400     MOVE PV-NBR-SYSPARM-RECS-READ        TO AUDIT-DATA           00241400
241500     WRITE AUDIT-RECORD                                           00241500
241600                                                                  00241600
241700     MOVE "TTL SUBROUTINE SSTK CALLS  :"  TO AUDIT-LABEL          00241700
241800     MOVE PV-NBR-EXWWSSTK-CALLS           TO AUDIT-DATA           00241800
241900     WRITE AUDIT-RECORD                                           00241900
242000                                                                  00242000
242100     MOVE "TTL SSTK CALLS WITH +100   :"  TO AUDIT-LABEL          00242100
242200     MOVE PV-NBR-EXWWSSTK-NOTFOUND-CALLS  TO AUDIT-DATA           00242200
242300     WRITE AUDIT-RECORD                                           00242300
242400                                                                  00242400
242500     MOVE "TTL MEXW027 ROWS NOT FOUND :"  TO AUDIT-LABEL          00242500
242600     MOVE PV-NBR-MEXW027-NOTFOUND-CALLS   TO AUDIT-DATA           00242600
242700     WRITE AUDIT-RECORD                                           00242700
242800                                                                  00242800
242900     MOVE "TTL MEXW035 ROWS NOT FOUND :"  TO AUDIT-LABEL          00242900
243000     MOVE PV-NBR-MEXW035-NOTFOUND-CALLS   TO AUDIT-DATA           00243000
243100     WRITE AUDIT-RECORD                                           00243100
243200                                                                  00243200
243300     MOVE "TTL OUTPUT RECORDS WRITTEN :"  TO AUDIT-LABEL          00243300
243400     MOVE PV-NBR-OUTPUT-RECS-WRTN         TO AUDIT-DATA           00243400
243500     WRITE AUDIT-RECORD                                           00243500
243600     .                                                            00243600
243700                                                                  00243700
243800******************************************************************00243800
243900* OBTAINS THE CURRENT DEARBORN TIMESTAMP, THIS WILL BE USED TO    00243900
244000* UPDATE MEXW016 FOR THE START TIME OF THE JOB.                   00244000
244100******************************************************************00244100
244200 7000P-OBTAIN-DRBN-TIMESTAMP.                                     00244200
244300                                                                  00244300
244400     EXEC SQL                                                     00244400
244500        SET  :PV-CURR-DRBN-TIMESTAMP  = CURRENT TIMESTAMP         00244500
244600     END-EXEC                                                     00244600
244700                                                                  00244700
244800     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00244800
244900                                                                  00244900
245000     EVALUATE TRUE                                                00245000
245100         WHEN SC-DB2-SQLCODE-OK                                   00245100
245200              CONTINUE                                            00245200
245300                                                                  00245300
245400         WHEN OTHER                                               00245400
245500              MOVE SQLCODE            TO DB2-ABEND-SQLCODE        00245500
245600              MOVE "SELECT"           TO DB2-ABEND-FUNCTION       00245600
245700              MOVE PL-TBL-GENERIC     TO DB2-ABEND-TABLE          00245700
245800              MOVE DB2-ABEND-MSG      TO ABEND-MSG                00245800
245900              MOVE "7000P"            TO ABEND-PARAGRAPH          00245900
246000              PERFORM 9999P-ABEND                                 00246000
246100     END-EVALUATE                                                 00246100
246200     .                                                            00246200
246300                                                                  00246300
246400******************************************************************00246400
246500* SELECT THE PREVIOUS RUNS TIMESTAMP ON THE MEXS016 TABLE         00246500
246600******************************************************************00246600
246700 7200P-SELECT-PRV-RUN-TIMESTAMP.                                  00246700
246800     MOVE PL-SYSTEM-ID                TO GNT-SYSTEM-CD            00246800
246900     MOVE PL-TABLE-ID                 TO GNT-TABLE-ID             00246900
247000     MOVE PL-KEY-DATA-TIMESTAMP       TO GNT-KEY-DATA             00247000
247100     MOVE PL-Y                        TO GNT-SW-ACTIVE            00247100
247200                                                                  00247200
247300     EXEC SQL                                                     00247300
247400         SELECT GNT_ATTRIBUTE_DATA                                00247400
247500         INTO  :GNT-ATTRIBUTE-DATA                                00247500
247600         FROM   MEXS016_GENERIC2                                  00247600
247700         WHERE  GNT_SYSTEM_CD    = :GNT-SYSTEM-CD                 00247700
247800         AND    GNT_TABLE_ID     = :GNT-TABLE-ID                  00247800
247900         AND    GNT_KEY_DATA     = :GNT-KEY-DATA                  00247900
248000         AND    GNT_SW_ACTIVE LIKE :GNT-SW-ACTIVE                 00248000
248100     END-EXEC                                                     00248100
248200                                                                  00248200
248300     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00248300
248400                                                                  00248400
248500     EVALUATE TRUE                                                00248500
248600         WHEN SC-DB2-SQLCODE-OK                                   00248600
248700              CONTINUE                                            00248700
248800                                                                  00248800
248900         WHEN OTHER                                               00248900
249000              MOVE SQLCODE            TO DB2-ABEND-SQLCODE        00249000
249100              MOVE "SELECT"           TO DB2-ABEND-FUNCTION       00249100
249200              MOVE "MEXS016_GENERIC2" TO DB2-ABEND-TABLE          00249200
249300              MOVE DB2-ABEND-MSG      TO ABEND-MSG                00249300
249400              MOVE "7200P"            TO ABEND-PARAGRAPH          00249400
249500              PERFORM 9999P-ABEND                                 00249500
249600     END-EVALUATE                                                 00249600
249700     .                                                            00249700
249800                                                                  00249800
249900******************************************************************00249900
250000* UPDATE THE TIMESTAMP ON THE MEXS016 TABLE WITH THE TIME THAT    00250000
250100* THE JOB STARTED.  THIS VALUE WILL BE READ IN THE NEXT TIME THIS 00250100
250200* PROGRAM IS EXECUTED.                                            00250200
250300******************************************************************00250300
250400 7250P-UPDATE-TIMESTAMP.                                          00250400
250500                                                                  00250500
250600      MOVE PL-SYSTEM-ID               TO GNT-SYSTEM-CD            00250600
250700      MOVE PL-TABLE-ID                TO GNT-TABLE-ID             00250700
250800      MOVE PL-KEY-DATA-TIMESTAMP      TO GNT-KEY-DATA             00250800
250900      MOVE PV-CURR-DRBN-TIMESTAMP     TO GNT-ATTRIBUTE-DATA       00250900
251000                                                                  00251000
251100      EXEC SQL                                                    00251100
251200          UPDATE MEXS016_GENERIC2                                 00251200
251300          SET    GNT_ATTRIBUTE_DATA = :GNT-ATTRIBUTE-DATA         00251300
251400          WHERE  GNT_SYSTEM_CD      = :GNT-SYSTEM-CD              00251400
251500          AND    GNT_TABLE_ID       = :GNT-TABLE-ID               00251500
251600          AND    GNT_KEY_DATA       = :GNT-KEY-DATA               00251600
251700      END-EXEC                                                    00251700
251800                                                                  00251800
251900      MOVE SQLCODE                    TO SC-DB2-SQLCODE           00251900
252000                                                                  00252000
252100      IF  NOT SC-DB2-SQLCODE-OK                                   00252100
252200          MOVE SQLCODE                TO DB2-ABEND-SQLCODE        00252200
252300          MOVE "UPDATE"               TO DB2-ABEND-FUNCTION       00252300
252400          MOVE "MEXS016_GENERIC2"     TO DB2-ABEND-TABLE          00252400
252500          MOVE DB2-ABEND-MSG          TO ABEND-MSG                00252500
252600          MOVE "7250P"                TO ABEND-PARAGRAPH          00252600
252700          PERFORM 9999P-ABEND                                     00252700
252800      END-IF                                                      00252800
252900     .                                                            00252900
253000                                                                  00253000
253100******************************************************************00253100
253200* SELECT THE PREVIOUS RUN'S OUTPUT FILE BATCH NUMBER.             00253200
253300******************************************************************00253300
253400 7300P-GET-BATCH-NBR.                                             00253400
253500                                                                  00253500
253600     MOVE PL-SYSTEM-ID                TO GNT-SYSTEM-CD            00253600
253700     MOVE PL-TABLE-ID                 TO GNT-TABLE-ID             00253700
253800     MOVE PL-KEY-DATA-BATCHCTL        TO GNT-KEY-DATA             00253800
253900     MOVE PL-Y                        TO GNT-SW-ACTIVE            00253900
254000                                                                  00254000
254100     EXEC SQL                                                     00254100
254200         SELECT GNT_ATTRIBUTE_DATA                                00254200
254300         INTO  :GNT-ATTRIBUTE-DATA                                00254300
254400         FROM   MEXS016_GENERIC2                                  00254400
254500         WHERE  GNT_SYSTEM_CD    = :GNT-SYSTEM-CD                 00254500
254600         AND    GNT_TABLE_ID     = :GNT-TABLE-ID                  00254600
254700         AND    GNT_KEY_DATA     = :GNT-KEY-DATA                  00254700
254800         AND    GNT_SW_ACTIVE LIKE :GNT-SW-ACTIVE                 00254800
254900     END-EXEC                                                     00254900
255000                                                                  00255000
255100     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00255100
255200                                                                  00255200
255300     EVALUATE TRUE                                                00255300
255400         WHEN SC-DB2-SQLCODE-OK                                   00255400
255500              CONTINUE                                            00255500
255600                                                                  00255600
255700         WHEN OTHER                                               00255700
255800              MOVE SQLCODE            TO DB2-ABEND-SQLCODE        00255800
255900              MOVE "SELECT"           TO DB2-ABEND-FUNCTION       00255900
256000              MOVE "MEXS016_GENERIC2" TO DB2-ABEND-TABLE          00256000
256100              MOVE DB2-ABEND-MSG      TO ABEND-MSG                00256100
256200              MOVE "7300P"            TO ABEND-PARAGRAPH          00256200
256300              PERFORM 9999P-ABEND                                 00256300
256400     END-EVALUATE                                                 00256400
256500     .                                                            00256500
256600                                                                  00256600
256700******************************************************************00256700
256800* UPDATE THE OUTPUT FILE'S BATCH NUMBER BY +1.                    00256800
256900******************************************************************00256900
257000 7350P-UPDATE-BATCH-NBR.                                          00257000
257100                                                                  00257100
257200     MOVE PL-SYSTEM-ID                TO GNT-SYSTEM-CD            00257200
257300     MOVE PL-TABLE-ID                 TO GNT-TABLE-ID             00257300
257400     MOVE PL-KEY-DATA-BATCHCTL        TO GNT-KEY-DATA             00257400
257500     MOVE PV-CURRENT-BATCH-NBR        TO GNT-ATTRIBUTE-DATA       00257500
257600                                                                  00257600
257700      EXEC SQL                                                    00257700
257800          UPDATE MEXS016_GENERIC2                                 00257800
257900          SET    GNT_ATTRIBUTE_DATA = :GNT-ATTRIBUTE-DATA         00257900
258000          WHERE  GNT_SYSTEM_CD      = :GNT-SYSTEM-CD              00258000
258100          AND    GNT_TABLE_ID       = :GNT-TABLE-ID               00258100
258200          AND    GNT_KEY_DATA       = :GNT-KEY-DATA               00258200
258300      END-EXEC                                                    00258300
258400                                                                  00258400
258500      MOVE SQLCODE                    TO SC-DB2-SQLCODE           00258500
258600                                                                  00258600
258700      IF  NOT SC-DB2-SQLCODE-OK                                   00258700
258800          MOVE SQLCODE                TO DB2-ABEND-SQLCODE        00258800
258900          MOVE "UPDATE"               TO DB2-ABEND-FUNCTION       00258900
259000          MOVE "MEXS016_GENERIC2"     TO DB2-ABEND-TABLE          00259000
259100          MOVE DB2-ABEND-MSG          TO ABEND-MSG                00259100
259200          MOVE "7350P"                TO ABEND-PARAGRAPH          00259200
259300          PERFORM 9999P-ABEND                                     00259300
259400      END-IF                                                      00259400
259500     .                                                            00259500
259600                                                                  00259600
259700******************************************************************00259700
259800* POPULATES THE HUB HEADER TO THE OUTPUT FILE.                    00259800
259900******************************************************************00259900
260000 7400P-POPULATE-HUB-HEADER.                                       00260000
260100                                                                  00260100
260200     MOVE PL-LAYOUT-ID                TO HUB-HDR-LAYOUT-ID        00260200
260300     MOVE PL-ENTITY-CD                TO HUB-HDR-ENTITY-CODE      00260300
260400     MOVE PL-LAYOUT-ID                TO HUB-HDR-LAYOUT-ID        00260400
260500     MOVE PV-CURR-DRBN-TIMESTAMP      TO HUB-HDR-TIMESTAMP        00260500
260600     MOVE PV-CURRENT-BATCH-NBR        TO HUB-HDR-BATCH-NBR        00260600
260700     MOVE PL-PROCESS-ID               TO HUB-HDR-PROCESS-ID       00260700
260800     MOVE ZERO                        TO HUB-HDR-TOTAL-REC-CNT    00260800
260900     MOVE SPACES                      TO HUB-HDR-PRIMARY-CONTACT  00260900
261000                                         HUB-HDR-SECOND-CONTACT   00261000
261100     MOVE HUB-HEADER                  TO MKT-ASSOC-RECORD         00261100
261200                                                                  00261200
261300     WRITE MKT-ASSOC-RECORD                                       00261300
261400      .                                                           00261400
261500                                                                  00261500
261600******************************************************************00261600
261700* POPULATES THE HUB TRAILER IN THE OUTPUT FILE.                   00261700
261800******************************************************************00261800
261900 7450P-POPULATE-HUB-TRAILER.                                      00261900
262000                                                                  00262000
262100     MOVE PL-ENTITY-CD                TO HUB-TRL-ENTITY-CODE      00262100
262200     MOVE PL-LAYOUT-ID                TO HUB-TRL-LAYOUT-ID        00262200
262300     MOVE PV-CURR-DRBN-TIMESTAMP      TO HUB-TRL-TIMESTAMP        00262300
262400     MOVE PV-CURRENT-BATCH-NBR        TO HUB-TRL-BATCH-NBR        00262400
262500     MOVE PL-PROCESS-ID               TO HUB-TRL-PROCESS-ID       00262500
262600     MOVE PV-COUNT-DTL-NBR            TO HUB-TRL-TOTAL-REC-CNT    00262600
262700     MOVE SPACES                      TO HUB-TRL-PRIMARY-CONTACT  00262700
262800                                         HUB-TRL-SECOND-CONTACT   00262800
262900     MOVE HUB-TRAILER                 TO MKT-ASSOC-RECORD         00262900
263000                                                                  00263000
263100     WRITE MKT-ASSOC-RECORD                                       00263100
263200      .                                                           00263200
263300                                                                  00263300
263400******************************************************************00263400
263500* SELECTS WERS STRING FROM MEXW004_VEH_WERS_STRING DB2 TABLE      00263500
263600******************************************************************00263600
263700 7600P-SELECT-WERS-DATA-W004.                                     00263700
263800                                                                  00263800
263900     EXEC SQL                                                     00263900
264000         SELECT  VWR_WERS_STRING_X                                00264000
264100                ,VWR_WERS_VL_C                                    00264100
264200                ,VWR_WERS_PRD_TP_C                                00264200
264300                ,VWR_MAJ_FEAT_DFNED_F                             00264300
264400           INTO :VWR-WERS-STRING-X                                00264400
264500               ,:VWR-WERS-VL-C                                    00264500
264600               ,:VWR-WERS-PRD-TP-C                                00264600
264700               ,:VWR-MAJ-FEAT-DFNED-F                             00264700
264800           FROM  MEXW004_VEH_WERS_STRING                          00264800
264900          WHERE  VEH_ORD_ID_C     =  :VWR-VEH-ORD-ID-C            00264900
265000            AND  DTA_DATA_SRC_C   =  :VWR-DTA-DATA-SRC-C          00265000
265100     END-EXEC                                                     00265100
265200                                                                  00265200
265300     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00265300
265400                                                                  00265400
265500     EVALUATE TRUE                                                00265500
265600         WHEN SC-DB2-SQLCODE-OK                                   00265600
265700              IF VWR-WERS-STRING-X-TEXT    > SPACES  AND          00265700
265800                 VWR-MAJ-FEAT-DFNED-F      = PL-Y                 00265800
265900                 SET WERS-STRING-FOUND-SW  TO TRUE                00265900
266000                 ADD +1                    TO                     00266000
266100                                         PV-NBR-ROWS-READ-MEXW004 00266100
266200              END-IF                                              00266200
266300                                                                  00266300
266400         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00266400
266500              SET WERS-STRING-NOT-FOUND-SW TO TRUE                00266500
266600                                                                  00266600
266700         WHEN OTHER                                               00266700
266800              PERFORM 7620P-WRITE-MEXW004-AUDIT-RPT               00266800
266900              MOVE SC-DB2-SQLCODE          TO DB2-ABEND-SQLCODE   00266900
267000              MOVE "SELECT"                TO DB2-ABEND-FUNCTION  00267000
267100              MOVE PL-TBL-MEXW004          TO DB2-ABEND-TABLE     00267100
267200              MOVE DB2-ABEND-MSG           TO ABEND-MSG           00267200
267300              MOVE "7600P"                 TO ABEND-PARAGRAPH     00267300
267400                                                                  00267400
267500              PERFORM 9999P-ABEND                                 00267500
267600                                                                  00267600
267700     END-EVALUATE                                                 00267700
267800     .                                                            00267800
267900                                                                  00267900
268000/*****************************************************************00268000
268100* WRITE AUDIT REPORT FOR MEXW004_VEH_WERS_STRING TABLE           *00268100
268200******************************************************************00268200
268300 7620P-WRITE-MEXW004-AUDIT-RPT.                                   00268300
268400                                                                  00268400
268500     MOVE SPACES                     TO AUDIT-RECORD              00268500
268600                                                                  00268600
268700     MOVE " VWR-VEH-ORD-ID-C: "      TO AUDIT-LABEL               00268700
268800     MOVE VWR-VEH-ORD-ID-C           TO AUDIT-DATA                00268800
268900                                                                  00268900
269000     WRITE AUDIT-RECORD                                           00269000
269100     MOVE SPACES                     TO AUDIT-RECORD              00269100
269200                                                                  00269200
269300     MOVE " VWR-DTA-DATA-SRC-C: "    TO AUDIT-LABEL               00269300
269400     MOVE VWR-DTA-DATA-SRC-C         TO AUDIT-DATA                00269400
269500                                                                  00269500
269600     WRITE AUDIT-RECORD                                           00269600
269700     MOVE SPACES                     TO AUDIT-RECORD              00269700
269800     .                                                            00269800
269900                                                                  00269900
270000******************************************************************00270000
270100* READS THE INPUT SYSPARM FILE TO OBTAIN THE PRODUCTION SOURCE.   00270100
270200******************************************************************00270200
270300 8000P-GET-SYSPARM-RECORD.                                        00270300
270400                                                                  00270400
270500     READ SYSPARM-FILE                                            00270500
270600     INTO WS-SYSPARM-DETAIL                                       00270600
270700       AT END SET END-OF-SYSPARM-FILE TO TRUE                     00270700
270800     END-READ                                                     00270800
270900                                                                  00270900
271000     EVALUATE TRUE                                                00271000
271100         WHEN END-OF-SYSPARM-FILE                                 00271100
271200          AND PV-NBR-SYSPARM-RECS-READ = ZERO                     00271200
271300              MOVE "MISSING SYSPARM"  TO ABEND-MSG                00271300
271400              MOVE "8000P"            TO ABEND-MSG-2              00271400
271500              PERFORM 9999P-ABEND                                 00271500
271600                                                                  00271600
271700         WHEN END-OF-SYSPARM-FILE                                 00271700
271800              CONTINUE                                            00271800
271900                                                                  00271900
272000         WHEN OTHER                                               00272000
272100              ADD +1                  TO PV-NBR-SYSPARM-RECS-READ 00272100
272200     END-EVALUATE                                                 00272200
272300     .                                                            00272300
272400                                                                  00272400
272500******************************************************************00272500
272600* IF A CALL TO TABLE MEXW035 RESULTED IN A SQL +100 (NOT FOUND)   00272600
272700* CONDITION, THE INFORMATION WILL BE WRITTEN OUT TO THE AUDIT     00272700
272800* REPORT AND RETURN-CODE WILL BE SET TO 3, SO THAT AN EMAIL       00272800
272900* MESSAGE WILL BE SENT TO THE GEVIS HELPDESK TO INFORM THEM TO    00272900
273000* LOOK AT THE AUDIT REPORT.                                       00273000
273100******************************************************************00273100
273200 9000P-MISSING-MEXW035-ROW.                                       00273200
273300                                                                  00273300
273400     MOVE SPACES                         TO AUDIT-RECORD          00273400
273500     WRITE AUDIT-RECORD                                           00273500
273600                                                                  00273600
273700     MOVE "MISSING DEALER ON MEXW035:  " TO AUDIT-LABEL           00273700
273800     WRITE AUDIT-RECORD                                           00273800
273900                                                                  00273900
274000     MOVE "DEALER CODE:         "        TO AUDIT-LABEL           00274000
274100     MOVE DLR-DLR-DLR-C                  TO AUDIT-DATA            00274100
274200     WRITE AUDIT-RECORD                                           00274200
274300                                                                  00274300
274400     MOVE "ASSOCIATED VIN:      "        TO AUDIT-LABEL           00274400
274500     MOVE VEH-VIN-FULL-C                 TO AUDIT-DATA            00274500
274600     WRITE AUDIT-RECORD                                           00274600
274700                                                                  00274700
274800     ADD +1 TO PV-NBR-MEXW035-NOTFOUND-CALLS                      00274800
274900     .                                                            00274900
275000                                                                  00275000
275100******************************************************************00275100
275200* IF A CALL TO TABLE MEXW027 RESULTED IN A SQL +100 (NOT FOUND)   00275200
275300* CONDITION, THE INFORMATION WILL BE WRITTEN OUT TO THE AUDIT     00275300
275400* REPORT AND RETURN-CODE WILL BE SET TO 3, SO THAT AN EMAIL       00275400
275500* MESSAGE WILL BE SENT TO THE GEVIS HELPDESK TO INFORM THEM TO    00275500
275600* LOOK AT THE AUDIT REPORT.                                       00275600
275700******************************************************************00275700
275800 9050P-MISSING-MEXW027-ROW.                                       00275800
275900                                                                  00275900
276000     MOVE SPACES                         TO AUDIT-RECORD          00276000
276100     WRITE AUDIT-RECORD                                           00276100
276200                                                                  00276200
276300     MOVE "MISSING STATUS ON MEXW027: "  TO AUDIT-LABEL           00276300
276400     MOVE PL-SPACES                      TO AUDIT-DATA            00276400
276500     WRITE AUDIT-RECORD                                           00276500
276600                                                                  00276600
276700     MOVE "STATUS CODE:         "        TO AUDIT-LABEL           00276700
276800     MOVE CNT-GBL-DATA-X                 TO AUDIT-DATA            00276800
276900     WRITE AUDIT-RECORD                                           00276900
277000                                                                  00277000
277100     MOVE "ASSOCIATED VIN:      "        TO AUDIT-LABEL           00277100
277200     MOVE VEH-VIN-FULL-C                 TO AUDIT-DATA            00277200
277300     WRITE AUDIT-RECORD                                           00277300
277400                                                                  00277400
277500     SET  SEND-EMAIL                     TO TRUE                  00277500
277600     ADD +1 TO PV-NBR-MEXW027-NOTFOUND-CALLS                      00277600
277700     .                                                            00277700
277800                                                                  00277800
277900/*****************************************************************00277900
278000* ACCEPT AND FORMAT THE CURRENT DATE AND TIME.                   *00278000
278100******************************************************************00278100
278200 9100P-GET-CURRENT-DATE-TIME.                                     00278200
278300                                                                  00278300
278400     ACCEPT SV-CURRENT-DATE FROM DATE                             00278400
278500     ACCEPT SV-CURRENT-TIME FROM TIME                             00278500
278600                                                                  00278600
278700     MOVE SV-CURRENT-DATE-YY            TO SV-FORMAT-DATE-YY      00278700
278800     MOVE SV-CURRENT-DATE-MM            TO SV-FORMAT-DATE-MM      00278800
278900     MOVE SV-CURRENT-DATE-DD            TO SV-FORMAT-DATE-DD      00278900
279000     MOVE SV-CURRENT-TIME-HH            TO SV-FORMAT-TIME-HH      00279000
279100     MOVE SV-CURRENT-TIME-MM            TO SV-FORMAT-TIME-MM      00279100
279200     MOVE SV-CURRENT-TIME-SS            TO SV-FORMAT-TIME-SS      00279200
279300     .                                                            00279300
279400                                                                  00279400
279500/*****************************************************************00279500
279600* WRITE AUDIT HEADER LINES                                       *00279600
279700******************************************************************00279700
279800 9200P-WRITE-AUDIT-HEADER.                                        00279800
279900                                                                  00279900
280000     MOVE PL-PGM-NAME                    TO AUDIT-RECORD          00280000
280100     MOVE "AUDIT REPORT"                 TO AUDIT-RECORD (10:)    00280100
280200     WRITE AUDIT-RECORD                                           00280200
280300                                                                  00280300
280400     MOVE "PROGRAM VERSION            :" TO AUDIT-LABEL           00280400
280500     MOVE PAN-VALET                      TO AUDIT-DATA            00280500
280600     WRITE AUDIT-RECORD                                           00280600
280700                                                                  00280700
280800     MOVE "PROGRAM COMPILE DATE/TIME  :" TO AUDIT-LABEL           00280800
280900     MOVE SV-COMPILE-DATE                TO AUDIT-DATA            00280900
281000     MOVE SV-COMPILE-TIME                TO AUDIT-DATA (10:)      00281000
281100     WRITE AUDIT-RECORD                                           00281100
281200                                                                  00281200
281300     MOVE "PROGRAM START   DATE/TIME  :" TO AUDIT-LABEL           00281300
281400     MOVE SV-FORMAT-DATE                 TO AUDIT-DATA            00281400
281500     MOVE SV-FORMAT-TIME                 TO AUDIT-DATA (10:)      00281500
281600     WRITE AUDIT-RECORD                                           00281600
281700     .                                                            00281700
281800                                                                  00281800
281900/*****************************************************************00281900
282000* WRITE AUDIT TRAILER LINES                                      *00282000
282100******************************************************************00282100
282200 9300P-WRITE-AUDIT-TRAILER.                                       00282200
282300                                                                  00282300
282400     MOVE SPACES                         TO AUDIT-RECORD          00282400
282500     WRITE AUDIT-RECORD                                           00282500
282600                                                                  00282600
282700     MOVE "PROGRAM STOP    DATE/TIME  :" TO AUDIT-LABEL           00282700
282800     MOVE SV-FORMAT-DATE                 TO AUDIT-DATA            00282800
282900     MOVE SV-FORMAT-TIME                 TO AUDIT-DATA (10:)      00282900
283000     WRITE AUDIT-RECORD                                           00283000
283100                                                                  00283100
283200     MOVE PL-PGM-NAME                    TO AUDIT-RECORD          00283200
283300     MOVE "ENDED SUCCESSFULLY"           TO AUDIT-RECORD (10:)    00283300
283400     WRITE AUDIT-RECORD                                           00283400
283500     .                                                            00283500
283600                                                                  00283600
283700/*****************************************************************00283700
283800* WRITE ABEND MESSAGES TO AUDIT FILE, CALL COREDUMP.             *00283800
283900******************************************************************00283900
284000 9999P-ABEND.                                                     00284000
284100                                                                  00284100
284200     IF  ABEND-PROGRAM                 = SPACES                   00284200
284300         MOVE PL-PGM-NAME               TO ABEND-PROGRAM          00284300
284400     END-IF                                                       00284400
284500                                                                  00284500
284600     MOVE SPACES                        TO AUDIT-RECORD           00284600
284700     WRITE AUDIT-RECORD                                           00284700
284800                                                                  00284800
284900     MOVE ABEND-MSG                     TO AUDIT-RECORD           00284900
285000     WRITE AUDIT-RECORD                                           00285000
285100                                                                  00285100
285200     MOVE ABEND-MSG-2                   TO AUDIT-RECORD           00285200
285300     WRITE AUDIT-RECORD                                           00285300
285400                                                                  00285400
285500     MOVE SPACES                        TO AUDIT-RECORD           00285500
285600     WRITE AUDIT-RECORD                                           00285600
285700                                                                  00285700
285800     PERFORM 9999C-CALL-COREDUMP                                  00285800
285900     .                                                            00285900
286000                                                                  00286000
286100***************************************************************** 00286100
286200* CALLS COREDUMP TO FORCE AN ABEND CAUSED BY AN ERROR.            00286200
286300***************************************************************** 00286300
286400 9999C-CALL-COREDUMP.                                             00286400
286500                                                                  00286500
286600     CALL "COREDUMP"                                              00286600
286700     .                                                            00286700
