000100 IDENTIFICATION DIVISION.                                         00000100
000200 PROGRAM-ID.    EXWWB912.                                         00000200
000300 AUTHOR.        TINA ALLEE.                                       00000300
000400 DATE-WRITTEN.  MAY 2015.                                         00000400
000500 DATE-COMPILED.                                                   00000500
000600                                                                  00000600
000700******************************************************************00000700
000800* PROGRAM DESCRIPTION                                             00000800
000900* ONE-SHOT PROGRAM FOR VINCENT SALES MINI FILE - USE VIN LIST     00000900
001800*                                                                 00001800
001900* PROGRAM PROCESSSING:                                            00001900
002000* THE PROGRAM WILL READ IN AN INPUT SYSPARM FILE WHICH WILL       00002000
002100* CONTAIN A LIST OF VINS.                                         00002100
002200* WHEN A VIN IS FIRST READ IN,                                    00002200
002300* DB2 CURSOR WILL BE OPENED WHICH DRIVES OFF OF TABLE MEXW001_    00002300
002400* VEH_ORDER AND SELECTS ROWS WHERE THE MODEL YEARS ARE 1 YEAR     00002400
002500* BACK AND 2 YEARS FORWARD.  ONLY ROWS THAT ARE ASSOCIATED WITH   00002500
002600* A CURRENT WDMO DEALER WILL BE FURTHER  PROCESSED AND OUTPUT     00002600
002700* TO THE OUTBOUND BRIDGE FILE.  THE BRIDGE FILE WILL CONTAIN      00002700
002800* STANDARD E & G HEADERS/TRAILERS ALONG WITH VINCENT HEADERS/     00002800
002900* TRAILERS.                                                       00002900
003000* NOTE:  THERE MAY BE INSTANCES WHERE SOME FIELDS EXTRACTED       00003000
003100* FROM THE GEVIS DB2 TABLES, MAY NOT BE POPULATED WITH DATA.      00003100
003200* IN THAT CASE, IF THE FIELD IS ALPHANUMERIC, SPACES WILL BE      00003200
003300* CONTAINED WITHIN THE CORRESPONDING OUTPUT FIELD AND IF THE      00003300
003400* FIELD IS NUMERIC, ZEROS WILL BE CONTAINED WITHIN THE COR-       00003400
003500* CORRESPONDING OUTPUT FIELD.                                     00003500
003600*                                                                 00003600
003700******************************************************************00003700
003800*                       REVISION LOG                              00003800
003900*                                                                 00003900
004000* DATE     PROGRAMMER REVISION                                    00004000
004100* -------- ---------- ------------------------------------------- 00004100
004200* 05/11/15 TALLEE     ORIGINAL PROGRAM CREATION                   00004200
007900*                                                                 00007900
016500******************************************************************00016500
016600 ENVIRONMENT DIVISION.                                            00016600
016700 INPUT-OUTPUT SECTION.                                            00016700
016800 FILE-CONTROL.                                                    00016800
016900                                                                  00016900
017000     SELECT AUDIT-FILE           ASSIGN TO AUDIT.                 00017000
017100                                                                  00017100
017200 DATA DIVISION.                                                   00017200
017300 FILE SECTION.                                                    00017300
017400                                                                  00017400
017500 FD  AUDIT-FILE.                                                  00017500
017600 01  AUDIT-RECORD.                                                00017600
017700     05  AUDIT-LABEL             PIC X(30).                       00017700
017800     05  AUDIT-DATA              PIC X(50).                       00017800
017900                                                                  00017900
018000******************************************************************00018000
018100*                 W O R K I N G   S T O R A G E                  *00018100
018200******************************************************************00018200
018300 WORKING-STORAGE SECTION.                                         00018300
018400 77  PAN-VALET PICTURE X(24) VALUE "070PEXWWB912 07/25/06".       00018400
018500                                                                  00018500
018600******************************************************************00018600
018700* WORKING STORAGE COPYBOOKS                                       00018700
018800******************************************************************00018800
018900                                                                  00018900
019000 COPY CPEWD001.                                                   00019000
019100*MEXW001 TABLE LAYOUT                                             00019100
019200                                                                  00019200
019300 COPY CPEWD003.                                                   00019300
019400*MEXW003 TABLE LAYOUT                                             00019400
019500                                                                  00019500
019600 COPY CPEWD004.                                                   00019600
019700* DCLGEN - MEXW004_WERS_STRING                                    00019700
019800                                                                  00019800
019900 COPY CPEWD007.                                                   00019900
020000*MEXW007 TABLE LAYOUT                                             00020000
020100                                                                  00020100
020200 COPY CPEWD008.                                                   00020200
020300*MEXW008 TABLE LAYOUT                                             00020300
020400                                                                  00020400
020500 COPY CPESD016.                                                   00020500
020600*MEXS016_GENERIC2                                                 00020600
020700                                                                  00020700
020800 COPY CPEWD021.                                                   00020800
020900*MEXW021 TABLE LAYOUT                                             00020900
021000                                                                  00021000
021100 COPY CPEWD027.                                                   00021100
021200*MEXW027 TABLE LAYOUT                                             00021200
021300                                                                  00021300
021400 COPY CPEWD031.                                                   00021400
021500*MEXW031 TABLE LAYOUT                                             00021500
021600                                                                  00021600
021700 COPY CPEWD032.                                                   00021700
021800*MEXW032 TABLE LAYOUT                                             00021800
021900                                                                  00021900
022000 COPY CPEWD033.                                                   00022000
022100*MEXW033 TABLE LAYOUT                                             00022100
022200                                                                  00022200
022300 COPY CPEWD034.                                                   00022300
022400*MEXW034 TABLE LAYOUT                                             00022400
022500                                                                  00022500
022600 COPY CPEWD035.                                                   00022600
022700*MEXW035 TABLE LAYOUT                                             00022700
022800                                                                  00022800
022900 COPY CPESDB2.                                                    00022900
023000*SQLCA AND SQLCODES                                               00023000
023100                                                                  00023100
023200 COPY CPESIMSB.                                                   00023200
023300*IMS FUNCTIONS AND STATUS CODES                                   00023300
023400                                                                  00023400
023500 COPY CPESGNTB.                                                   00023500
023600*GENERIC TABLE LAYOUTS - EXSE SYSTEM                              00023600
023700                                                                  00023700
023800 COPY CPEWGNTB.                                                   00023800
023900*GENERIC TABLE LAYOUT  - EXWW SYSTEM                              00023900
024000                                                                  00024000
024100 COPY CPESEBWS.                                                   00024100
024200*BMPSHELL WORKING STORAGE                                         00024200
024300                                                                  00024300
024400 COPY CPEWSSTK.                                                   00024400
024500*I/O PARAMETERS FOR SUBROUTINE EXWWSSTK                           00024500
024600                                                                  00024600
024700                                                                  00024700
024800 01  CHKP-SAVE-AREA.                                              00024800
024900******************************************************************00024900
025000* WORKING STORAGE LITERALS                                        00025000
025100******************************************************************00025100
025200     05  LIT-00A                     PIC  X(03) VALUE "00A".      00025200
025300     05  LIT-001                     PIC  X(03) VALUE "001".      00025300
025400     05  LIT-010                     PIC  X(03) VALUE "010".      00025400
025500     05  LIT-10M                     PIC  X(03) VALUE "10M".      00025500
025600     05  LIT-20M                     PIC  X(03) VALUE "20M".      00025600
025700     05  LIT-20T                     PIC  X(03) VALUE "20T".      00025700
025800     05  LIT-30P                     PIC  X(03) VALUE "30P".      00025800
025900     05  LIT-30R                     PIC  X(03) VALUE "30R".      00025900
026000     05  LIT-30T                     PIC  X(03) VALUE "30T".      00026000
026100     05  LIT-40V                     PIC  X(03) VALUE "40V".      00026100
026200     05  LIT-80F                     PIC  X(03) VALUE "80F".      00026200
026300     05  LIT-90V                     PIC  X(03) VALUE "90V".      00026300
026400     05  LIT-025                     PIC  X(03) VALUE "025".      00026400
026500     05  LIT-185                     PIC  X(03) VALUE "185".      00026500
026600     05  LIT-190                     PIC  X(03) VALUE "190".      00026600
026700     05  LIT-600                     PIC  X(03) VALUE "600".      00026700
026800     05  LIT-800                     PIC  X(03) VALUE "800".      00026800
026900     05  LIT-801                     PIC  X(03) VALUE "801".      00026900
027000     05  LIT-999                     PIC  X(03) VALUE "999".      00027000
027100     05  LIT-TBL-VEH-ORDER           PIC X(18)                    00027100
027200                                     VALUE "MEXW001_VEH_ORDER ".  00027200
027300     05  LIT-TBL-VEH-STATUS          PIC X(18)                    00027300
027400                                     VALUE "MEXW003_VEH_STATUS".  00027400
027500     05  LIT-TBL-VEH-WHS             PIC X(18)                    00027500
027600                                     VALUE "MEXW007_VEH_WHS   ".  00027600
027700     05  LIT-TBL-MEXW003-07          PIC X(18)                    00027700
027800                                     VALUE "MEXW003/MEXW007   ".  00027800
027900     05  LIT-TBL-MEXW003-08          PIC X(18)                    00027900
028000                                     VALUE "MEXW003/MEXW008   ".  00028000
028100     05  LIT-TBL-MEXW004             PIC X(18)                    00028100
028200                                     VALUE "MEXW004_VEH_WERS_S".  00028200
028300     05  LIT-TBL-VEH-RTL             PIC X(18)                    00028300
028400                                     VALUE "MEXW008_VEH_RTL   ".  00028400
028500     05  LIT-TBL-GENERIC             PIC X(18)                    00028500
028600                                     VALUE "MEXS016_GENERIC2  ".  00028600
028700     05  LIT-TBL-SUBLVL-ASG          PIC X(18)                    00028700
028800                                     VALUE "MEXW021_SUBLVL_ASG".  00028800
028900     05  LIT-TBL-CONV                PIC X(18)                    00028900
029000                                     VALUE "MEXW027_CONV      ".  00029000
029100     05  LIT-TBL-VL-BRAND            PIC X(18)                    00029100
029200                                     VALUE "MEXW034_VL_BRAND  ".  00029200
029300     05  LIT-TBL-BODY-TYPE           PIC X(18)                    00029300
029400                                     VALUE "MEXW033_BODY_TYPE ".  00029400
029500     05  LIT-TBL-DLR-MSTR            PIC X(18)                    00029500
029600                                     VALUE "MEXW035_DLR_MSTR".    00029600
029700     05  LIT-TBL-CATMAP              PIC X(18)                    00029700
029800                                     VALUE "MEXW031_CATMAP".      00029800
029900     05  LIT-TBL-CATALOG             PIC X(18)                    00029900
030000                                     VALUE "MEXW032_CATALOG".     00030000
030100     05  LIT-SALE-CHK-CSR            PIC X(18)                    00030100
030200                                     VALUE "SALE_CHK_CSR".        00030200
030300     05  LIT-D                       PIC  X(01) VALUE "D".        00030300
030400     05  LIT-E                       PIC  X(01) VALUE "E".        00030400
030500     05  LIT-EX                      PIC  X(02) VALUE "EX".       00030500
030600     05  LIT-Y                       PIC  X(01) VALUE "Y".        00030600
030700     05  LIT-N                       PIC  X(01) VALUE "N".        00030700
030800     05  LIT-STATUS                  PIC  X(06) VALUE "STATUS".   00030800
030900     05  LIT-NA                      PIC  X(02) VALUE "NA".       00030900
031000     05  LIT-EA                      PIC  X(02) VALUE "EA".       00031000
031100     05  LIT-VI                      PIC  X(02) VALUE "VI".       00031100
031200     05  LIT-WD                      PIC  X(02) VALUE "WD".       00031200
031300     05  LIT-SYSTEM-ID               PIC  X(04) VALUE "EXWW".     00031300
031400     05  LIT-VEHLINE                 PIC  X(08) VALUE "VEHLINE ". 00031400
031500     05  LIT-USD                     PIC  X(04) VALUE "USD ".     00031500
031600     05  LIT-WDMSALEM                PIC  X(08) VALUE "WDMSALEM". 00031600
031700     05  LIT-TABLE-ID                PIC  X(08) VALUE "SYSPARM ". 00031700
031800     05  LIT-KEY-DATA-TIMESTAMP      PIC  X(20) VALUE             00031800
031900                                     "EXWWB912TIMESTMP".          00031900
032000     05  LIT-KEY-DATA-BATCHCTL       PIC  X(20) VALUE             00032000
032100                                     "EXWWB912BATCHCTL".          00032100
032200     05  PL-PGM-NAME                 PIC  X(08) VALUE "EXWWB912". 00032200
032300     05  PL-SUBRTN-NAME              PIC  X(08) VALUE "EXWWSSTK". 00032300
032400     05  PL-SYSTEM-CD                PIC  X(04) VALUE  "EXWW".    00032400
032500     05  PL-SPACE                    PIC  X(01) VALUE  " ".       00032500
032600     05  WS-LAYOUT-ID                PIC  X(20) VALUE             00032600
032700                                     "WGEVVNTEXTOUT010".          00032700
032800     05  WS-PROCESS-ID               PIC  X(20) VALUE             00032800
032900                                     "GEVVNTEXTOUT010".           00032900
033000     05  WS-ENTITY-CD                PIC  X(05) VALUE             00033000
033100                                     "EXPNG".                     00033100
033200     05  WS-VEH-VIN-BLANK            PIC  X(17) VALUE             00033200
033300                                     "                 ".         00033300
033400     05  WS-ORDER-ID-BLANK            PIC  X(25) VALUE            00033400
033500                                     "                         ". 00033500
033600                                                                  00033600
033700******************************************************************00033700
033800* WORKING STORAGE SWITCHES                                        00033800
033900******************************************************************00033900
034000     05  WS-SWITCHES.                                             00034000
034100         10  WS-MEXW001-SW               PIC X(01).               00034100
034200             88 MEXW001-FOUND            VALUE "Y".               00034200
034300             88 MEXW001-NOT-FOUND        VALUE "N".               00034300
034400         10  WS-MEXW003-20T-SW           PIC X(01).               00034400
034500             88 MEXW003-FOUND-20T        VALUE "Y".               00034500
034600             88 MEXW003-NOT-FOUND-20T    VALUE "N".               00034600
034700         10  WS-MEXW003-30P-SW           PIC X(01).               00034700
034800             88 MEXW003-FOUND-30P        VALUE "Y".               00034800
034900             88 MEXW003-NOT-FOUND-30P    VALUE "N".               00034900
035000         10  WS-MEXW003-30R-SW           PIC X(01).               00035000
035100             88 MEXW003-FOUND-30R        VALUE "Y".               00035100
035200             88 MEXW003-NOT-FOUND-30R    VALUE "N".               00035200
035300         10  WS-MEXW003-30T-SW           PIC X(01).               00035300
035400             88 MEXW003-FOUND-30T        VALUE "Y".               00035400
035500             88 MEXW003-NOT-FOUND-30T    VALUE "N".               00035500
035600         10  WS-MEXW003-40V-SW           PIC X(01).               00035600
035700             88 MEXW003-FOUND-40V        VALUE "Y".               00035700
035800             88 MEXW003-NOT-FOUND-40V    VALUE "N".               00035800
035900         10  WS-MEXW003-80F-SW           PIC X(01).               00035900
036000             88 MEXW003-FOUND-80F        VALUE "Y".               00036000
036100             88 MEXW003-NOT-FOUND-80F    VALUE "N".               00036100
036200         10  WS-MEXW008-90V-SW           PIC X(01).               00036200
036300             88 MEXW008-FOUND-90V        VALUE "Y".               00036300
036400             88 MEXW008-NOT-FOUND-90V    VALUE "N".               00036400
036500         10  WS-MEXW003-40V-CSR-ROW-FOUND                         00036500
036600                                         PIC X(01).               00036600
036700             88 MEXW003-40V-CSR-ROW-FOUND                         00036700
036800                                         VALUE "Y".               00036800
036900             88 MEXW003-40V-CSR-ROW-NOT-FOUND                     00036900
037000                                         VALUE "N".               00037000
037100         10  WS-MEXW007-SW               PIC X(01).               00037100
037200             88 MEXW007-FOUND            VALUE "Y".               00037200
037300             88 MEXW007-NOT-FOUND        VALUE "N".               00037300
037400         10  WS-MEXW008-SW               PIC X(01).               00037400
037500             88 MEXW008-FOUND            VALUE "Y".               00037500
037600             88 MEXW008-NOT-FOUND        VALUE "N".               00037600
037700         10  WS-MEXW021-SW               PIC X(01).               00037700
037800             88 MEXW021-FOUND            VALUE "Y".               00037800
037900             88 MEXW021-NOT-FOUND        VALUE "N".               00037900
038000         10  WS-MEXW027-SW               PIC X(01).               00038000
038100             88 MEXW027-FOUND            VALUE "Y".               00038100
038200             88 MEXW027-NOT-FOUND        VALUE "N".               00038200
038300         10  WS-MEXW027-MULTIPLE-SW      PIC X(01).               00038300
038400             88 MEXW027-MULTIPLE-FOUND   VALUE "Y".               00038400
038500             88 MEXW027-MULTIPLE-NOT-FOUND                        00038500
038600                                         VALUE "N".               00038600
038700         10  WS-MEXW031-SW               PIC X(01).               00038700
038800             88 MEXW031-FOUND            VALUE "Y".               00038800
038900             88 MEXW031-NOT-FOUND        VALUE "N".               00038900
039000         10  WS-MEXW032-SW               PIC X(01).               00039000
039100             88 MEXW032-FOUND            VALUE "Y".               00039100
039200             88 MEXW032-NOT-FOUND        VALUE "N".               00039200
039300         10  WS-MEXW033-SW               PIC X(01).               00039300
039400             88 MEXW033-FOUND            VALUE "Y".               00039400
039500             88 MEXW033-NOT-FOUND        VALUE "N".               00039500
039600         10  WS-MEXW034-SW                PIC X(01).              00039600
039700             88 MEXW034-FOUND            VALUE "Y".               00039700
039800             88 MEXW034-NOT-FOUND        VALUE "N".               00039800
039900         10  WS-MEXW035-SW               PIC X(01).               00039900
040000             88 MEXW035-FOUND            VALUE "Y".               00040000
040100             88 MEXW035-NOT-FOUND        VALUE "N".               00040100
040200         10  WS-END-OF-SYSPARM-FILE      PIC X(01).               00040200
040300             88 END-OF-SYSPARM-FILE      VALUE "Y".               00040300
040400             88 NOT-END-OF-SYSPARM-FILE  VALUE "N".               00040400
040500         10  WS-BATCHCTL-FOUND           PIC X(01).               00040500
040600             88 BATCHCTL-FOUND           VALUE "Y".               00040600
040700             88 BATCHCTL-NOT-FOUND       VALUE "N".               00040700
040800         10  WS-WDMO-DEALER              PIC X(01).               00040800
040900             88 WDMO-DEALER              VALUE "Y".               00040900
041000             88 NOT-WDMO-DEALER          VALUE "N".               00041000
041100         10  WS-SEND-EMAIL               PIC X(01).               00041100
041200             88 SEND-EMAIL               VALUE "Y".               00041200
041300             88 NOT-SEND-EMAIL           VALUE "N".               00041300
041400         10  WS-SALE-CHK-SW              PIC X(01).               00041400
041500             88 SALE-CHK-FOUND           VALUE "Y".               00041500
041600             88 SALE-CHK-NOT-FOUND       VALUE "N".               00041600
041700         10  SW-WERS-STRING              PIC X(01).               00041700
041800             88 WERS-STRING-FOUND-SW     VALUE "Y".               00041800
041900             88 WERS-STRING-NOT-FOUND-SW VALUE "N".               00041900
042000                                                                  00042000
042100******************************************************************00042100
042200* WORKING STORAGE VARIABLES                                       00042200
042300******************************************************************00042300
042400     05  WS-VARIABLES.                                            00042400
042500         10  WS-NBR-ROWS-READ-MEXW001    PIC S9(9) COMP.          00042500
042600         10  WS-NBR-ROWS-READ-MEXW003    PIC S9(9) COMP.          00042600
042700         10  WS-NBR-ROWS-READ-MEXW004    PIC S9(9) COMP.          00042700
042800         10  WS-NBR-ROWS-READ-MEXW007    PIC S9(9) COMP.          00042800
042900         10  WS-NBR-ROWS-READ-MEXW008    PIC S9(9) COMP.          00042900
043000         10  WS-NBR-ROWS-READ-SALE-CHK   PIC S9(9) COMP.          00043000
043100         10  WS-NBR-ROWS-READ-MEXW021    PIC S9(9) COMP.          00043100
043200         10  WS-NBR-ROWS-READ-MEXW027    PIC S9(9) COMP.          00043200
043300         10  WS-NBR-ROWS-READ-MEXW031    PIC S9(9) COMP.          00043300
043400         10  WS-NBR-ROWS-READ-MEXW032    PIC S9(9) COMP.          00043400
043500         10  WS-NBR-ROWS-READ-MEXW033    PIC S9(9) COMP.          00043500
043600         10  WS-NBR-ROWS-READ-MEXW034    PIC S9(9) COMP.          00043600
043700         10  WS-NBR-ROWS-READ-MEXW035    PIC S9(9) COMP.          00043700
043800         10  WS-NBR-SYSPARM-RECS-READ    PIC S9(9) COMP.          00043800
043900         10  WS-NBR-EXWWSSTK-CALLS       PIC S9(9) COMP.          00043900
044000         10  WS-NBR-EXWWSSTK-NOTFOUND-CALLS                       00044000
044100                                         PIC S9(9) COMP.          00044100
044200         10  WS-NBR-MEXW027-NOTFOUND-CALLS                        00044200
044300                                         PIC S9(9) COMP.          00044300
044400         10  WS-NBR-MEXW035-NOTFOUND-CALLS                        00044400
044500                                         PIC S9(9) COMP.          00044500
044600         10  WS-NBR-OUTPUT-RECS-WRITTEN  PIC S9(9) COMP.          00044600
044700         10  WS-COUNT-DTL-NBR            PIC S9(9) COMP.          00044700
044800         10  WS-COUNT-LINE-NBR           PIC S9(9) COMP.          00044800
044900         10  WS-PREV-RUN-TIMESTAMP       PIC X(26).               00044900
045000         10  WS-PREV-BATCH-NBR           PIC 9(05).               00045000
045100         10  WS-CURRENT-BATCH-NBR        PIC 9(05).               00045100
045200         10  WS-CURR-DRBN-TIMESTAMP      PIC X(26).               00045200
045300         10  WS-CURR-DRBN-TIMESTAMP-REDEF REDEFINES               00045300
045400             WS-CURR-DRBN-TIMESTAMP.                              00045400
045500             15  WS-DRBN-YEAR            PIC 9(04).               00045500
045600             15  FILLER                  PIC X(01).               00045600
045700             15  WS-DRBN-MONTH           PIC X(02).               00045700
045800             15  FILLER                  PIC X(01).               00045800
045900             15  WS-DRBN-DAY             PIC X(02).               00045900
046000             15  FILLER                  PIC X(01).               00046000
046100             15  WS-DRBN-HOUR            PIC X(02).               00046100
046200             15  FILLER                  PIC X(01).               00046200
046300             15  WS-DRBN-MINUTE          PIC X(02).               00046300
046400             15  FILLER                  PIC X(01).               00046400
046500             15  WS-DRBN-SECOND          PIC X(02).               00046500
046600             15  FILLER                  PIC X(01).               00046600
046700             15  WS-DRBN-MILISECS        PIC X(06).               00046700
046800                                                                  00046800
046900         10  WS-CURR-DRBN-TMSTMP-LESS-1  PIC X(26).               00046900
047000         10  WS-CURR-DRBN-TMSTMP-LESS-1-R REDEFINES               00047000
047100             WS-CURR-DRBN-TMSTMP-LESS-1.                          00047100
047200             15  WS-DRBN-YEAR-LESS-1     PIC 9(04).               00047200
047300             15  FILLER                  PIC X(22).               00047300
047400                                                                  00047400
047500         10  WS-VEH-BDT-MDL-YR-Y         PIC 9(04).99.            00047500
047600         10  WS-VEH-BDT-MDL-YR-Y-RDF                              00047600
047700             REDEFINES WS-VEH-BDT-MDL-YR-Y.                       00047700
047800             15 WS-VEH-BDT-MDL-YR-CC     PIC X(02).               00047800
047900             15 WS-VEH-BDT-MDL-YR-YY     PIC X(02).               00047900
048000             15 WS-VEH-BDT-MDL-YR-FILLE  PIC X(01).               00048000
048100             15 WS-VEH-BDT-MDL-YR-QTR    PIC X(02).               00048100
048200         10  WS-CURR-MODEL-YY            PIC S9(04)V99 COMP-3.    00048200
048300         10  WS-VST-GBL-LOC-C-REFORMAT   PIC 9(06).               00048300
048400         10  WS-DLR-SUPER-DLR-C-REFORMAT PIC 9(06).               00048400
048500         10  WS-DTL-VEH-GBL-DLR-C-REFORMAT                        00048500
048600                                         PIC 9(06).               00048600
048700         10  WS-PROCESS-SQLCODE-EDIT     PIC +++++.               00048700
048800         10  AUDIT-RECORD-MSG.                                    00048800
048900             15  AUDIT-LABEL-MSG         PIC X(10).               00048900
049000             15  AUDIT-DATA-MSG          PIC X(70).               00049000
049100                                                                  00049100
049200     05  WS-VALID-VARIABLES.                                      00049200
049300         10  WS-WERS-VL-C                PIC  X(02).              00049300
049400             88  WS-VALID-VEH-LINE-CDS   VALUE "KI", "K5", "DB".  00049400
049500                                                                  00049500
049600******************************************************************00049600
049700* DO NOT PUT ANY COPYBOOKS WITH AN 01 LEVEL IN THIS SECTION. THIS*00049700
049800* AREA IS USED STRICTLY FOR DATA TO BE SAVED IN THE CHKP AREA.   *00049800
049900******************************************************************00049900
050000                                                                  00050000
050100 COPY CPEWHUB.                                                    00050100
050200*E & G HUB HEADER/TRAILER LAYOUT                                  00050200
050300                                                                  00050300
050400 COPY CPEWVNCT.                                                   00050400
050500*VINCENT HEADER/TRAILER LAYOUT                                    00050500
050600                                                                  00050600
050700                                                                  00050700
050800******************************************************************00050800
050900* RECORD DESCRIPTIONS FOR GSAM FILES                             *00050900
051000******************************************************************00051000
051100                                                                  00051100
051200 01  SYSPARM-RECORD.                                              00051200
051300     05  SYSPARM-VIN                     PIC X(17).               00051300
051400     05  FILLER                          PIC X(63).               00051400
051500                                                                  00051500
051600 01  WS-VINCENT-OUTPUT-RECORD            PIC X(1000).             00051600
051700                                                                  00051700
051800 01  WS-VINCENT-DETAIL-RECORD.                                    00051800
051900     05  WS-DTL-HUB-LINE-NBR             PIC 9(06).               00051900
052000     05  WS-DTL-HUB-REC-ID               PIC X(25).               00052000
052100     05  WS-DTL-HUB-REC-ID-NBR REDEFINES                          00052100
052200         WS-DTL-HUB-REC-ID.                                       00052200
052300         10  WS-DTL-REC-ID-ZEROS         PIC 9(16).               00052300
052400         10  WS-DTL-REC-ID-NBR           PIC 9(09).               00052400
052500     05  WS-DTL-HUB-REC-TYPE             PIC X(03).               00052500
052600     05  WS-DTL-HUB-REC-SEQ-NBR          PIC 9(03).               00052600
052700     05  WS-DTL-VIN-FULL-C               PIC X(17).               00052700
052800     05  WS-DTL-DTA-DATA-SRC-C           PIC X(02).               00052800
052900     05  WS-DTL-BDT-MDL-YR-Y             PIC X(02).               00052900
053000     05  WS-DTL-GEVIS-VEH-LINE-C         PIC X(02).               00053000
053100     05  WS-DTL-LCL-BDYTYP-C             PIC X(05).               00053100
053200     05  WS-DTL-CUR-STA-STATUS-C         PIC X(03).               00053200
053300     05  WS-DTL-VEH-DIVISION-C           PIC X(01).               00053300
053400     05  WS-DTL-WMI-WMI-C                PIC X(03).               00053400
053500     05  WS-DTL-LCL-PLT-C                PIC X(03).               00053500
053600     05  WS-DTL-VWS-TOT-US-A             PIC S9(07)V99 COMP-3.    00053600
053700     05  WS-DTL-VEH-GBL-DLR-C            PIC X(06).               00053700
053800     05  WS-DTL-LAST-QAD-VST-GBL-LOC-C   PIC X(06).               00053800
053900     05  WS-DTL-CURR-VST-GBL-LOC-C       PIC X(06).               00053900
054000     05  WS-DTL-SHIP-TO-DLR-C            PIC X(06).               00054000
054100     05  WS-DTL-CURR-STOCKING-DLR-C      PIC X(06).               00054100
054200     05  WS-DTL-CURR-DLR-C               PIC X(06).               00054200
054300     05  WS-DTL-WDMO-FLEET-C             PIC X(05).               00054300
054400     05  WS-DTL-VRS-LCL-FLEET-C          PIC X(06).               00054400
054500     05  WS-DTL-VRS-CST-FIRST-N          PIC X(30).               00054500
054600     05  WS-DTL-VRS-CST-MID-INIT-X       PIC X(01).               00054600
054700     05  WS-DTL-VRS-CST-LAST-N           PIC X(30).               00054700
054800     05  WS-DTL-VRS-CST-ADDR-1-X         PIC X(40).               00054800
054900     05  WS-DTL-VRS-CST-ADD-DIV2-N       PIC X(40).               00054900
055000     05  WS-DTL-VRS-CST-ADD-DIV1-C       PIC X(02).               00055000
055100     05  WS-DTL-VRS-CST-POSTAL-C         PIC X(10).               00055100
055200     05  WS-DTL-VRS-SALESPERSON-C        PIC X(11).               00055200
055300     05  WS-DTL-VRS-TYP-LCL-CUST-C       PIC X(01).               00055300
055400     05  WS-DTL-VEH-WDMO-ORD-TYP         PIC X(01).               00055400
055500     05  WS-DTL-VEH-ORD-RCPT-Y           PIC X(08).               00055500
055600     05  WS-DTL-VEH-SCHD-VST-TARGET-Y    PIC X(08).               00055600
055700     05  WS-DTL-VEH-PRODUCE-VST-STAT-Y   PIC X(08).               00055700
055800     05  WS-DTL-VEH-RELEASE-VST-STAT-Y   PIC X(08).               00055800
055900     05  WS-DTL-VEH-ARRIVAL-VST-STAT-Y   PIC X(08).               00055900
056000     05  WS-DTL-VEH-INVOICE-VST-STAT-Y   PIC X(08).               00056000
056100     05  WS-DTL-VEH-STOCK-VST-STAT-Y     PIC X(08).               00056100
056200     05  WS-DTL-VEH-RETAIL-VST-STAT-Y    PIC X(08).               00056200
056300     05  WS-DTL-VEH-DELIVER-VST-STAT-Y   PIC X(08).               00056300
056400     05  WS-DTL-VEH-SLSRCPT-VST-STAT-Y   PIC X(08).               00056400
056500     05  WS-DTL-VEH-WARRANT-VST-STAT-Y   PIC X(08).               00056500
056600     05  WS-DTL-VEH-CATALOG-C            PIC X(15).               00056600
056700     05  WS-DTL-WERS-VEH-LINE-C          PIC X(02).               00056700
056800     05  WS-DTL-WERS-BODY-STYLE-C        PIC X(03).               00056800
056900     05  WS-DTL-WERS-BRAND-C             PIC X(01).               00056900
057000     05  WS-DTL-VEH-PO-Y                 PIC X(08).               00057000
057100     05  WS-DTL-FILLER-01                PIC X(590).              00057100
057200                                                                  00057200
057300     05  INPUT-OUTPUT-PARAMETERS           PIC X(4020).           00057300
057400                                                                  00057400
057500******************************************************************00057500
057600* MAIN DRIVING CURSOR TO SELECT ROWS FROM TABLE MEXW001 WHICH ARE 00057600
057700* VIN LIST                                                        00057700
057900* NOTE: VIN IS POPULATED FROM THE INPUT SYSPARM FILE.             00057900
058000******************************************************************00058000
058100                                                                  00058100
058200     EXEC SQL                                                     00058200
058300         DECLARE  MEXW001_CSR CURSOR WITH HOLD FOR                00058300
058400          SELECT  VEH_VIN_FULL_C                                  00058400
058500                 ,VEH_ORD_ID_C                                    00058500
058600                 ,DTA_DATA_SRC_C                                  00058600
058700                 ,BDT_MDL_YR_Y                                    00058700
058800                 ,WMI_WMI_C                                       00058800
058900                 ,VEH_LCL_PLT_C                                   00058900
059000                 ,VEH_LCL_BDYTYP_C                                00059000
059100                 ,VEH_GBL_ORD_DLR_C                               00059100
059200                 ,VEH_GBL_SHIP_TO_C                               00059200
059300                 ,VEH_ORD_RCPT_Y                                  00059300
059400                 ,VEH_WDMO_FLEET_C                                00059400
059500                 ,VEH_WDMO_ORD_TYP                                00059500
059600                 ,VEH_CATALOG_C                                   00059600
059700                 ,VEH_GBL_CATALOG_C                               00059700
059800                 ,VEH_PO_Y                                        00059800
059900                 ,VEH_GEVIS_VL_C                                  00059900
060000                 ,COUNTRY_ISO3_C                                  00060000
060100            FROM  MEXW001_VEH_ORDER                               00060100
060300           WHERE VEH_VIN_FULL_C     = :VEH-VIN-FULL-C             00060300
060600             AND VEH_ACTIVE_F       = :VEH-ACTIVE-F               00060600
060800         ORDER BY VEH_ORD_ID_C                                    00060800
060900                , DTA_DATA_SRC_C                                  00060900
061000         FOR READ ONLY                                            00061000
061100     END-EXEC                                                     00061100
061200                                                                  00061200
061300******************************************************************00061300
061400* THIS CURSOR WILL BE USED TO JOIN THE MEXW001 AND MEXW008 TABLES 00061400
061500* WHERE THE VEHICLE WAS SOLD WITHIN THE PAST 12 MONTHS AND THE    00061500
061600* MODEL YEAR IS OLDER THAN 1 YEAR.                                00061600
061700******************************************************************00061700
061800                                                                  00061800
061900     EXEC SQL                                                     00061900
062000         DECLARE  SALE_CHK_CSR CURSOR WITH HOLD FOR               00062000
062100          SELECT  VEH.VEH_VIN_FULL_C                              00062100
062200                 ,VEH.VEH_ORD_ID_C                                00062200
062300                 ,VEH.DTA_DATA_SRC_C                              00062300
062400                 ,VEH.BDT_MDL_YR_Y                                00062400
062500                 ,VEH.WMI_WMI_C                                   00062500
062600                 ,VEH.VEH_LCL_PLT_C                               00062600
062700                 ,VEH.VEH_LCL_BDYTYP_C                            00062700
062800                 ,VEH.VEH_GBL_ORD_DLR_C                           00062800
062900                 ,VEH.VEH_GBL_SHIP_TO_C                           00062900
063000                 ,VEH.VEH_ORD_RCPT_Y                              00063000
063100                 ,VEH.VEH_WDMO_FLEET_C                            00063100
063200                 ,VEH.VEH_WDMO_ORD_TYP                            00063200
063300                 ,VEH.VEH_CATALOG_C                               00063300
063400                 ,VEH.VEH_GBL_CATALOG_C                           00063400
063500                 ,VEH.VEH_PO_Y                                    00063500
063600                 ,VEH.VEH_GEVIS_VL_C                              00063600
063700                 ,VEH.COUNTRY_ISO3_C                              00063700
063800            FROM  MEXW001_VEH_ORDER VEH                           00063800
063900                 ,MEXW008_VEH_RTL   VRS                           00063900
064200           WHERE  VRS.VRS_ACTIVE_F   = :VRS-ACTIVE-F              00064200
064400             AND  VEH.VEH_VIN_FULL_C = :VEH-VIN-FULL-C            00064400
064500             AND  VEH.VEH_ORD_ID_C   = VRS.VEH_ORD_ID_C           00064500
064600             AND  VEH.DTA_DATA_SRC_C = VRS.DTA_DATA_SRC_C         00064600
064700         FOR READ ONLY                                            00064700
064800     END-EXEC                                                     00064800
064900                                                                  00064900
065000******************************************************************00065000
065100* THIS CURSOR WILL BE USED TO SELECT ONE ROW FROM TABLE MEXW031   00065100
065200* FOR NON 'NA' AND NON 'EA' DATA SOURCES.  THE RETRIEVED VALUES   00065200
065300* WILL BE USED IN PLACE OF THE LOCAL BODY STYLE CODE THAT WAS     00065300
065400* OBTAINED FROM TABLE MEXW001.                                    00065400
065500******************************************************************00065500
065600     EXEC SQL                                                     00065600
065700         DECLARE  MEXW031_CSR CURSOR WITH HOLD FOR                00065700
065800         SELECT  OPT_OPTION_C                                     00065800
065900                ,VPT_PROD_TYP_C                                   00065900
066000           FROM  MEXW031_CATMAP                                   00066000
066100          WHERE  DTA_DATA_SRC_C    = :CTM-DTA-DATA-SRC-C          00066100
066200            AND  CTM_LCL_CATALOG_C = :CTM-LCL-CATALOG-C           00066200
066300            AND  OFM_OPTION_FAM_C IN ("BS", "CA")                 00066300
066400            OPTIMIZE FOR 1 ROW                                    00066400
066500         FOR READ ONLY                                            00066500
066600     END-EXEC                                                     00066600
066700                                                                  00066700
066800******************************************************************00066800
066900* THIS CURSOR IS BEING USED IN ORDER TO RETRIEVE THE MOST RECENT  00066900
067000* WHOLESALE GLOBAL DEALER FROM TABLE MEXW003 USING A "40V" STATUS 00067000
067100* CODE AND THE FTC QAD CURRENT DATA SOURCE (WD).                  00067100
067200******************************************************************00067200
067300     EXEC SQL                                                     00067300
067400        DECLARE  MEXW003_40V_CSR CURSOR WITH HOLD FOR             00067400
067500         SELECT  VST_GBL_LOC_C                                    00067500
067600           FROM  MEXW003_VEH_STATUS                               00067600
067700          WHERE  VEH_ORD_ID_C       = :VST-VEH-ORD-ID-C           00067700
067800            AND  DTA_DATA_SRC_C     = :VST-DTA-DATA-SRC-C         00067800
067900            AND  STA_STATUS_C       = :VST-STA-STATUS-C           00067900
068000            AND  VST_ACTIVE_F       = :VST-ACTIVE-F               00068000
068100            AND  VST_STAT_TYP_C     = :VST-STAT-TYP-C             00068100
068200            AND  VST_CUR_DATA_SRC_C = :VST-CUR-DATA-SRC-C         00068200
068300       ORDER BY  VST_STAT_Y  DESC                                 00068300
068400                ,VST_STATIC_ISRT_REC_S  DESC                      00068400
068500         FOR READ ONLY                                            00068500
068600     END-EXEC                                                     00068600
068700                                                                  00068700
068800                                                                  00068800
068900******************************************************************00068900
069000*            LINKAGE SECTION                                      00069000
069100******************************************************************00069100
069200 LINKAGE SECTION.                                                 00069200
069300                                                                  00069300
069400 01  IO-PCB.                                                      00069400
069500     05  IO-PCB-LTERM            PIC X(08).                       00069500
069600     05  FILLER                  PIC X(02).                       00069600
069700     05  IO-PCB-STATUS           PIC X(02).                       00069700
069800     05  FILLER                  PIC X(28).                       00069800
069900                                                                  00069900
070000 01  SYSPARM-PCB.                                                 00070000
070100     05  SYSPARM-PCB-NAME        PIC X(08).                       00070100
070200     05  FILLER                  PIC X(02).                       00070200
070300     05  SYSPARM-PCB-STATUS      PIC X(02).                       00070300
070400     05  FILLER                  PIC X(28).                       00070400
070500                                                                  00070500
070600 01  VINCENT-PCB.                                                 00070600
070700     05  VINCENT-PCB-NAME        PIC X(08).                       00070700
070800     05  FILLER                  PIC X(02).                       00070800
070900     05  VINCENT-PCB-STATUS      PIC X(02).                       00070900
071000     05  FILLER                  PIC X(28).                       00071000
071100                                                                  00071100
071200******************************************************************00071200
071300*              P R O C E D U R E   D I V I S I O N               *00071300
071400******************************************************************00071400
071500 PROCEDURE DIVISION.                                              00071500
071600                                                                  00071600
071700******************************************************************00071700
071800*                        M A I N L I N E                         *00071800
071900* E-TRACKER 1090765 START *                                      *00071900
072000* ADDED STATEMENT TO MOVE 3 TO RETURN-CODE WHICH IS THE RESULT   *00072000
072100* OF AN ORDER-ID AND PRODUCTION SOURCE GETTING A NOT FOUND COND- *00072100
072200* ITION WHEN EXWWSSTK SUBROUTINE WAS BEING CALLED. THE RETURN-   *00072200
072300* CODE WILL BE CHECKED IN THE JCL AND IF IT'S 3, THEN AN EMAIL   *00072300
072400* WILL BE SENT TO THE HELPDESK                                   *00072400
072500* E-TRACKER 1090765 END *                                        *00072500
072600******************************************************************00072600
072700 0000P-MAINLINE.                                                  00072700
072800                                                                  00072800
072900     ENTRY "DLITCBL" USING IO-PCB                                 00072900
073000                           SYSPARM-PCB                            00073000
073100                           VINCENT-PCB                            00073100
073200                                                                  00073200
073300     PERFORM 0100I-INITIALIZATION                                 00073300
073400     PERFORM 1000P-PROCESS UNTIL END-OF-SYSPARM-FILE              00073400
073500     PERFORM 0200I-CONCLUSION                                     00073500
073600     IF SEND-EMAIL                                                00073600
073700        MOVE 3 TO RETURN-CODE                                     00073700
073800     END-IF                                                       00073800
073900     GOBACK                                                       00073900
074000     .                                                            00074000
074100                                                                  00074100
074200 COPY CPESEBIC.                                                   00074200
074300*BMPSHELL INITIALIZATION AND CONCLUSION                           00074300
074400                                                                  00074400
074500******************************************************************00074500
074600* INITIALIZE THE CHECKPOINT SAVE AREA                            *00074600
074700******************************************************************00074700
074800 0300P-INITIALIZE-SAVE-AREA.                                      00074800
074900                                                                  00074900
075000      CONTINUE                                                    00075000
075100                                                                  00075100
075200* DO NOT INITIALIZE THE CHECKPOINT AREA SINCE THERE ARE VALUES    00075200
075300* HARDCODED IN THERE                                              00075300
075400      .                                                           00075400
075500                                                                  00075500
075600******************************************************************00075600
075700* INITIALIZE THE REPORT TITLES                                   *00075700
075800******************************************************************00075800
075900 0350P-INITIALIZE-REPORT-TITLES.                                  00075900
076000                                                                  00076000
076100      CONTINUE                                                    00076100
076200                                                                  00076200
076300     .                                                            00076300
076400                                                                  00076400
076500******************************************************************00076500
076600* PROGRAM SPECIFIC INITIALIZATION                                *00076600
076700******************************************************************00076700
076800 0400P-INITIALIZE-OTHER.                                          00076800
076900                                                                  00076900
077000     SET NOT-END-OF-SYSPARM-FILE                                  00077000
077100      TO TRUE                                                     00077100
077200     INITIALIZE  WS-VINCENT-DETAIL-RECORD                         00077200
077300                 WS-SWITCHES                                      00077300
077400                 WS-VARIABLES                                     00077400
077500                                                                  00077500
077600     PERFORM 7000C-OBTAIN-DRBN-TIMESTAMP                          00077600
077700     MOVE WS-DRBN-YEAR                                            00077700
077800       TO WS-CURR-MODEL-YY                                        00077800
077900                                                                  00077900
078000     PERFORM 7300C-GET-BATCH-NBR                                  00078000
078100                                                                  00078100
078200     MOVE GNT-ATTRIBUTE-DATA (1:5)                                00078200
078300       TO WS-PREV-BATCH-NBR                                       00078300
078400                                                                  00078400
078500     IF WS-PREV-BATCH-NBR = 99999                                 00078500
078600        MOVE 0                                                    00078600
078700          TO WS-PREV-BATCH-NBR                                    00078700
078800     END-IF                                                       00078800
078900                                                                  00078900
079000     COMPUTE WS-CURRENT-BATCH-NBR = WS-PREV-BATCH-NBR + 1         00079000
079100                                                                  00079100
079200     PERFORM 8000C-GET-SYSPARM-RECORD                             00079200
079300     IF END-OF-SYSPARM-FILE                                       00079300
079400        MOVE "MISSING SYSPARM RECORDS"                            00079400
079500          TO ABEND-MSG                                            00079500
079600        MOVE "PARAGRAPH 0400P"                                    00079600
079700          TO  ABEND-MSG-2                                         00079700
079800        PERFORM 9999I-ABEND                                       00079800
079900     END-IF                                                       00079900
080000                                                                  00080000
080100     PERFORM 7400C-POPULATE-HUB-HEADER                            00080100
080200     PERFORM 6000C-WRITE-VINCENT-RECORD                           00080200
080300     PERFORM 7500C-POPULATE-VINCENT-HEADER                        00080300
080400     PERFORM 6000C-WRITE-VINCENT-RECORD                           00080400
080500                                                                  00080500
080600     MOVE WS-CURR-DRBN-TIMESTAMP                                  00080600
080700       TO WS-CURR-DRBN-TMSTMP-LESS-1                              00080700
080800     SUBTRACT 1 FROM WS-DRBN-YEAR-LESS-1                          00080800
080900     .                                                            00080900
081000                                                                  00081000
081100******************************************************************00081100
081200* PROGRAM SPECIFIC CONCLUSION                                    *00081200
081300******************************************************************00081300
081400 0700P-CONCLUDE-OTHER.                                            00081400
081500                                                                  00081500
081600     PERFORM 7250C-UPDATE-TIMESTAMP                               00081600
081700     PERFORM 7350C-UPDATE-BATCH-NBR                               00081700
081800                                                                  00081800
081900     PERFORM 7550C-POPULATE-VINCENT-TRAILER                       00081900
082000     PERFORM 6000C-WRITE-VINCENT-RECORD                           00082000
082100     PERFORM 7450C-POPULATE-HUB-TRAILER                           00082100
082200     PERFORM 6000C-WRITE-VINCENT-RECORD                           00082200
082300     PERFORM 6020C-WRITE-AUDIT-DETAIL                             00082300
082400     .                                                            00082400
082500                                                                  00082500
082600******************************************************************00082600
082700* MAIN DRIVING PARAGRAPH CALLED FROM 0000P-MAINLINE.  A LOOP WILL 00082700
082800* BE PERFORMED WHICH WILL PROCESS ALL VEHICLES FOR A PRODUCTION   00082800
082900* SOURCE.  AT THE END OF THE LOOP, THE NEXT PRODUCTION SOURCE     00082900
083000* WILL BE READ IN.                                                00083000
083100******************************************************************00083100
083200 1000P-PROCESS.                                                   00083200
083300     PERFORM 2010C-OPEN-MEXW001-CSR                               00083300
083400     PERFORM 2020C-FETCH-MEXW001-CSR                              00083400
083500     PERFORM 2000C-PROCESS-GEVIS-VEHICLE                          00083500
083600        UNTIL MEXW001-NOT-FOUND                                   00083600
083700     PERFORM 2030C-CLOSE-MEXW001-CSR                              00083700
083800                                                                  00083800
083900     PERFORM 2100C-OPEN-SALE-CHK-CSR                              00083900
084000     PERFORM 2120C-FETCH-SALE-CHK-CSR                             00084000
084100     PERFORM 2040C-PROCESS-SALE-CHK-CSR                           00084100
084200        UNTIL SALE-CHK-NOT-FOUND                                  00084200
084300     PERFORM 2140C-CLOSE-SALE-CHK-CSR                             00084300
084400                                                                  00084400
084500     PERFORM 8000C-GET-SYSPARM-RECORD                             00084500
084600     .                                                            00084600
084700                                                                  00084700
084800 2000C-PROCESS-GEVIS-VEHICLE.                                     00084800
084900***************************************************************** 00084900
085000* THE FIRST STEP WILL BE TO DETERMINE WHETHER OR NOT THE          00085000
085100* VEHICLE'S CURRENT STOCKING DEALER IS WDMO BASED. IF IT IS,      00085100
085200* THEN FURTHER PROCESSING WILL CONTINUE.  IF IT IS NOT, THEN THE  00085200
085300* VEHICLE WILL BE SKIPPED AND THEN NEXT ONE WILL BE SELECTED.     00085300
085400* THIS PARAGRAPH WILL BE PERFORMED UNTIL THERE ARE NO MORE VEH-   00085400
085500* ICLES FOR A PRODCUTION SOURCE.                                  00085500
085600* NOTE: INITIALIZATION WILL OCCUR PRIOR TO THE PROCESSING OF THE  00085600
085700* NEXT VEHICLE.  ALSO, A CHECK FOR SSTK-SUCCESSFUL HAS BEEN       00085700
085800* ADDED BECAUSE IT IS POSSIBLE THAT WHEN CALLING SSTK, WE COULD   00085800
085900* GET A +100 FOR THE STOCKING DEALER.  IF THAT'S THE CASE, WE     00085900
086000* NEED TO SKIP THE PROCESSING OF PARAGRAPH 5000C AND FETCH THE    00086000
086100* NEXT RECORD.                                                    00086100
086200***************************************************************** 00086200
086300                                                                  00086300
086400     PERFORM 2050C-VERIFY-WDMO-DEALER                             00086400
086500     IF WDMO-DEALER AND SSTK-SUCCESSFUL                           00086500
086600        PERFORM 5000C-PROCESS-GEVIS-DETAIL-REC                    00086600
086700     END-IF                                                       00086700
086800     PERFORM 2020C-FETCH-MEXW001-CSR                              00086800
086900     .                                                            00086900
087000                                                                  00087000
087100 2010C-OPEN-MEXW001-CSR.                                          00087100
087200***************************************************************** 00087200
087300* OPENS THE MAIN DRIVING CURSOR WHICH WILL PULL ROWS FROM TABLE   00087300
087400* MEXW001 THAT ARE 1 MODEL YEAR BACK AND 2 MODEL YEARS FORWARD    00087400
087500* FROM THE CURRENT YEAR.                                          00087500
087600***************************************************************** 00087600
087700                                                                  00087700
087800     MOVE SYSPARM-VIN                                             00087800
087900       TO VEH-VIN-FULL-C                                          00087900
088000     MOVE LIT-Y                                                   00088000
088100       TO VEH-ACTIVE-F                                            00088100
088200                                                                  00088200
088300     EXEC SQL                                                     00088300
088400         OPEN MEXW001_CSR                                         00088400
088500     END-EXEC                                                     00088500
088600                                                                  00088600
088700     MOVE SQLCODE TO SC-DB2-SQLCODE                               00088700
088800                                                                  00088800
088900     IF  NOT SC-DB2-SQLCODE-OK                                    00088900
089000         MOVE SQLCODE                                             00089000
089100           TO DB2-ABEND-SQLCODE                                   00089100
089200         MOVE "OPEN"                                              00089200
089300           TO DB2-ABEND-FUNCTION                                  00089300
089400         MOVE LIT-TBL-VEH-ORDER                                   00089400
089500           TO DB2-ABEND-TABLE                                     00089500
089600         MOVE DB2-ABEND-MSG                                       00089600
089700           TO ABEND-MSG                                           00089700
089800         MOVE "2010C"                                             00089800
089900           TO ABEND-PARAGRAPH                                     00089900
090000         PERFORM 9999I-ABEND                                      00090000
090100     END-IF                                                       00090100
090200     .                                                            00090200
090300                                                                  00090300
090400 2020C-FETCH-MEXW001-CSR.                                         00090400
090500***************************************************************** 00090500
090600* FETCHES A ROW FROM THE MAIN DRIVING CURSOR WHICH WILL PULL ROWS 00090600
090700* FROM TABLE MEXW001 THAT ARE 1 MODEL YEAR BACK AND 2 MODEL       00090700
090800* YEARS FORWARD FROM THE CURRENT YEAR.                            00090800
090900***************************************************************** 00090900
091000                                                                  00091000
091100     EXEC SQL                                                     00091100
091200         FETCH  MEXW001_CSR                                       00091200
091300          INTO                                                    00091300
091400                :VEH-VIN-FULL-C                                   00091400
091500               ,:VEH-ORD-ID-C                                     00091500
091600               ,:VEH-DTA-DATA-SRC-C                               00091600
091700               ,:VEH-BDT-MDL-YR-Y                                 00091700
091800               ,:VEH-WMI-WMI-C                                    00091800
091900               ,:VEH-LCL-PLT-C                                    00091900
092000               ,:VEH-LCL-BDYTYP-C                                 00092000
092100               ,:VEH-GBL-ORD-DLR-C                                00092100
092200               ,:VEH-GBL-SHIP-TO-C                                00092200
092300               ,:VEH-ORD-RCPT-Y                                   00092300
092400               ,:VEH-WDMO-FLEET-C                                 00092400
092500               ,:VEH-WDMO-ORD-TYP                                 00092500
092600               ,:VEH-CATALOG-C                                    00092600
092700               ,:VEH-GBL-CATALOG-C                                00092700
092800               ,:VEH-PO-Y                                         00092800
092900               ,:VEH-GEVIS-VL-C                                   00092900
093000               ,:VEH-COUNTRY-ISO3-C                               00093000
093100     END-EXEC                                                     00093100
093200                                                                  00093200
093300     MOVE SQLCODE                                                 00093300
093400       TO SC-DB2-SQLCODE                                          00093400
093500                                                                  00093500
093600     EVALUATE TRUE                                                00093600
093700        WHEN SC-DB2-SQLCODE-OK                                    00093700
093800             ADD +1                                               00093800
093900              TO WS-NBR-ROWS-READ-MEXW001                         00093900
094000             SET MEXW001-FOUND                                    00094000
094100              TO TRUE                                             00094100
094200        WHEN SC-DB2-SQLCODE-END-OF-CURSOR                         00094200
094300             SET MEXW001-NOT-FOUND                                00094300
094400              TO TRUE                                             00094400
094500        WHEN OTHER                                                00094500
094600             MOVE SQLCODE                                         00094600
094700               TO DB2-ABEND-SQLCODE                               00094700
094800             MOVE "FETCH"                                         00094800
094900               TO DB2-ABEND-FUNCTION                              00094900
095000             MOVE LIT-TBL-VEH-ORDER                               00095000
095100               TO DB2-ABEND-TABLE                                 00095100
095200             MOVE DB2-ABEND-MSG                                   00095200
095300               TO ABEND-MSG                                       00095300
095400             MOVE "2020C"                                         00095400
095500               TO ABEND-PARAGRAPH                                 00095500
095600             PERFORM 9999I-ABEND                                  00095600
095700     END-EVALUATE                                                 00095700
095800     .                                                            00095800
095900                                                                  00095900
096000 2030C-CLOSE-MEXW001-CSR.                                         00096000
096100***************************************************************** 00096100
096200* CLOSES THE MAIN DRIVING CURSOR WHICH PULLS ROWS FROM TABLE      00096200
096300* MEXW001 THAT ARE 1 MODEL YEAR BACK AND 2 MODEL YEARS FORWARD    00096300
096400* FROM THE CURRENT YEAR.                                          00096400
096500***************************************************************** 00096500
096600                                                                  00096600
096700     EXEC SQL                                                     00096700
096800         CLOSE MEXW001_CSR                                        00096800
096900     END-EXEC                                                     00096900
097000                                                                  00097000
097100     MOVE SQLCODE TO SC-DB2-SQLCODE                               00097100
097200                                                                  00097200
097300     IF  NOT SC-DB2-SQLCODE-OK                                    00097300
097400         MOVE SQLCODE                                             00097400
097500           TO DB2-ABEND-SQLCODE                                   00097500
097600         MOVE "CLOSE"                                             00097600
097700           TO DB2-ABEND-FUNCTION                                  00097700
097800         MOVE LIT-TBL-VEH-ORDER                                   00097800
097900           TO DB2-ABEND-TABLE                                     00097900
098000         MOVE DB2-ABEND-MSG                                       00098000
098100           TO ABEND-MSG                                           00098100
098200         MOVE "2030C"                                             00098200
098300           TO ABEND-PARAGRAPH                                     00098300
098400         PERFORM 9999I-ABEND                                      00098400
098500     END-IF                                                       00098500
098600     .                                                            00098600
098700                                                                  00098700
098800 2040C-PROCESS-SALE-CHK-CSR.                                      00098800
098900***************************************************************** 00098900
099000* THIS PARAGRAPH IS USED TO PROCESS ROWS SELECTED FROM THE        00099000
099100* SALE_CHK_CSR WHICH CONTAINS VEHICLES THAT HAVE BEEN REPORTED    00099100
099200* AS SOLD WITHIN THE PAST 12 MONTHS AND THAT ARE OLDER THAN 1     00099200
099300* MODEL YEAR FROM THE CURRENT YEAR. FIRST, WE WILL VERIFY IF      00099300
099400* THE DEALER IS WDMO BASED AND IF IT IS, WE WILL THEN MOVE ALL    00099400
099500* DATA FOR THE VEHICLE TO THE OUTPUT RECORD.  AFTERWARDS, THE     00099500
099600* NEXT ROW WILL BE SELECTED FROM THE SALE_CHK_CSR.                00099600
099700***************************************************************** 00099700
099800     PERFORM 2050C-VERIFY-WDMO-DEALER                             00099800
099900     IF WDMO-DEALER AND SSTK-SUCCESSFUL                           00099900
100000        PERFORM 5000C-PROCESS-GEVIS-DETAIL-REC                    00100000
100100     END-IF                                                       00100100
100200     PERFORM 2120C-FETCH-SALE-CHK-CSR                             00100200
100300     .                                                            00100300
100400                                                                  00100400
100500***************************************************************** 00100500
100600* A CALL IS PLACED TO SUBROUTINE EXWWSSTK IN ORDER TO OBTAIN THE  00100600
100700* CURRENT STOCKING DEALER FOR A VEHICLE.  AFTERWARDS, USING THE   00100700
100800* CURRENT STOCKING DEALER (IF ONE WAS FOUND), A CALL WILL BE      00100800
100900* PLACED TO TABLE MEXW035 TO DETERMINE WHETHER OR NOT THE STOCK-  00100900
101000* ING DEALER IS WDMO BASED.                                       00101000
101100***************************************************************** 00101100
101200 2050C-VERIFY-WDMO-DEALER.                                        00101200
101300                                                                  00101300
101400     PERFORM 2060C-CALL-EXWWSSTK                                  00101400
101500     IF SSTK-SUCCESSFUL                                           00101500
101600                                                                  00101600
101700        MOVE SSTK-GBL-STK-DLR-C                                   00101700
101800          TO WS-VST-GBL-LOC-C-REFORMAT                            00101800
101900        MOVE WS-VST-GBL-LOC-C-REFORMAT                            00101900
102000          TO DLR-DLR-DLR-C                                        00102000
102100        PERFORM 5050C-GET-MEXW035-DATA                            00102100
102200        IF MEXW035-FOUND                                          00102200
102300                                                                  00102300
102400           IF DLR-SUB-SUBLVL1-C  = "WDM"                          00102400
102500              SET WDMO-DEALER                                     00102500
102600               TO TRUE                                            00102600
102700           ELSE                                                   00102700
102800              SET NOT-WDMO-DEALER                                 00102800
102900               TO TRUE                                            00102900
103000           END-IF                                                 00103000
103100                                                                  00103100
103200        ELSE                                                      00103200
103300           SET NOT-WDMO-DEALER                                    00103300
103400            TO TRUE                                               00103400
103500        END-IF                                                    00103500
103600                                                                  00103600
103700     END-IF                                                       00103700
103800     .                                                            00103800
103900                                                                  00103900
104000 2060C-CALL-EXWWSSTK.                                             00104000
104100***************************************************************** 00104100
104200* USING PRODUCTION SOURCE AND ORDER-ID, A CALL WILL NOW BE PLACED 00104200
104300* TO SUBROUTINE EXWWSSTK TO OBTAIN THE CURRENT STOCKING DEALER,   00104300
104400* CURRENT STOCKING DEALER STATUS CODE AND CURRENT STOCKING        00104400
104500* DEALER STATUS DATE.                                             00104500
104600***************************************************************** 00104600
104700     INITIALIZE SSTK-I-O-DATA                                     00104700
104800     SET SSTK-INQUIRY-MODE                                        00104800
104900      TO TRUE                                                     00104900
105000     MOVE VEH-ORD-ID-C                                            00105000
105100       TO SSTK-VEH-ORD-ID-C                                       00105100
105200     MOVE VEH-DTA-DATA-SRC-C                                      00105200
105300       TO SSTK-DTA-DATA-SRC-C                                     00105300
105400                                                                  00105400
105500     CALL  "EXWWSSTK"  USING SSTK-I-O-DATA                        00105500
105600                                                                  00105600
105700     EVALUATE TRUE                                                00105700
105800                                                                  00105800
105900        WHEN SSTK-SUCCESSFUL                                      00105900
106000             ADD 1                                                00106000
106100              TO WS-NBR-EXWWSSTK-CALLS                            00106100
106200                                                                  00106200
106300        WHEN SSTK-DB2-ERROR                                       00106300
106400             PERFORM 2070C-SSTK-FATAL-ERROR                       00106400
106500                                                                  00106500
106600     END-EVALUATE                                                 00106600
106700     .                                                            00106700
106800                                                                  00106800
106900 2070C-SSTK-FATAL-ERROR.                                          00106900
107000******************************************************************00107000
107100* THIS PARAGRAPH HANDLES THE FATAL ERROR TOMBSTONE FORMATTING OF  00107100
107200* THE CALL THAT WAS PLACED TO SUBROUTINE EXWWSSTK.                00107200
107300******************************************************************00107300
107400                                                                  00107400
107500     MOVE SPACES                                                  00107500
107600       TO AUDIT-RECORD                                            00107600
107700     WRITE AUDIT-RECORD                                           00107700
107800                                                                  00107800
107900     MOVE "PGM NAME: "                                            00107900
108000       TO AUDIT-LABEL-MSG                                         00108000
108100     MOVE SSTK-PGM-ID                                             00108100
108200       TO AUDIT-DATA-MSG                                          00108200
108300     WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                     00108300
108400                                                                  00108400
108500     MOVE "RET CODE: "                                            00108500
108600       TO AUDIT-LABEL-MSG                                         00108600
108700     MOVE SSTK-RETURN-CD                                          00108700
108800       TO AUDIT-DATA-MSG                                          00108800
108900     WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                     00108900
109000                                                                  00109000
109100     MOVE "PARAGRAPH: "                                           00109100
109200       TO AUDIT-LABEL-MSG                                         00109200
109300     MOVE SSTK-PARAGRAPH                                          00109300
109400       TO AUDIT-DATA-MSG                                          00109400
109500     WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                     00109500
109600                                                                  00109600
109700     MOVE SPACES                                                  00109700
109800       TO AUDIT-RECORD                                            00109800
109900     WRITE AUDIT-RECORD                                           00109900
110000                                                                  00110000
110100     MOVE "TBL NAME1: "                                           00110100
110200       TO AUDIT-LABEL-MSG                                         00110200
110300     MOVE SSTK-DB2-TABLE1                                         00110300
110400       TO AUDIT-DATA-MSG                                          00110400
110500     WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                     00110500
110600                                                                  00110600
110700     IF SSTK-DB2-TABLE2 > SPACES                                  00110700
110800        MOVE "TBL NAME2: "                                        00110800
110900          TO AUDIT-LABEL-MSG                                      00110900
111000        MOVE SSTK-DB2-TABLE2                                      00111000
111100          TO AUDIT-DATA-MSG                                       00111100
111200        WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                  00111200
111300     END-IF                                                       00111300
111400                                                                  00111400
111500     IF SSTK-DB2-TABLE3 > SPACES                                  00111500
111600        MOVE "TBL NAME3: "                                        00111600
111700          TO AUDIT-LABEL-MSG                                      00111700
111800        MOVE SSTK-DB2-TABLE3                                      00111800
111900          TO AUDIT-DATA-MSG                                       00111900
112000        WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                  00112000
112100     END-IF                                                       00112100
112200                                                                  00112200
112300     IF SSTK-DB2-TABLE4 > SPACES                                  00112300
112400        MOVE "TBL NAME4: "                                        00112400
112500          TO AUDIT-LABEL-MSG                                      00112500
112600        MOVE SSTK-DB2-TABLE4                                      00112600
112700          TO AUDIT-DATA-MSG                                       00112700
112800        WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                  00112800
112900     END-IF                                                       00112900
113000                                                                  00113000
113100     IF SSTK-DB2-TABLE5 > SPACES                                  00113100
113200        MOVE "TBL NAME5: "                                        00113200
113300          TO AUDIT-LABEL-MSG                                      00113300
113400        MOVE SSTK-DB2-TABLE5                                      00113400
113500          TO AUDIT-DATA-MSG                                       00113500
113600        WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                  00113600
113700     END-IF                                                       00113700
113800                                                                  00113800
113900     MOVE SPACES                                                  00113900
114000       TO AUDIT-RECORD                                            00114000
114100     WRITE AUDIT-RECORD                                           00114100
114200                                                                  00114200
114300     MOVE "HOST VAR1: "                                           00114300
114400       TO AUDIT-LABEL-MSG                                         00114400
114500     MOVE SSTK-HOST-VAR1                                          00114500
114600       TO AUDIT-DATA-MSG                                          00114600
114700     WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                     00114700
114800                                                                  00114800
114900     IF SSTK-HOST-VAR2 > SPACES                                   00114900
115000        MOVE "HOST VAR2: "                                        00115000
115100          TO AUDIT-LABEL-MSG                                      00115100
115200        MOVE SSTK-HOST-VAR2                                       00115200
115300          TO AUDIT-DATA-MSG                                       00115300
115400        WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                  00115400
115500     END-IF                                                       00115500
115600                                                                  00115600
115700     IF SSTK-HOST-VAR3 > SPACES                                   00115700
115800        MOVE "HOST VAR3: "                                        00115800
115900          TO AUDIT-LABEL-MSG                                      00115900
116000        MOVE SSTK-HOST-VAR3                                       00116000
116100          TO AUDIT-DATA-MSG                                       00116100
116200        WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                  00116200
116300     END-IF                                                       00116300
116400                                                                  00116400
116500     IF SSTK-HOST-VAR4 > SPACES                                   00116500
116600        MOVE "HOST VAR4: "                                        00116600
116700          TO AUDIT-LABEL-MSG                                      00116700
116800        MOVE SSTK-HOST-VAR4                                       00116800
116900          TO AUDIT-DATA-MSG                                       00116900
117000        WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                  00117000
117100     END-IF                                                       00117100
117200                                                                  00117200
117300     IF SSTK-HOST-VAR5 > SPACES                                   00117300
117400        MOVE "HOST VAR5: "                                        00117400
117500          TO AUDIT-LABEL-MSG                                      00117500
117600        MOVE SSTK-HOST-VAR5                                       00117600
117700          TO AUDIT-DATA-MSG                                       00117700
117800        WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                  00117800
117900     END-IF                                                       00117900
118000                                                                  00118000
118100     IF SSTK-HOST-VAR6 > SPACES                                   00118100
118200        MOVE "HOST VAR6: "                                        00118200
118300          TO AUDIT-LABEL-MSG                                      00118300
118400        MOVE SSTK-HOST-VAR6                                       00118400
118500          TO AUDIT-DATA-MSG                                       00118500
118600        WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                  00118600
118700     END-IF                                                       00118700
118800                                                                  00118800
118900     IF SSTK-HOST-VAR7 > SPACES                                   00118900
119000        MOVE "HOST VAR7: "                                        00119000
119100          TO AUDIT-LABEL-MSG                                      00119100
119200        MOVE SSTK-HOST-VAR7                                       00119200
119300          TO AUDIT-DATA-MSG                                       00119300
119400        WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                  00119400
119500     END-IF                                                       00119500
119600                                                                  00119600
119700     IF SSTK-HOST-VAR8 > SPACES                                   00119700
119800        MOVE "HOST VAR8: "                                        00119800
119900          TO AUDIT-LABEL-MSG                                      00119900
120000        MOVE SSTK-HOST-VAR8                                       00120000
120100          TO AUDIT-DATA-MSG                                       00120100
120200        WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                  00120200
120300     END-IF                                                       00120300
120400                                                                  00120400
120500     MOVE SPACES                                                  00120500
120600       TO AUDIT-RECORD                                            00120600
120700     WRITE AUDIT-RECORD                                           00120700
120800                                                                  00120800
120900     MOVE "SQL CODE: "                                            00120900
121000       TO AUDIT-LABEL-MSG                                         00121000
121100     MOVE SSTK-SQL-RETURN-CODE                                    00121100
121200       TO WS-PROCESS-SQLCODE-EDIT                                 00121200
121300     MOVE WS-PROCESS-SQLCODE-EDIT                                 00121300
121400       TO AUDIT-DATA-MSG                                          00121400
121500     WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                     00121500
121600                                                                  00121600
121700     IF SSTK-SQL-WARNING > SPACES                                 00121700
121800        MOVE "SQL-WARN: "                                         00121800
121900          TO AUDIT-LABEL-MSG                                      00121900
122000        MOVE  SSTK-SQL-WARNING                                    00122000
122100          TO AUDIT-DATA-MSG                                       00122100
122200        WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                  00122200
122300     END-IF                                                       00122300
122400                                                                  00122400
122500     MOVE "SQL-FUNC: "                                            00122500
122600       TO AUDIT-LABEL-MSG                                         00122600
122700     MOVE SSTK-SQL-FUNCTION                                       00122700
122800       TO AUDIT-DATA-MSG                                          00122800
122900     WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                     00122900
123000                                                                  00123000
123100     MOVE "SQL-MSG1: "                                            00123100
123200       TO AUDIT-LABEL-MSG                                         00123200
123300     MOVE  SSTK-SQL-MSG1                                          00123300
123400       TO AUDIT-DATA-MSG                                          00123400
123500     WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                     00123500
123600                                                                  00123600
123700     MOVE "SQL-MSG2: "                                            00123700
123800       TO AUDIT-LABEL-MSG                                         00123800
123900     MOVE SSTK-SQL-MSG2                                           00123900
124000       TO AUDIT-DATA-MSG                                          00124000
124100     WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                     00124100
124200                                                                  00124200
124300     MOVE "SQL-MSG3: "                                            00124300
124400       TO AUDIT-LABEL-MSG                                         00124400
124500     MOVE SSTK-SQL-MSG3                                           00124500
124600       TO AUDIT-DATA-MSG                                          00124600
124700     WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                     00124700
124800                                                                  00124800
124900     MOVE "SQL-MSG4: "                                            00124900
125000       TO AUDIT-LABEL-MSG                                         00125000
125100     MOVE SSTK-SQL-MSG4                                           00125100
125200       TO AUDIT-DATA-MSG                                          00125200
125300     WRITE AUDIT-RECORD FROM AUDIT-RECORD-MSG                     00125300
125400                                                                  00125400
125500     MOVE SPACES                                                  00125500
125600       TO AUDIT-RECORD                                            00125600
125700     WRITE AUDIT-RECORD                                           00125700
125800                                                                  00125800
125900     IF SSTK-SQL-RETURN-CODE = 100                                00125900
126000        SET SEND-EMAIL                                            00126000
126100         TO TRUE                                                  00126100
126200        ADD 1                                                     00126200
126300         TO WS-NBR-EXWWSSTK-NOTFOUND-CALLS                        00126300
126400     ELSE                                                         00126400
126500        PERFORM 9999C-CALL-COREDUMP                               00126500
126600     END-IF                                                       00126600
126700     .                                                            00126700
126800                                                                  00126800
126900 2100C-OPEN-SALE-CHK-CSR.                                         00126900
127000***************************************************************** 00127000
127100* OPENS THE SALES CHECK CURSOR WHICH RETRIEVES ALL SALES THAT     00127100
127200* HAVE OCCURRED IN THE PAST 12 MONTHS THAT HAVE A MODEL YEAR THAT 00127200
127300* IS OLDER THAN 1 YEAR FROM THE CURRENT YEAR.                     00127300
127400***************************************************************** 00127400
127500                                                                  00127500
127600     MOVE SYSPARM-VIN                                             00127600
127700       TO VEH-VIN-FULL-C                                          00127700
127800     MOVE LIT-Y                                                   00127800
127900       TO VRS-ACTIVE-F                                            00127900
128000                                                                  00128000
128100     EXEC SQL                                                     00128100
128200         OPEN SALE_CHK_CSR                                        00128200
128300     END-EXEC                                                     00128300
128400                                                                  00128400
128500     MOVE SQLCODE TO SC-DB2-SQLCODE                               00128500
128600                                                                  00128600
128700     IF  NOT SC-DB2-SQLCODE-OK                                    00128700
128800         MOVE SQLCODE                                             00128800
128900           TO DB2-ABEND-SQLCODE                                   00128900
129000         MOVE "OPEN"                                              00129000
129100           TO DB2-ABEND-FUNCTION                                  00129100
129200         MOVE LIT-SALE-CHK-CSR                                    00129200
129300           TO DB2-ABEND-TABLE                                     00129300
129400         MOVE DB2-ABEND-MSG                                       00129400
129500           TO ABEND-MSG                                           00129500
129600         MOVE "2100C"                                             00129600
129700           TO ABEND-PARAGRAPH                                     00129700
129800         PERFORM 9999I-ABEND                                      00129800
129900     END-IF                                                       00129900
130000     .                                                            00130000
130100                                                                  00130100
130200 2120C-FETCH-SALE-CHK-CSR.                                        00130200
130300***************************************************************** 00130300
130400* FETCHES A ROW FROM THE SALES CHECK CURSOR WHICH RETRIEVES ALL   00130400
130500* SALES THAT HAVE OCCURRED IN THE PAST 12 MONTHS THAT HAVE A      00130500
130600* MODEL YEAR THAT IS OLDER THAN 1 YEAR FROM THE CURRENT YEAR.     00130600
130700***************************************************************** 00130700
130800                                                                  00130800
130900     EXEC SQL                                                     00130900
131000         FETCH  SALE_CHK_CSR                                      00131000
131100          INTO                                                    00131100
131200                :VEH-VIN-FULL-C                                   00131200
131300               ,:VEH-ORD-ID-C                                     00131300
131400               ,:VEH-DTA-DATA-SRC-C                               00131400
131500               ,:VEH-BDT-MDL-YR-Y                                 00131500
131600               ,:VEH-WMI-WMI-C                                    00131600
131700               ,:VEH-LCL-PLT-C                                    00131700
131800               ,:VEH-LCL-BDYTYP-C                                 00131800
131900               ,:VEH-GBL-ORD-DLR-C                                00131900
132000               ,:VEH-GBL-SHIP-TO-C                                00132000
132100               ,:VEH-ORD-RCPT-Y                                   00132100
132200               ,:VEH-WDMO-FLEET-C                                 00132200
132300               ,:VEH-WDMO-ORD-TYP                                 00132300
132400               ,:VEH-CATALOG-C                                    00132400
132500               ,:VEH-GBL-CATALOG-C                                00132500
132600               ,:VEH-PO-Y                                         00132600
132700               ,:VEH-GEVIS-VL-C                                   00132700
132800               ,:VEH-COUNTRY-ISO3-C                               00132800
132900     END-EXEC                                                     00132900
133000                                                                  00133000
133100     MOVE SQLCODE                                                 00133100
133200       TO SC-DB2-SQLCODE                                          00133200
133300                                                                  00133300
133400     EVALUATE TRUE                                                00133400
133500        WHEN SC-DB2-SQLCODE-OK                                    00133500
133600             ADD +1                                               00133600
133700              TO WS-NBR-ROWS-READ-SALE-CHK                        00133700
133800             SET SALE-CHK-FOUND                                   00133800
133900              TO TRUE                                             00133900
134000        WHEN SC-DB2-SQLCODE-END-OF-CURSOR                         00134000
134100             SET SALE-CHK-NOT-FOUND                               00134100
134200              TO TRUE                                             00134200
134300        WHEN OTHER                                                00134300
134400             MOVE SQLCODE                                         00134400
134500               TO DB2-ABEND-SQLCODE                               00134500
134600             MOVE "FETCH"                                         00134600
134700               TO DB2-ABEND-FUNCTION                              00134700
134800             MOVE LIT-SALE-CHK-CSR                                00134800
134900               TO DB2-ABEND-TABLE                                 00134900
135000             MOVE DB2-ABEND-MSG                                   00135000
135100               TO ABEND-MSG                                       00135100
135200             MOVE "2120C"                                         00135200
135300               TO ABEND-PARAGRAPH                                 00135300
135400             PERFORM 9999I-ABEND                                  00135400
135500     END-EVALUATE                                                 00135500
135600     .                                                            00135600
135700                                                                  00135700
135800 2140C-CLOSE-SALE-CHK-CSR.                                        00135800
135900***************************************************************** 00135900
136000* CLOSES THE SALES CHECK CURSOR WHICH RETRIEVES ALL SALES THAT    00136000
136100* HAVE OCCURRED IN THE PAST 12 MONTHS THAT HAVE A MODEL YEAR THAT 00136100
136200* IS OLDER THAN 1 YEAR FROM THE CURRENT YEAR.                     00136200
136300***************************************************************** 00136300
136400                                                                  00136400
136500     EXEC SQL                                                     00136500
136600         CLOSE SALE_CHK_CSR                                       00136600
136700     END-EXEC                                                     00136700
136800                                                                  00136800
136900     MOVE SQLCODE TO SC-DB2-SQLCODE                               00136900
137000                                                                  00137000
137100     IF  NOT SC-DB2-SQLCODE-OK                                    00137100
137200         MOVE SQLCODE                                             00137200
137300           TO DB2-ABEND-SQLCODE                                   00137300
137400         MOVE "CLOSE"                                             00137400
137500           TO DB2-ABEND-FUNCTION                                  00137500
137600         MOVE LIT-SALE-CHK-CSR                                    00137600
137700           TO DB2-ABEND-TABLE                                     00137700
137800         MOVE DB2-ABEND-MSG                                       00137800
137900           TO ABEND-MSG                                           00137900
138000         MOVE "2140C"                                             00138000
138100           TO ABEND-PARAGRAPH                                     00138100
138200         PERFORM 9999I-ABEND                                      00138200
138300     END-IF                                                       00138300
138400     .                                                            00138400
138500                                                                  00138500
138600***************************************************************** 00138600
138700* AT THIS POINT, THE VEHICLE HAS BEEN IDENTIFED AS HAVING A       00138700
138800* CURRENT STOCKING DEALER THAT IS CLASSIFIED AS WDMO.  NOW, OTHER 00138800
138900* DATA WILL BE GATHERED FOR THE VEHICLE AND THEN MOVED AND        00138900
139000* WRITTEN TO THE OUTPUT FILE.                                     00139000
139100*                                                                 00139100
139200***************************************************************** 00139200
139300                                                                  00139300
139400 5000C-PROCESS-GEVIS-DETAIL-REC.                                  00139400
139500                                                                  00139500
139600     SET WERS-STRING-NOT-FOUND-SW     TO TRUE                     00139600
139700     INITIALIZE                          MEXW004-VEH-WERS-STRING  00139700
139800                                         VWR-WERS-STRING-X-TEXT   00139800
139900                                                                  00139900
140000     MOVE VEH-DTA-DATA-SRC-C          TO VWR-DTA-DATA-SRC-C       00140000
140100     MOVE VEH-ORD-ID-C                TO VWR-VEH-ORD-ID-C         00140100
140200                                                                  00140200
140300     PERFORM 7600C-SELECT-WERS-DATA-W004                          00140300
140400                                                                  00140400
140500     MOVE LIT-E                                                   00140500
140600       TO WS-DTL-VEH-DIVISION-C                                   00140600
140700                                                                  00140700
140800     PERFORM 5020C-MOVE-MEXW001-TO-DTL                            00140800
140900     PERFORM 5060C-OBTAIN-RETAIL-DATA                             00140900
141000     PERFORM 5040C-MOVE-SSTK-CURRENT-TO-DTL                       00141000
141100     PERFORM 5080C-OBTAIN-WHOLESALE-DATA                          00141100
141200     PERFORM 5100C-OBTAIN-WERS-DATA                               00141200
141300                                                                  00141300
141400     PERFORM 5120C-OBTAIN-MEXW003-20T                             00141400
141500     IF MEXW003-FOUND-20T                                         00141500
141600        STRING VST-STAT-Y (1:4)                                   00141600
141700               VST-STAT-Y (6:2)                                   00141700
141800               VST-STAT-Y (9:2)                                   00141800
141900          DELIMITED BY SIZE                                       00141900
142000          INTO WS-DTL-VEH-SCHD-VST-TARGET-Y                       00142000
142100        END-STRING                                                00142100
142200     END-IF                                                       00142200
142300                                                                  00142300
142400     PERFORM 5140C-OBTAIN-MEXW003-30R                             00142400
142500     IF MEXW003-FOUND-30R                                         00142500
142600        STRING VST-STAT-Y (1:4)                                   00142600
142700               VST-STAT-Y (6:2)                                   00142700
142800               VST-STAT-Y (9:2)                                   00142800
142900          DELIMITED BY SIZE                                       00142900
143000          INTO WS-DTL-VEH-PRODUCE-VST-STAT-Y                      00143000
143100        END-STRING                                                00143100
143200     ELSE                                                         00143200
143300        PERFORM 5160C-OBTAIN-MEXW003-30P                          00143300
143400        IF MEXW003-FOUND-30P                                      00143400
143500           STRING VST-STAT-Y (1:4)                                00143500
143600                  VST-STAT-Y (6:2)                                00143600
143700                  VST-STAT-Y (9:2)                                00143700
143800             DELIMITED BY SIZE                                    00143800
143900             INTO WS-DTL-VEH-PRODUCE-VST-STAT-Y                   00143900
144000           END-STRING                                             00144000
144100        END-IF                                                    00144100
144200     END-IF                                                       00144200
144300                                                                  00144300
144400     PERFORM 5180C-OBTAIN-MEXW003-30T                             00144400
144500     IF MEXW003-FOUND-30T                                         00144500
144600        STRING VST-STAT-Y (1:4)                                   00144600
144700               VST-STAT-Y (6:2)                                   00144700
144800               VST-STAT-Y (9:2)                                   00144800
144900          DELIMITED BY SIZE                                       00144900
145000          INTO WS-DTL-VEH-RELEASE-VST-STAT-Y                      00145000
145100        END-STRING                                                00145100
145200     END-IF                                                       00145200
145300                                                                  00145300
145400     PERFORM 5200C-OBTAIN-MEXW003-80F                             00145400
145500     IF MEXW003-FOUND-80F                                         00145500
145600        STRING VST-STAT-Y (1:4)                                   00145600
145700               VST-STAT-Y (6:2)                                   00145700
145800               VST-STAT-Y (9:2)                                   00145800
145900          DELIMITED BY SIZE                                       00145900
146000          INTO WS-DTL-VEH-ARRIVAL-VST-STAT-Y                      00146000
146100        END-STRING                                                00146100
146200     END-IF                                                       00146200
146300                                                                  00146300
146400     PERFORM 5220C-OPEN-40V-CSR                                   00146400
146500     PERFORM 5230C-FETCH-40V-ROW                                  00146500
146600     IF MEXW003-40V-CSR-ROW-FOUND                                 00146600
146700        MOVE VST-GBL-LOC-C                                        00146700
146800          TO WS-DTL-LAST-QAD-VST-GBL-LOC-C                        00146800
146900     END-IF                                                       00146900
147000                                                                  00147000
147100     PERFORM 5240C-CLOSE-40V-CSR                                  00147100
147200     IF   WS-COUNT-DTL-NBR  = 999999                              00147200
147300          MOVE ZERO                                               00147300
147400            TO WS-COUNT-DTL-NBR                                   00147400
147500     END-IF                                                       00147500
147600     IF   WS-COUNT-LINE-NBR = 999999                              00147600
147700          MOVE ZERO                                               00147700
147800            TO WS-COUNT-LINE-NBR                                  00147800
147900     END-IF                                                       00147900
148000                                                                  00148000
148100     IF MEXW027-FOUND                                             00148100
148200         INITIALIZE WS-DTL-HUB-REC-ID-NBR                         00148200
148300         ADD  +1                                                  00148300
148400          TO  WS-COUNT-DTL-NBR                                    00148400
148500              WS-COUNT-LINE-NBR                                   00148500
148600         MOVE WS-COUNT-LINE-NBR                                   00148600
148700           TO WS-DTL-REC-ID-NBR                                   00148700
148800              WS-DTL-HUB-LINE-NBR                                 00148800
148900         MOVE LIT-001                                             00148900
149000           TO WS-DTL-HUB-REC-SEQ-NBR                              00149000
149100         MOVE LIT-010                                             00149100
149200           TO WS-DTL-HUB-REC-TYPE                                 00149200
149300                                                                  00149300
149400         MOVE WS-VINCENT-DETAIL-RECORD                            00149400
149500           TO WS-VINCENT-OUTPUT-RECORD                            00149500
149600         PERFORM 6000C-WRITE-VINCENT-RECORD                       00149600
149700         PERFORM 9400I-INCREMENT-CHKP-COUNT                       00149700
149800     END-IF                                                       00149800
149900                                                                  00149900
150000     INITIALIZE  WS-VINCENT-DETAIL-RECORD                         00150000
150100     .                                                            00150100
150200                                                                  00150200
150300***************************************************************** 00150300
150400* DATA THAT WAS PREVIOUSLY FETCHED FROM TABLE MEXW001 WILL NOW    00150400
150500* BE MOVED TO THE OUTPUT RECORD.                                  00150500
150600* E-TRACKER 6726596 CHANGE:  THE BODY STYLE INFORMATION WILL BE   00150600
150700* RETRIEVED FROM TABLE MEXW031_CATMAP FOR NON 'NA' AND NON 'EA'   00150700
150800* SOURCES.                                                        00150800
150900* NOTE: IF THE NON 'NA' AND NON 'EA' SOURCES ARE NOT FOUND ON     00150900
151000* TABLE MEXW031, THEN WE WILL MOVE THE VEH-LCL-BDYTYP-C WHICH     00151000
151100* WAS RETRIEVED FROM TABLE MEXW001.                               00151100
151200*                                                                 00151200
151300* THE MEXW031-CSR WHEN EXECUTED, BRINGS BACK ONE ROW.             00151300
151400*                                                                 00151400
151500* BODY STYLE - VWR-WERS-STRING-TEXT(10:2) IS THE WERS OPTION      00151500
151600*              CODE FOR BODY STYLE FROM TABLE MEXW004             00151600
151700* WHEN MEXW031-CSR IS EXECUTED, IT ONLY BRINGS BACK ONE ROW       00151700
151800* FOR PROCESSING.                                                 00151800
151900*                                                                 00151900
152000***************************************************************** 00152000
152100 5020C-MOVE-MEXW001-TO-DTL.                                       00152100
152200                                                                  00152200
152300     MOVE VEH-VIN-FULL-C                                          00152300
152400       TO WS-DTL-VIN-FULL-C                                       00152400
152500     MOVE VEH-DTA-DATA-SRC-C                                      00152500
152600       TO WS-DTL-DTA-DATA-SRC-C                                   00152600
152700     MOVE VEH-BDT-MDL-YR-Y                                        00152700
152800       TO WS-VEH-BDT-MDL-YR-Y                                     00152800
152900     MOVE WS-VEH-BDT-MDL-YR-YY                                    00152900
153000       TO WS-DTL-BDT-MDL-YR-Y                                     00153000
153100     MOVE VEH-WMI-WMI-C                                           00153100
153200       TO WS-DTL-WMI-WMI-C                                        00153200
153300     MOVE VEH-LCL-PLT-C                                           00153300
153400       TO WS-DTL-LCL-PLT-C                                        00153400
153500                                                                  00153500
153600     IF  WERS-STRING-FOUND-SW                                     00153600
153700         MOVE VWR-WERS-STRING-X-TEXT(10:2)                        00153700
153800                                      TO WS-DTL-LCL-BDYTYP-C      00153800
153900     ELSE                                                         00153900
154000        PERFORM 5300C-OPEN-MEXW031-CSR                            00154000
154100        PERFORM 5320C-FETCH-MEXW031-CSR                           00154100
154200        PERFORM 5340C-CLOSE-MEXW031-CSR                           00154200
154300                                                                  00154300
154400        IF MEXW031-FOUND                                          00154400
154500           MOVE CTM-OPT-OPTION-C                                  00154500
154600             TO WS-DTL-LCL-BDYTYP-C                               00154600
154700        ELSE                                                      00154700
154800           MOVE VEH-LCL-BDYTYP-C                                  00154800
154900             TO WS-DTL-LCL-BDYTYP-C                               00154900
155000        END-IF                                                    00155000
155100                                                                  00155100
155200     END-IF                                                       00155200
155300                                                                  00155300
155400     MOVE VEH-GBL-ORD-DLR-C                                       00155400
155500       TO DLR-DLR-DLR-C                                           00155500
155600     PERFORM 5050C-GET-MEXW035-DATA                               00155600
155700     IF MEXW035-FOUND                                             00155700
155800                                                                  00155800
155900        IF DLR-SUPER-DLR-C = ZEROS                                00155900
156000           MOVE SPACES                                            00156000
156100             TO WS-DTL-VEH-GBL-DLR-C                              00156100
156200        ELSE                                                      00156200
156300           MOVE DLR-SUPER-DLR-C                                   00156300
156400             TO WS-DTL-VEH-GBL-DLR-C-REFORMAT                     00156400
156500           MOVE WS-DTL-VEH-GBL-DLR-C-REFORMAT                     00156500
156600             TO WS-DTL-VEH-GBL-DLR-C                              00156600
156700        END-IF                                                    00156700
156800                                                                  00156800
156900     ELSE                                                         00156900
157000        MOVE SPACES                                               00157000
157100          TO WS-DTL-VEH-GBL-DLR-C                                 00157100
157200     END-IF                                                       00157200
157300*    ----------------------------------------------------------   00157300
157400*    THE SHIP TO DEALER IS THE DEALER THAT WAS REPORTED AT THE    00157400
157500*    TIME OF THE ORDER, SO IF IT'S EQUAL TO SPACES, WE WILL USE   00157500
157600*    THE ORIGINAL ORDERING DEALER.                                00157600
157700*    ----------------------------------------------------------   00157700
157800     IF   VEH-GBL-SHIP-TO-C                                       00157800
157900        > SPACES                                                  00157900
158000          MOVE VEH-GBL-SHIP-TO-C                                  00158000
158100            TO WS-DTL-SHIP-TO-DLR-C                               00158100
158200     ELSE                                                         00158200
158300        MOVE WS-DTL-VEH-GBL-DLR-C                                 00158300
158400          TO WS-DTL-SHIP-TO-DLR-C                                 00158400
158500     END-IF                                                       00158500
158600     STRING VEH-ORD-RCPT-Y (1:4)                                  00158600
158700            VEH-ORD-RCPT-Y (6:2)                                  00158700
158800            VEH-ORD-RCPT-Y (9:2)                                  00158800
158900       DELIMITED BY SIZE                                          00158900
159000       INTO WS-DTL-VEH-ORD-RCPT-Y                                 00159000
159100     END-STRING                                                   00159100
159200     MOVE VEH-WDMO-FLEET-C                                        00159200
159300       TO WS-DTL-WDMO-FLEET-C                                     00159300
159400     MOVE VEH-WDMO-ORD-TYP                                        00159400
159500       TO WS-DTL-VEH-WDMO-ORD-TYP                                 00159500
159600     MOVE VEH-GBL-CATALOG-C                                       00159600
159700       TO WS-DTL-VEH-CATALOG-C                                    00159700
159800     IF VEH-PO-Y > '0001-01-01'                                   00159800
159900        STRING VEH-PO-Y (1:4)                                     00159900
160000               VEH-PO-Y (6:2)                                     00160000
160100               VEH-PO-Y (9:2)                                     00160100
160200          DELIMITED BY SIZE                                       00160200
160300          INTO WS-DTL-VEH-PO-Y                                    00160300
160400        END-STRING                                                00160400
160500     END-IF                                                       00160500
160600     MOVE VEH-GEVIS-VL-C                                          00160600
160700       TO WS-DTL-GEVIS-VEH-LINE-C                                 00160700
160800     .                                                            00160800
160900                                                                  00160900
161000                                                                  00161000
161100******************************************************************00161100
161200* THE CURRENT DEALER/STOCKING DEALER, CURRENT STATUS CODE AND     00161200
161300* CURRENT STATUS CODE DATE WERE RETRIEVED EARLIER.  NOW THE CUR-  00161300
161400* RENT VEHICLE'S STATUS CODE WILL BE USED TO OBTAIN THE VINCENT   00161400
161500* EQUIVALENT FROM TABLE MEXW027 USING "VI" AS THE PRODUCTION      00161500
161600* SOURCE.                                                         00161600
161700* NOTE: DURING DEVELOPMENT OF THIS PROGRAM, IT WAS DECIDED TO     00161700
161800* INSERT GLOBAL/LOCAL CODES ON THE MEXW027 CONVERSION TABLE,      00161800
161900* WITH THE VALUES THAT VINCENT USES FOR THEIR VRULES PROCESSING.  00161900
162000* RATHER THAN HARD CODING THE VALUES IN THIS PROGRAM AND THE      00162000
162100* STORED PROCEDURE (EXWWGEVP), IT IS BETTER TO MAKE A DIRECT CALL 00162100
162200* TO THE TABLE WHERE THE CODES CAN BE MORE EASILY CHANGED, SHOULD 00162200
162300* A CHANGE ARISE IN THE FUTURE.                                   00162300
162400* A CHECK HAS BEEN ADDED TO SEND VINCENT A STATUS CODE OF 600     00162400
162500* INSTEAD OF 800 WHEN THERE ARE NO SALES TYPE OR SALES DATE       00162500
162600* AVAILABLE.                                                      00162600
162700******************************************************************00162700
162800 5040C-MOVE-SSTK-CURRENT-TO-DTL.                                  00162800
162900                                                                  00162900
163000     INITIALIZE WS-MEXW027-SW                                     00163000
163100                                                                  00163100
163200     MOVE SSTK-GBL-STK-DLR-C                                      00163200
163300       TO WS-VST-GBL-LOC-C-REFORMAT                               00163300
163400     MOVE WS-VST-GBL-LOC-C-REFORMAT                               00163400
163500       TO DLR-DLR-DLR-C                                           00163500
163600     PERFORM 5050C-GET-MEXW035-DATA                               00163600
163700     IF MEXW035-FOUND                                             00163700
163800                                                                  00163800
163900        IF DLR-SUPER-DLR-C = ZEROS                                00163900
164000           MOVE SPACES                                            00164000
164100             TO WS-DTL-CURR-STOCKING-DLR-C                        00164100
164200                WS-DTL-CURR-DLR-C                                 00164200
164300        ELSE                                                      00164300
164400           MOVE DLR-SUPER-DLR-C                                   00164400
164500             TO WS-DLR-SUPER-DLR-C-REFORMAT                       00164500
164600           MOVE WS-DLR-SUPER-DLR-C-REFORMAT                       00164600
164700             TO WS-DTL-CURR-STOCKING-DLR-C                        00164700
164800                WS-DTL-CURR-DLR-C                                 00164800
164900        END-IF                                                    00164900
165000                                                                  00165000
165100     ELSE                                                         00165100
165200        MOVE SPACES                                               00165200
165300          TO WS-DTL-CURR-STOCKING-DLR-C                           00165300
165400             WS-DTL-CURR-DLR-C                                    00165400
165500     END-IF                                                       00165500
165600                                                                  00165600
165700     IF WS-DTL-CURR-STOCKING-DLR-C  >                             00165700
165800        SPACES                                                    00165800
165900                                                                  00165900
166000        STRING SSTK-CUR-STAT-Y (1:4)                              00166000
166100               SSTK-CUR-STAT-Y (6:2)                              00166100
166200               SSTK-CUR-STAT-Y (9:2)                              00166200
166300            DELIMITED BY SIZE                                     00166300
166400          INTO WS-DTL-VEH-STOCK-VST-STAT-Y                        00166400
166500        END-STRING                                                00166500
166600     END-IF                                                       00166600
166700                                                                  00166700
166800     IF SSTK-CUR-STAT-C > SPACES                                  00166800
166900                                                                  00166900
167000        PERFORM 5045C-SELECT-MEXW027-DATA                         00167000
167100                                                                  00167100
167200        IF MEXW027-NOT-FOUND                                      00167200
167300           PERFORM 9100C-MISSING-MEXW027-ROW                      00167300
167400        END-IF                                                    00167400
167500                                                                  00167500
167600        IF MEXW027-FOUND                                          00167600
167700           MOVE CNT-LCL-DATA-X (1:3)                              00167700
167800             TO WS-DTL-CUR-STA-STATUS-C                           00167800
167900        END-IF                                                    00167900
168000     END-IF                                                       00168000
168100                                                                  00168100
168200     IF WS-DTL-CUR-STA-STATUS-C = LIT-800                         00168200
168300        IF   VRS-TYP-LCL-CUST-C = "A4"                            00168300
168400             MOVE LIT-801                                         00168400
168500               TO WS-DTL-CUR-STA-STATUS-C                         00168500
168600        ELSE                                                      00168600
168700           IF   WS-DTL-VRS-TYP-LCL-CUST-C     = SPACES            00168700
168800             OR WS-DTL-VEH-SLSRCPT-VST-STAT-Y = SPACES            00168800
168900                MOVE LIT-600                                      00168900
169000                  TO WS-DTL-CUR-STA-STATUS-C                      00169000
169100           END-IF                                                 00169100
169200        END-IF                                                    00169200
169300     END-IF                                                       00169300
169400     .                                                            00169400
169500                                                                  00169500
169600******************************************************************00169600
169700* THE VINCENT EQUIVALENT STATUS CODE WILL NOW BE OBTAINED FOR THE 00169700
169800* CURRENT STATUS CODE THAT WAS RETRIEVED FROM SUBROUTINE EXWWSSTK.00169800
169900* SPECIAL NOTE:  WHEN ADDING ROWS TO TABLE MEXW027 FOR VINCENT,   00169900
170000* THE GLOBAL STATUS CODES MUST BE UNIQUE. THE FOLLOWING RULE      00170000
170100* ALSO APPLIES- THERE CAN EXIST ONE LOCAL STATUS CODE THAT CAN    00170100
170200* BE ASSIGNED TO SEVERAL DIFFERENT GLOBAL STATUS CODES (I.E.      00170200
170300* LOCAL CODE = 600 HAS MULTIPLE GLOBAL CODES OF 80J & 90U).       00170300
170400******************************************************************00170400
170500 5045C-SELECT-MEXW027-DATA.                                       00170500
170600                                                                  00170600
170700     MOVE SSTK-CUR-STAT-C                                         00170700
170800       TO CNT-GBL-DATA-X                                          00170800
170900     MOVE LIT-STATUS                                              00170900
171000       TO CNT-CND-CNV-TYP-C                                       00171000
171100     MOVE LIT-VI                                                  00171100
171200       TO CNT-DTA-DATA-SRC-C                                      00171200
171300     EXEC SQL                                                     00171300
171400         SELECT  CNT_LCL_DATA_X                                   00171400
171500           INTO                                                   00171500
171600                 :CNT-LCL-DATA-X                                  00171600
171700           FROM  MEXW027_CONV                                     00171700
171800          WHERE  CND_CNV_TYP_C     = :CNT-CND-CNV-TYP-C           00171800
171900            AND  DTA_DATA_SRC_C    = :CNT-DTA-DATA-SRC-C          00171900
172000            AND  CNT_GBL_DATA_X    = :CNT-GBL-DATA-X              00172000
172100     END-EXEC                                                     00172100
172200                                                                  00172200
172300     MOVE SQLCODE                                                 00172300
172400       TO SC-DB2-SQLCODE                                          00172400
172500                                                                  00172500
172600     EVALUATE TRUE                                                00172600
172700         WHEN SC-DB2-SQLCODE-OK                                   00172700
172800              ADD +1                                              00172800
172900               TO WS-NBR-ROWS-READ-MEXW027                        00172900
173000              SET MEXW027-FOUND                                   00173000
173100               TO TRUE                                            00173100
173200                                                                  00173200
173300          WHEN SC-DB2-SQLCODE-NOT-FOUND                           00173300
173400               SET MEXW027-NOT-FOUND                              00173400
173500                TO TRUE                                           00173500
173600                                                                  00173600
173700         WHEN OTHER                                               00173700
173800              MOVE SQLCODE                                        00173800
173900                TO DB2-ABEND-SQLCODE                              00173900
174000              MOVE "SELECT"                                       00174000
174100                TO DB2-ABEND-FUNCTION                             00174100
174200              MOVE LIT-TBL-CONV                                   00174200
174300                TO DB2-ABEND-TABLE                                00174300
174400              MOVE DB2-ABEND-MSG                                  00174400
174500                TO ABEND-MSG                                      00174500
174600              MOVE "5045C"                                        00174600
174700                TO ABEND-PARAGRAPH                                00174700
174800              PERFORM 9999I-ABEND                                 00174800
174900     END-EVALUATE                                                 00174900
175000     .                                                            00175000
175100                                                                  00175100
175200 5050C-GET-MEXW035-DATA.                                          00175200
175300******************************************************************00175300
175400* A CALL WILL BE PLACED TO TABLE MEXW035 IN EITHER OF TWO SIT-    00175400
175500* UATIONS.  1) TO OBTAIN THE SUPER DEALER CODE WHICH WILL BE      00175500
175600* USED IN PLACE OF THE GLOBAL ORDERING DEALER CODE AND/OR GLOBAL  00175600
175700* CURRENT STOCKING DEALER CODE.  2)  TO DETERMINE WHETHER OR NOT  00175700
175800* THE CURRENT STOCKING DEALER IS WDMO BASED.                      00175800
175900******************************************************************00175900
176000     EXEC SQL                                                     00176000
176100         SELECT                                                   00176100
176200                 SUB_SUBLVL1_C                                    00176200
176300                ,DLR_SUPER_DLR_C                                  00176300
176400           INTO                                                   00176400
176500                :DLR-SUB-SUBLVL1-C                                00176500
176600               ,:DLR-SUPER-DLR-C                                  00176600
176700           FROM  MEXW035_DLR_MSTR                                 00176700
176800          WHERE  DLR_DLR_C           = :DLR-DLR-DLR-C             00176800
176900     END-EXEC                                                     00176900
177000                                                                  00177000
177100     MOVE SQLCODE                                                 00177100
177200       TO SC-DB2-SQLCODE                                          00177200
177300                                                                  00177300
177400     EVALUATE TRUE                                                00177400
177500         WHEN SC-DB2-SQLCODE-OK                                   00177500
177600              ADD 1                                               00177600
177700               TO WS-NBR-ROWS-READ-MEXW035                        00177700
177800              SET MEXW035-FOUND                                   00177800
177900               TO TRUE                                            00177900
178000                                                                  00178000
178100         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00178100
178200              SET MEXW035-NOT-FOUND                               00178200
178300               TO TRUE                                            00178300
178400              PERFORM 9000C-MISSING-MEXW035-ROW                   00178400
178500                                                                  00178500
178600         WHEN OTHER                                               00178600
178700              MOVE SQLCODE                                        00178700
178800                TO DB2-ABEND-SQLCODE                              00178800
178900              MOVE "SELECT"                                       00178900
179000                TO DB2-ABEND-FUNCTION                             00179000
179100              MOVE LIT-TBL-DLR-MSTR                               00179100
179200                TO DB2-ABEND-TABLE                                00179200
179300              MOVE DB2-ABEND-MSG                                  00179300
179400                TO ABEND-MSG                                      00179400
179500              MOVE "5050C"                                        00179500
179600                TO ABEND-PARAGRAPH                                00179600
179700              PERFORM 9999I-ABEND                                 00179700
179800     END-EVALUATE                                                 00179800
179900     .                                                            00179900
180000                                                                  00180000
180100******************************************************************00180100
180200* A JOIN WILL BE DONE ON TABLES MEXW003 & MEXW008 TO OBTAIN       00180200
180300* VARIOUS RETAIL DATA (IF THE VEHICLE IS IN RETAIL STATUS).       00180300
180400* NOTE: THE RETAILED STATUS DATE WILL BE USED TO POPULATE THE     00180400
180500* DELIVERY DATE WHICH IS THE SAME.                                00180500
180600******************************************************************00180600
180700 5060C-OBTAIN-RETAIL-DATA.                                        00180700
180800                                                                  00180800
180900     PERFORM 5065C-SELECT-MEXW008-90V-DATA                        00180900
181000     IF MEXW008-FOUND-90V                                         00181000
181100        STRING VST-STAT-Y (1:4)                                   00181100
181200               VST-STAT-Y (6:2)                                   00181200
181300               VST-STAT-Y (9:2)                                   00181300
181400          DELIMITED BY SIZE                                       00181400
181500          INTO WS-DTL-VEH-RETAIL-VST-STAT-Y                       00181500
181600        END-STRING                                                00181600
181700        MOVE WS-DTL-VEH-RETAIL-VST-STAT-Y                         00181700
181800          TO WS-DTL-VEH-DELIVER-VST-STAT-Y                        00181800
181900        PERFORM 5070C-POPULATE-RETAIL-OUTPUT                      00181900
182000     END-IF                                                       00182000
182100     .                                                            00182100
182200                                                                  00182200
182300******************************************************************00182300
182400* A JOIN WILL BE DONE ON TABLES MEXW003 & MEXW008 TO OBTAIN       00182400
182500* VARIOUS RETAILED DATA (IF THE VEHICLE HAS REACHED RETAIL STATUS)00182500
182600******************************************************************00182600
182700 5065C-SELECT-MEXW008-90V-DATA.                                   00182700
182800                                                                  00182800
182900     MOVE VEH-ORD-ID-C                                            00182900
183000       TO VST-VEH-ORD-ID-C                                        00183000
183100     MOVE VEH-DTA-DATA-SRC-C                                      00183100
183200       TO VST-DTA-DATA-SRC-C                                      00183200
183300     MOVE LIT-90V                                                 00183300
183400       TO VST-STA-STATUS-C                                        00183400
183500     MOVE LIT-Y                                                   00183500
183600       TO VST-LAST-OCCUR-F                                        00183600
183700          VST-ACTIVE-F                                            00183700
183800                                                                  00183800
183900     EXEC SQL                                                     00183900
184000         SELECT                                                   00184000
184100                 A.VST_STAT_Y                                     00184100
184200                ,B.VRS_LCL_FLEET_C                                00184200
184300                ,B.VRS_CST_FIRST_N                                00184300
184400                ,B.VRS_CST_BUS_1_N                                00184400
184500                ,B.VRS_CST_BUS_2_N                                00184500
184600                ,B.VRS_CST_MID_INIT_X                             00184600
184700                ,B.VRS_CST_LAST_N                                 00184700
184800                ,B.VRS_CST_ADDR_1_X                               00184800
184900                ,B.VRS_CST_ADD_DIV2_N                             00184900
185000                ,B.VRS_CST_ADD_DIV1_C                             00185000
185100                ,B.VRS_CST_POSTAL_C                               00185100
185200                ,B.VRS_SALESPERSON_C                              00185200
185300                ,B.VRS_TYP_LCL_CUST_C                             00185300
185400                ,B.VRS_RPT_SALE_Y                                 00185400
185500                ,B.VRS_WARR_STRT_Y                                00185500
185600           INTO                                                   00185600
185700                 :VST-STAT-Y                                      00185700
185800                ,:VRS-LCL-FLEET-C                                 00185800
185900                ,:VRS-CST-FIRST-N                                 00185900
186000                ,:VRS-CST-BUS-1-N                                 00186000
186100                ,:VRS-CST-BUS-2-N                                 00186100
186200                ,:VRS-CST-MID-INIT-X                              00186200
186300                ,:VRS-CST-LAST-N                                  00186300
186400                ,:VRS-CST-ADDR-1-X                                00186400
186500                ,:VRS-CST-ADD-DIV2-N                              00186500
186600                ,:VRS-CST-ADD-DIV1-C                              00186600
186700                ,:VRS-CST-POSTAL-C                                00186700
186800                ,:VRS-SALESPERSON-C                               00186800
186900                ,:VRS-TYP-LCL-CUST-C                              00186900
187000                ,:VRS-RPT-SALE-Y                                  00187000
187100                ,:VRS-WARR-STRT-Y                                 00187100
187200           FROM  MEXW003_VEH_STATUS A                             00187200
187300                ,MEXW008_VEH_RTL B                                00187300
187400          WHERE  A.VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C          00187400
187500            AND  A.DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C        00187500
187600            AND  A.STA_STATUS_C      = :VST-STA-STATUS-C          00187600
187700            AND  A.VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F          00187700
187800            AND  A.VST_ACTIVE_F      = :VST-ACTIVE-F              00187800
187900            AND  A.VST_ACTIVE_F      = B.VRS_ACTIVE_F             00187900
188000            AND  A.STA_STATUS_C      = B.STA_STATUS_C             00188000
188100            AND  A.VEH_ORD_ID_C      = B.VEH_ORD_ID_C             00188100
188200            AND  A.DTA_DATA_SRC_C    = B.DTA_DATA_SRC_C           00188200
188300            AND  SUBSTR(A.VST_LCL_LOC_C, 1,7)                     00188300
188400                                     = B.VRS_LCL_DLR_C            00188400
188500            AND  A.VST_STAT_Y        = B.VRS_RETAIL_Y             00188500
188600     END-EXEC                                                     00188600
188700                                                                  00188700
188800     MOVE SQLCODE                                                 00188800
188900       TO SC-DB2-SQLCODE                                          00188900
189000                                                                  00189000
189100     EVALUATE TRUE                                                00189100
189200         WHEN SC-DB2-SQLCODE-OK                                   00189200
189300              ADD +1                                              00189300
189400               TO WS-NBR-ROWS-READ-MEXW008                        00189400
189500              SET MEXW008-FOUND-90V                               00189500
189600               TO TRUE                                            00189600
189700                                                                  00189700
189800         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00189800
189900              SET MEXW008-NOT-FOUND-90V                           00189900
190000               TO TRUE                                            00190000
190100                                                                  00190100
190200         WHEN OTHER                                               00190200
190300              MOVE SQLCODE                                        00190300
190400                TO DB2-ABEND-SQLCODE                              00190400
190500              MOVE "SELECT"                                       00190500
190600                TO DB2-ABEND-FUNCTION                             00190600
190700              MOVE LIT-TBL-MEXW003-08                             00190700
190800                TO DB2-ABEND-TABLE                                00190800
190900              MOVE DB2-ABEND-MSG                                  00190900
191000                TO ABEND-MSG                                      00191000
191100              MOVE "5065C"                                        00191100
191200                TO ABEND-PARAGRAPH                                00191200
191300              PERFORM 9999I-ABEND                                 00191300
191400     END-EVALUATE                                                 00191400
191500     .                                                            00191500
191600                                                                  00191600
191700******************************************************************00191700
191800* IF A 90V STATUS WAS FOUND FOR THE VEHICLE, THEN VARIOUS RETAIL  00191800
191900* SALES DATA WILL BE MOVED TO CORRESPONDING OUTPUT FIELDS.  IF    00191900
192000* THE 90V STATUS WAS NOT FOUND FOR THE VEHICLE, THEN SPACES WILL  00192000
192100* BE MOVED TO THOSE OUTPUT FIELDS.                                00192100
192200* PER CUSTOMER, IF CUSTOMER FIRST NAME & LAST NAME IS BLANK, THEN 00192200
192300* THE BUSINESS NAME WILL BE MOVED TO THE FIRST NAME FIELD         00192300
192400******************************************************************00192400
192500 5070C-POPULATE-RETAIL-OUTPUT.                                    00192500
192600                                                                  00192600
192700     MOVE VRS-LCL-FLEET-C                                         00192700
192800       TO WS-DTL-VRS-LCL-FLEET-C                                  00192800
192900                                                                  00192900
193000     IF    VRS-CST-FIRST-N = SPACES                               00193000
193100       AND VRS-CST-LAST-N  = SPACES                               00193100
193200          MOVE VRS-CST-BUS-1-N (1:30)                             00193200
193300            TO WS-DTL-VRS-CST-FIRST-N                             00193300
193400          MOVE VRS-CST-BUS-2-N (1:30)                             00193400
193500            TO WS-DTL-VRS-CST-LAST-N                              00193500
193600                                                                  00193600
193700     ELSE                                                         00193700
193800                                                                  00193800
193900          MOVE VRS-CST-FIRST-N                                    00193900
194000            TO WS-DTL-VRS-CST-FIRST-N                             00194000
194100          MOVE VRS-CST-MID-INIT-X                                 00194100
194200            TO WS-DTL-VRS-CST-MID-INIT-X                          00194200
194300          MOVE VRS-CST-LAST-N                                     00194300
194400            TO WS-DTL-VRS-CST-LAST-N                              00194400
194500     END-IF                                                       00194500
194600                                                                  00194600
194700     MOVE VRS-CST-ADDR-1-X                                        00194700
194800       TO WS-DTL-VRS-CST-ADDR-1-X                                 00194800
194900     MOVE VRS-CST-ADD-DIV2-N                                      00194900
195000       TO WS-DTL-VRS-CST-ADD-DIV2-N                               00195000
195100     MOVE VRS-CST-ADD-DIV1-C                                      00195100
195200       TO WS-DTL-VRS-CST-ADD-DIV1-C                               00195200
195300     MOVE VRS-CST-POSTAL-C                                        00195300
195400       TO WS-DTL-VRS-CST-POSTAL-C                                 00195400
195500     MOVE VRS-SALESPERSON-C                                       00195500
195600       TO WS-DTL-VRS-SALESPERSON-C                                00195600
195700                                                                  00195700
195800     PERFORM 5075C-POPULATE-CONCEPS-SLSTYP                        00195800
195900                                                                  00195900
196000*--- VEHICLE SALES RECEIPT DATE- IF IT EXISTS ( > 0001-01-01)     00196000
196100     IF VRS-RPT-SALE-Y > '0001-01-01'                             00196100
196200        STRING VRS-RPT-SALE-Y (1:4)                               00196200
196300               VRS-RPT-SALE-Y (6:2)                               00196300
196400               VRS-RPT-SALE-Y (9:2)                               00196400
196500            DELIMITED BY SIZE                                     00196500
196600          INTO WS-DTL-VEH-SLSRCPT-VST-STAT-Y                      00196600
196700        END-STRING                                                00196700
196800     END-IF                                                       00196800
196900*    ----------------------------------------------------------   00196900
197000*    IF VEHICLE WARRANTY START DATE DOES NOT EXIST (0001-01-01)   00197000
197100*    WE WILL USE THE RETAIL SALES DATE, IF THE RETAIL SALES       00197100
197200*    DATE EXISTS (> THAN 0001-01-01).                             00197200
197300*    ----------------------------------------------------------   00197300
197400     IF   VRS-WARR-STRT-Y > '0001-01-01'                          00197400
197500          STRING VRS-WARR-STRT-Y (1:4)                            00197500
197600                 VRS-WARR-STRT-Y (6:2)                            00197600
197700                 VRS-WARR-STRT-Y (9:2)                            00197700
197800             DELIMITED BY SIZE                                    00197800
197900              INTO WS-DTL-VEH-WARRANT-VST-STAT-Y                  00197900
198000          END-STRING                                              00198000
198100     ELSE                                                         00198100
198200          IF VRS-RPT-SALE-Y  > '0001-01-01'                       00198200
198300             MOVE WS-DTL-VEH-SLSRCPT-VST-STAT-Y                   00198300
198400               TO WS-DTL-VEH-WARRANT-VST-STAT-Y                   00198400
198500          END-IF                                                  00198500
198600     END-IF                                                       00198600
198700     .                                                            00198700
198800                                                                  00198800
198900******************************************************************00198900
199000* THE GEVIS CUSTOMER TYPE CODE WILL BE CONVERTED TO A CONCEPS     00199000
199100* SALES TYPE CODE.                                                00199100
199200******************************************************************00199200
199300 5075C-POPULATE-CONCEPS-SLSTYP.                                   00199300
199400                                                                  00199400
199500     EVALUATE VRS-TYP-LCL-CUST-C                                  00199500
199600         WHEN "A1"                                                00199600
199700         WHEN "0 "                                                00199700
199800             MOVE "0"                                             00199800
199900               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00199900
200000                                                                  00200000
200100         WHEN "A2"                                                00200100
200200         WHEN "R "                                                00200200
200300             MOVE "R"                                             00200300
200400               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00200400
200500                                                                  00200500
200600         WHEN "A3"                                                00200600
200700         WHEN "L "                                                00200700
200800             MOVE "L"                                             00200800
200900               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00200900
201000                                                                  00201000
201100         WHEN "A4"                                                00201100
201200             MOVE " "                                             00201200
201300               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00201300
201400                                                                  00201400
201500         WHEN "A5"                                                00201500
201600         WHEN "E "                                                00201600
201700             MOVE "E"                                             00201700
201800               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00201800
201900                                                                  00201900
202000         WHEN "F1"                                                00202000
202100         WHEN "7 "                                                00202100
202200             MOVE "7"                                             00202200
202300               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00202300
202400                                                                  00202400
202500         WHEN "F2"                                                00202500
202600         WHEN "3 "                                                00202600
202700             MOVE "3"                                             00202700
202800               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00202800
202900                                                                  00202900
203000         WHEN "F3"                                                00203000
203100         WHEN "T "                                                00203100
203200             MOVE "T"                                             00203200
203300               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00203300
203400                                                                  00203400
203500         WHEN "F4"                                                00203500
203600         WHEN "4 "                                                00203600
203700             MOVE "4"                                             00203700
203800               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00203800
203900                                                                  00203900
204000         WHEN "L2"                                                00204000
204100         WHEN "L4"                                                00204100
204200         WHEN "D "                                                00204200
204300             MOVE "D"                                             00204300
204400               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00204400
204500                                                                  00204500
204600         WHEN "L1"                                                00204600
204700         WHEN "L3"                                                00204700
204800         WHEN "6 "                                                00204800
204900             MOVE "6"                                             00204900
205000               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00205000
205100     END-EVALUATE                                                 00205100
205200     .                                                            00205200
205300                                                                  00205300
205400******************************************************************00205400
205500* TABLES MEXW003 & MEXW007 WILL BE JOINED IN ORDER TO OBTAIN      00205500
205600* VARIOUS WHOLESALE INFORMATION, IF THE VEHICLE HAS REACHED THAT  00205600
205700* STAGE.                                                          00205700
205800* NOTE: THE VEHICLE TOTAL AMOUNT MUST BE IN UNITED STATES DOLLAR  00205800
205900* CURRENCY (USD).  IF IT IS NOT, THEN ZERO WILL BE MOVED TO THE   00205900
206000* FIELD.                                                          00206000
206100******************************************************************00206100
206200 5080C-OBTAIN-WHOLESALE-DATA.                                     00206200
206300                                                                  00206300
206400     PERFORM 5085C-SELECT-MEXW003-40V                             00206400
206500     IF MEXW003-FOUND-40V                                         00206500
206600        MOVE VST-GBL-LOC-C                                        00206600
206700          TO WS-DTL-CURR-VST-GBL-LOC-C                            00206700
206800        STRING VST-STAT-Y (1:4)                                   00206800
206900               VST-STAT-Y (6:2)                                   00206900
207000               VST-STAT-Y (9:2)                                   00207000
207100          DELIMITED BY SIZE                                       00207100
207200          INTO WS-DTL-VEH-INVOICE-VST-STAT-Y                      00207200
207300        END-STRING                                                00207300
207400        IF VWS-CUR-CURRENCY-C = LIT-USD                           00207400
207500           MOVE VWS-TOT-LCL-A                                     00207500
207600             TO WS-DTL-VWS-TOT-US-A                               00207600
207700        ELSE                                                      00207700
207800           MOVE ZERO                                              00207800
207900             TO WS-DTL-VWS-TOT-US-A                               00207900
208000        END-IF                                                    00208000
208100     END-IF                                                       00208100
208200     .                                                            00208200
208300                                                                  00208300
208400******************************************************************00208400
208500* A JOIN ON TABLES MEXW003 & MEXW007 WILL BE DONE INTO ORDER TO   00208500
208600* RETRIEVE THE CURRENT INVOICE DEALER, THE INVOICING PREPARATION  00208600
208700* DATE, THE CURRENCY CODE AND THE VEHICLE TOTAL AMOUNT.           00208700
208800******************************************************************00208800
208900 5085C-SELECT-MEXW003-40V.                                        00208900
209000                                                                  00209000
209100     MOVE VEH-ORD-ID-C                                            00209100
209200       TO VST-VEH-ORD-ID-C                                        00209200
209300     MOVE VEH-DTA-DATA-SRC-C                                      00209300
209400       TO VST-DTA-DATA-SRC-C                                      00209400
209500     MOVE LIT-40V                                                 00209500
209600       TO VST-STA-STATUS-C                                        00209600
209700     MOVE LIT-Y                                                   00209700
209800       TO VST-LAST-OCCUR-F                                        00209800
209900          VST-ACTIVE-F                                            00209900
210000                                                                  00210000
210100     EXEC SQL                                                     00210100
210200         SELECT A.VST_GBL_LOC_C                                   00210200
210300               ,A.VST_STAT_Y                                      00210300
210400               ,B.VWS_TOT_LCL_A                                   00210400
210500               ,B.CUR_CURRENCY_C                                  00210500
210600          INTO                                                    00210600
210700                :VST-GBL-LOC-C                                    00210700
210800               ,:VST-STAT-Y                                       00210800
210900               ,:VWS-TOT-LCL-A                                    00210900
211000               ,:VWS-CUR-CURRENCY-C                               00211000
211100          FROM  MEXW003_VEH_STATUS A                              00211100
211200               ,MEXW007_VEH_WHS B                                 00211200
211300         WHERE  A.VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C           00211300
211400           AND  A.DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C         00211400
211500           AND  A.STA_STATUS_C      = :VST-STA-STATUS-C           00211500
211600           AND  A.VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F           00211600
211700           AND  A.VST_ACTIVE_F      = :VST-ACTIVE-F               00211700
211800           AND  A.VST_ACTIVE_F      = B.VWS_ACTIVE_F              00211800
211900           AND  A.STA_STATUS_C      = B.STA_STATUS_C              00211900
212000           AND  A.VEH_ORD_ID_C      = B.VEH_ORD_ID_C              00212000
212100           AND  A.DTA_DATA_SRC_C    = B.DTA_DATA_SRC_C            00212100
212200           AND  A.VST_STAT_Y        = B.VWS_DATE_Y                00212200
212300           AND  SUBSTR(A.VST_LCL_LOC_C, 1,7)                      00212300
212400                                    = B.VWS_LCL_DLR_C             00212400
212500     END-EXEC                                                     00212500
212600                                                                  00212600
212700     MOVE SQLCODE                                                 00212700
212800       TO SC-DB2-SQLCODE                                          00212800
212900                                                                  00212900
213000     EVALUATE TRUE                                                00213000
213100         WHEN SC-DB2-SQLCODE-OK                                   00213100
213200              ADD +1                                              00213200
213300               TO WS-NBR-ROWS-READ-MEXW007                        00213300
213400              SET MEXW003-FOUND-40V                               00213400
213500               TO TRUE                                            00213500
213600                                                                  00213600
213700         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00213700
213800              SET MEXW003-NOT-FOUND-40V                           00213800
213900               TO TRUE                                            00213900
214000                                                                  00214000
214100         WHEN OTHER                                               00214100
214200              MOVE SQLCODE                                        00214200
214300                TO DB2-ABEND-SQLCODE                              00214300
214400              MOVE "SELECT"                                       00214400
214500                TO DB2-ABEND-FUNCTION                             00214500
214600              MOVE LIT-TBL-MEXW003-07                             00214600
214700                TO DB2-ABEND-TABLE                                00214700
214800              MOVE DB2-ABEND-MSG                                  00214800
214900                TO ABEND-MSG                                      00214900
215000              MOVE "5085C"                                        00215000
215100                TO ABEND-PARAGRAPH                                00215100
215200              PERFORM 9999I-ABEND                                 00215200
215300     END-EVALUATE                                                 00215300
215400     .                                                            00215400
215500                                                                  00215500
215600******************************************************************00215600
215700* THE WERS VEHICLE LINE CODE WILL BE OBTAINED FROM TABLE MEXW034  00215700
215800* OR FROM TABLE MEXW004_WERS_VL_STRING.                           00215800
215900* IF 'EA' OR 'NA' SOURCED, THE WERS VEHICLE LINE IS OBTAINED FROM 00215900
216000* MEXW034 DB2 TABLE USING THE PROD SOURCE AND GEVIS VEHICLE LINE, 00216000
216100* WHICH WAS OBTAINED FROM MEXW001 DB2 TABLE.                      00216100
216200* FOR ALL OTHER SOURCES, IF THE ORDER IS FOUND ON MEXW004 DB2     00216200
216300* TABLE, USE THE WERS VEHICLE LINE FROM MEXW004 DB2 TABLE AND     00216300
216400* GEVIS VEHICLE LINE FROM MEXW034 DB2 TABLE WERS PRODUCT TYPE CODE00216400
216500* AND WERS BODY USE TO MAKE UP THE WERS BODY STYLE.               00216500
216600* IF NOT FOUND ON MEXW004 DB2 TABLE, USE WERS VEHICLE LINE        00216600
216700* FROM MEXW0032 (CATALOG CODE), PRODUCT TYPE AND WERS BODY USE    00216700
216800* TO MAKE UP WERS BODY STYLE.                                     00216800
216900* IF NOT FOUND ON MEXW004 OR MEXW031/MEXW032 DB2 TABLES, WE ARE   00216900
217000* ASSUMING THE ORDER IS FROM HISTORY FOR 'NA' AND 'EA', USE       00217000
217100* MEXW034 DB2 TABLE PRODUCT TYPE CODE AND BODY TYPE FROM MEXW033  00217100
217200* USE TO MAKE UP THE BODY STYLE.                                  00217200
217300******************************************************************00217300
217400 5100C-OBTAIN-WERS-DATA.                                          00217400
217500                                                                  00217500
217600     SET MEXW034-NOT-FOUND                                        00217600
217700      TO TRUE                                                     00217700
217800                                                                  00217800
217900     IF VEH-DTA-DATA-SRC-C = LIT-EA OR LIT-NA                     00217900
218000        IF VEH-GEVIS-VL-C  > "  "                                 00218000
218100           PERFORM 5110C-SELECT-W034-DATA                         00218100
218200        END-IF                                                    00218200
218300                                                                  00218300
218400        IF MEXW034-FOUND                                          00218400
218500           MOVE VLN-WERS-VL-C                                     00218500
218600             TO WS-DTL-WERS-VEH-LINE-C                            00218600
218700           MOVE VLN-WERS-BRAND-C (2:1)                            00218700
218800             TO WS-DTL-WERS-BRAND-C                               00218800
218900        END-IF                                                    00218900
219000                                                                  00219000
219100     ELSE                                                         00219100
219200                                                                  00219200
219300         IF  WERS-STRING-FOUND-SW                                 00219300
219400             PERFORM 5102C-WERS-STRING-PROCESS                    00219400
219500                                                                  00219500
219600         ELSE                                                     00219600
219700             PERFORM 5112C-SELECT-MEXW032-WERS-VL                 00219700
219800                                                                  00219800
219900             IF  MEXW032-FOUND                                    00219900
220000                 PERFORM 5104C-CATALOG-CODE-PROCESS               00220000
220100                                                                  00220100
220200             END-IF                                               00220200
220300         END-IF                                                   00220300
220400     END-IF                                                       00220400
220500                                                                  00220500
220600     MOVE SPACES                      TO WS-DTL-WERS-BODY-STYLE-C 00220600
220700                                                                  00220700
220800     IF  WERS-STRING-FOUND-SW                                     00220800
220900         STRING VWR-WERS-PRD-TP-C                                 00220900
221000              , VWR-WERS-STRING-X-TEXT(10:2)                      00221000
221100                  DELIMITED BY SIZE INTO WS-DTL-WERS-BODY-STYLE-C 00221100
221200         END-STRING                                               00221200
221300                                                                  00221300
221400     ELSE                                                         00221400
221500         IF  MEXW031-FOUND                                        00221500
221600             STRING CTM-VPT-PROD-TYP-C                            00221600
221700                  , CTM-OPT-OPTION-C                              00221700
221800                  DELIMITED BY SIZE INTO WS-DTL-WERS-BODY-STYLE-C 00221800
221900             END-STRING                                           00221900
222000                                                                  00222000
222100         ELSE                                                     00222100
222200             IF  VEH-DTA-DATA-SRC-C  =  LIT-EA  OR  LIT-NA        00222200
222300                 PERFORM 5115C-SELECT-MEXW033-DATA                00222300
222400                                                                  00222400
222500                 IF  MEXW033-FOUND                                00222500
222600                     IF  BDT-WERS-BDY-TYP-C  >  SPACES            00222600
222700                         STRING VLN-WERS-PRD-TP-C                 00222700
222800                              , BDT-WERS-BDY-TYP-C                00222800
222900                         DELIMITED BY SIZE                        00222900
223000                                    INTO WS-DTL-WERS-BODY-STYLE-C 00223000
223100                        END-STRING                                00223100
223200                                                                  00223200
223300                     END-IF                                       00223300
223400                 END-IF                                           00223400
223500             END-IF                                               00223500
223600         END-IF                                                   00223600
223700     END-IF                                                       00223700
223800     .                                                            00223800
223900                                                                  00223900
224000******************************************************************00224000
224100* PROCESS FEATURE DATA FROM WERS STRING W004 TABLE                00224100
224200*                                                                 00224200
224300* EVALUATE WERS VEHICLE LINE.  THESE ARE HANDLED AS               00224300
224400* EXEPTIONS AS THEY CAN APPEAR MUTIPLE TIMES FOR                  00224400
224500* DIFFERENT GEVIS VEHICLE LINES.                                  00224500
224600*                                                                 00224600
224700******************************************************************00224700
224800 5102C-WERS-STRING-PROCESS.                                       00224800
224900                                                                  00224900
225000     MOVE VWR-WERS-VL-C               TO WS-WERS-VL-C             00225000
225100                                                                  00225100
225200     IF  WS-VALID-VEH-LINE-CDS                                    00225200
225300         EVALUATE VWR-WERS-VL-C                                   00225300
225400             WHEN "KI"                                            00225400
225500             WHEN "K5"                                            00225500
225600                  MOVE "L5"           TO VLN-GEVIS-VL-C           00225600
225700                  MOVE "AB"           TO VLN-WERS-BRAND-C         00225700
225800                  SET MEXW034-FOUND   TO TRUE                     00225800
225900                                                                  00225900
226000             WHEN "DB"                                            00226000
226100                  MOVE "DB"           TO VLN-GEVIS-VL-C           00226100
226200                  MOVE "AB"           TO VLN-WERS-BRAND-C         00226200
226300                  SET MEXW034-FOUND   TO TRUE                     00226300
226400                                                                  00226400
226500         END-EVALUATE                                             00226500
226600     ELSE                                                         00226600
226700         PERFORM 5110C-SELECT-W034-DATA                           00226700
226800                                                                  00226800
226900     END-IF                                                       00226900
227000                                                                  00227000
227100     IF  MEXW034-FOUND                                            00227100
227200         MOVE VLN-GEVIS-VL-C          TO WS-DTL-GEVIS-VEH-LINE-C  00227200
227300         MOVE VWR-WERS-VL-C           TO WS-DTL-WERS-VEH-LINE-C   00227300
227400         MOVE VLN-WERS-BRAND-C (2:1)  TO WS-DTL-WERS-BRAND-C      00227400
227500                                                                  00227500
227600     ELSE                                                         00227600
227700         MOVE VEH-GEVIS-VL-C          TO WS-DTL-GEVIS-VEH-LINE-C  00227700
227800         MOVE VWR-WERS-VL-C           TO WS-DTL-WERS-VEH-LINE-C   00227800
227900         MOVE SPACES                  TO WS-DTL-WERS-BRAND-C      00227900
228000                                                                  00228000
228100     END-IF                                                       00228100
228200                                                                  00228200
228300     .                                                            00228300
228400                                                                  00228400
228500******************************************************************00228500
228600* PROCESS CATALOG CODE                                            00228600
228700*                                                                 00228700
228800* EVALUATE CATALOG CODE VEHICLE LINE.  THESE ARE HANDLED AS       00228800
228900* EXEPTIONS AS THEY CAN APPEAR MUTIPLE TIMES FOR                  00228900
229000* DIFFERENT GEVIS VEHICLE LINES.                                  00229000
229100*                                                                 00229100
229200******************************************************************00229200
229300 5104C-CATALOG-CODE-PROCESS.                                      00229300
229400                                                                  00229400
229500     MOVE CTG-VHL-VEH-LINE-C          TO WS-WERS-VL-C             00229500
229600                                                                  00229600
229700     IF  WS-VALID-VEH-LINE-CDS                                    00229700
229800         EVALUATE CTG-VHL-VEH-LINE-C                              00229800
229900             WHEN "KI"                                            00229900
230000             WHEN "K5"                                            00230000
230100                  MOVE "L5"           TO VLN-GEVIS-VL-C           00230100
230200                  MOVE "AB"           TO VLN-WERS-BRAND-C         00230200
230300                  SET MEXW034-FOUND   TO TRUE                     00230300
230400                                                                  00230400
230500             WHEN "DB"                                            00230500
230600                  MOVE "DB"           TO VLN-GEVIS-VL-C           00230600
230700                  MOVE "AB"           TO VLN-WERS-BRAND-C         00230700
230800                  SET MEXW034-FOUND   TO TRUE                     00230800
230900                                                                  00230900
231000         END-EVALUATE                                             00231000
231100                                                                  00231100
231200     ELSE                                                         00231200
231300          PERFORM 5114C-SELECT-MEXW034-GEVIS-VL                   00231300
231400                                                                  00231400
231500     END-IF                                                       00231500
231600                                                                  00231600
231700     IF MEXW034-FOUND                                             00231700
231800          MOVE VLN-GEVIS-VL-C         TO WS-DTL-GEVIS-VEH-LINE-C  00231800
231900          MOVE CTG-VHL-VEH-LINE-C     TO WS-DTL-WERS-VEH-LINE-C   00231900
232000          MOVE VLN-WERS-BRAND-C (2:1) TO WS-DTL-WERS-BRAND-C      00232000
232100                                                                  00232100
232200     END-IF                                                       00232200
232300                                                                  00232300
232400     .                                                            00232400
232500                                                                  00232500
232600******************************************************************00232600
232700* RETRIEVES THE WERS VEHICLE LINE DATA USING THE GEVIS VEHICLE    00232700
232800* LINE CODE AND PRODUCTION SOURCE.                                00232800
232900* NOTE: THIS ONLY APPLIES TO 'NA' AND 'EA' DATA SOURCES.          00232900
233000******************************************************************00233000
233100 5110C-SELECT-W034-DATA.                                          00233100
233200                                                                  00233200
233300     MOVE VEH-DTA-DATA-SRC-C                                      00233300
233400       TO VLN-DTA-DATA-SRC-C                                      00233400
233500     MOVE VEH-GEVIS-VL-C                                          00233500
233600       TO VLN-GEVIS-VL-C                                          00233600
233700     MOVE LIT-Y                                                   00233700
233800       TO VLN-ACTIVE-F                                            00233800
233900                                                                  00233900
234000     EXEC SQL                                                     00234000
234100         SELECT   VLN_WERS_VL_C                                   00234100
234200                 ,VLN_WERS_PRD_TP_C                               00234200
234300                 ,VLN_WERS_BRAND_C                                00234300
234400           INTO                                                   00234400
234500                 :VLN-WERS-VL-C                                   00234500
234600                ,:VLN-WERS-PRD-TP-C                               00234600
234700                ,:VLN-WERS-BRAND-C                                00234700
234800           FROM  MEXW034_VL_BRAND                                 00234800
234900          WHERE  DTA_DATA_SRC_C    = :VLN-DTA-DATA-SRC-C          00234900
235000            AND  VLN_GEVIS_VL_C    = :VLN-GEVIS-VL-C              00235000
235100            AND  VLN_ACTIVE_F      = :VLN-ACTIVE-F                00235100
235200     END-EXEC                                                     00235200
235300                                                                  00235300
235400     MOVE SQLCODE                                                 00235400
235500       TO SC-DB2-SQLCODE                                          00235500
235600                                                                  00235600
235700     EVALUATE TRUE                                                00235700
235800         WHEN SC-DB2-SQLCODE-OK                                   00235800
235900              ADD +1                                              00235900
236000               TO WS-NBR-ROWS-READ-MEXW034                        00236000
236100              SET MEXW034-FOUND                                   00236100
236200               TO TRUE                                            00236200
236300                                                                  00236300
236400         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00236400
236500              SET MEXW034-NOT-FOUND                               00236500
236600               TO TRUE                                            00236600
236700                                                                  00236700
236800         WHEN OTHER                                               00236800
236900              MOVE SQLCODE                                        00236900
237000                TO DB2-ABEND-SQLCODE                              00237000
237100              MOVE "SELECT"                                       00237100
237200                TO DB2-ABEND-FUNCTION                             00237200
237300              MOVE LIT-TBL-VL-BRAND                               00237300
237400                TO DB2-ABEND-TABLE                                00237400
237500              MOVE DB2-ABEND-MSG                                  00237500
237600                TO ABEND-MSG                                      00237600
237700              MOVE "5110C"                                        00237700
237800                TO ABEND-PARAGRAPH                                00237800
237900              PERFORM 9999I-ABEND                                 00237900
238000     END-EVALUATE                                                 00238000
238100     .                                                            00238100
238200                                                                  00238200
238300******************************************************************00238300
238400* BY USING THE DATA OBTAINED FROM TABLE MEXW001 IN THE WHERE      00238400
238500* CLAUSE, THE WERS VEHICLE LINE WILL NOW BE SELECTED.             00238500
238600* NOTE: THIS ONLY APPLIES TO NON 'NA' AND NON 'EA' DATA SOURCES.  00238600
238700******************************************************************00238700
238800 5112C-SELECT-MEXW032-WERS-VL.                                    00238800
238900     MOVE VEH-DTA-DATA-SRC-C                                      00238900
239000       TO CTG-DTA-DATA-SRC-C                                      00239000
239100     MOVE VEH-CATALOG-C                                           00239100
239200       TO CTG-LCL-CATALOG-C                                       00239200
239300                                                                  00239300
239400     EXEC SQL                                                     00239400
239500       SELECT  VHL_VEH_LINE_C                                     00239500
239600         INTO :CTG-VHL-VEH-LINE-C                                 00239600
239700         FROM  MEXW032_CATALOG                                    00239700
239800        WHERE DTA_DATA_SRC_C    =  :CTG-DTA-DATA-SRC-C            00239800
239900          AND CTG_LCL_CATALOG_C =  :CTG-LCL-CATALOG-C             00239900
240000     END-EXEC                                                     00240000
240100                                                                  00240100
240200     MOVE SQLCODE                                                 00240200
240300       TO SC-DB2-SQLCODE                                          00240300
240400                                                                  00240400
240500     EVALUATE TRUE                                                00240500
240600         WHEN SC-DB2-SQLCODE-OK                                   00240600
240700              ADD +1                                              00240700
240800               TO WS-NBR-ROWS-READ-MEXW032                        00240800
240900              SET MEXW032-FOUND                                   00240900
241000               TO TRUE                                            00241000
241100                                                                  00241100
241200         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00241200
241300              SET MEXW032-NOT-FOUND                               00241300
241400               TO TRUE                                            00241400
241500                                                                  00241500
241600         WHEN OTHER                                               00241600
241700              MOVE SQLCODE                                        00241700
241800                TO DB2-ABEND-SQLCODE                              00241800
241900              MOVE "SELECT"                                       00241900
242000                TO DB2-ABEND-FUNCTION                             00242000
242100              MOVE LIT-TBL-CATALOG                                00242100
242200                TO DB2-ABEND-TABLE                                00242200
242300              MOVE DB2-ABEND-MSG                                  00242300
242400                TO ABEND-MSG                                      00242400
242500              MOVE "5112C"                                        00242500
242600                TO ABEND-PARAGRAPH                                00242600
242700              PERFORM 9999I-ABEND                                 00242700
242800     END-EVALUATE                                                 00242800
242900     .                                                            00242900
243000                                                                  00243000
243100******************************************************************00243100
243200* RETRIEVES THE GEVIS VEHICLE LINE DATA USING THE DATA SOURCE AND 00243200
243300* WERS VEHICLE LINE CODE.                                         00243300
243400* NOTE: THIS ONLY APPLIES TO NON 'NA' AND NON 'EA' DATA SOURCES.  00243400
243500******************************************************************00243500
243600 5114C-SELECT-MEXW034-GEVIS-VL.                                   00243600
243700     MOVE VEH-DTA-DATA-SRC-C                                      00243700
243800       TO VLN-DTA-DATA-SRC-C                                      00243800
243900     MOVE CTG-VHL-VEH-LINE-C                                      00243900
244000       TO VLN-WERS-VL-C                                           00244000
244100     MOVE LIT-Y                                                   00244100
244200       TO VLN-ACTIVE-F                                            00244200
244300                                                                  00244300
244400     EXEC SQL                                                     00244400
244500        SELECT  VLN_GEVIS_VL_C                                    00244500
244600               ,VLN_WERS_PRD_TP_C                                 00244600
244700               ,VLN_WERS_BRAND_C                                  00244700
244800          INTO                                                    00244800
244900               :VLN-GEVIS-VL-C                                    00244900
245000              ,:VLN-WERS-PRD-TP-C                                 00245000
245100              ,:VLN-WERS-BRAND-C                                  00245100
245200          FROM  MEXW034_VL_BRAND                                  00245200
245300         WHERE  DTA_DATA_SRC_C    = :VLN-DTA-DATA-SRC-C           00245300
245400           AND  VLN_WERS_VL_C     = :VLN-WERS-VL-C                00245400
245500           AND  VLN_ACTIVE_F      = :VLN-ACTIVE-F                 00245500
245600     END-EXEC                                                     00245600
245700                                                                  00245700
245800     MOVE SQLCODE                                                 00245800
245900       TO SC-DB2-SQLCODE                                          00245900
246000                                                                  00246000
246100     EVALUATE TRUE                                                00246100
246200         WHEN SC-DB2-SQLCODE-OK                                   00246200
246300              ADD +1                                              00246300
246400               TO WS-NBR-ROWS-READ-MEXW034                        00246400
246500              SET MEXW034-FOUND                                   00246500
246600               TO TRUE                                            00246600
246700                                                                  00246700
246800         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00246800
246900              SET MEXW034-NOT-FOUND                               00246900
247000               TO TRUE                                            00247000
247100                                                                  00247100
247200         WHEN OTHER                                               00247200
247300              MOVE SQLCODE                                        00247300
247400                TO DB2-ABEND-SQLCODE                              00247400
247500              MOVE "SELECT"                                       00247500
247600                TO DB2-ABEND-FUNCTION                             00247600
247700              MOVE LIT-TBL-VL-BRAND                               00247700
247800                TO DB2-ABEND-TABLE                                00247800
247900              MOVE DB2-ABEND-MSG                                  00247900
248000                TO ABEND-MSG                                      00248000
248100              MOVE "5114C"                                        00248100
248200                TO ABEND-PARAGRAPH                                00248200
248300              PERFORM 9999I-ABEND                                 00248300
248400     END-EVALUATE                                                 00248400
248500     .                                                            00248500
248600                                                                  00248600
248700******************************************************************00248700
248800* BY USING THE DATA OBTAINED FROM TABLE MEXW001 IN THE WHERE      00248800
248900* CLAUSE, THE WERS BODY TYPE WILL NOW BE OBTAINED.                00248900
249000******************************************************************00249000
249100 5115C-SELECT-MEXW033-DATA.                                       00249100
249200                                                                  00249200
249300     MOVE VEH-DTA-DATA-SRC-C                                      00249300
249400       TO BDT-PROD-SRC-C                                          00249400
249500     MOVE VEH-BDT-MDL-YR-Y                                        00249500
249600       TO BDT-START-YR-R                                          00249600
249700          BDT-END-YR-R                                            00249700
249800     MOVE VEH-LCL-BDYTYP-C                                        00249800
249900       TO BDT-BDY-TYP-C                                           00249900
250000                                                                  00250000
250100     EXEC SQL                                                     00250100
250200                                                                  00250200
250300         SELECT  BDT_WERS_BDY_TYP_C                               00250300
250400           INTO                                                   00250400
250500                 :BDT-WERS-BDY-TYP-C                              00250500
250600           FROM  MEXW033_BODY_TYPE                                00250600
250700          WHERE  BDT_PROD_SRC_C  = :BDT-PROD-SRC-C                00250700
250800            AND  BDT_BDY_TYP_C   = :BDT-BDY-TYP-C                 00250800
250900            AND  BDT_START_YR_R <= :BDT-START-YR-R                00250900
251000            AND  BDT_END_YR_R   >= :BDT-END-YR-R                  00251000
251100     END-EXEC                                                     00251100
251200                                                                  00251200
251300     MOVE SQLCODE                                                 00251300
251400       TO SC-DB2-SQLCODE                                          00251400
251500     EVALUATE TRUE                                                00251500
251600         WHEN SC-DB2-SQLCODE-OK                                   00251600
251700              ADD +1                                              00251700
251800               TO WS-NBR-ROWS-READ-MEXW033                        00251800
251900              SET MEXW033-FOUND                                   00251900
252000               TO TRUE                                            00252000
252100                                                                  00252100
252200         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00252200
252300              SET MEXW033-NOT-FOUND                               00252300
252400               TO TRUE                                            00252400
252500                                                                  00252500
252600         WHEN OTHER                                               00252600
252700              MOVE SQLCODE                                        00252700
252800                TO DB2-ABEND-SQLCODE                              00252800
252900              MOVE "SELECT"                                       00252900
253000                TO DB2-ABEND-FUNCTION                             00253000
253100              MOVE LIT-TBL-BODY-TYPE                              00253100
253200                TO DB2-ABEND-TABLE                                00253200
253300              MOVE DB2-ABEND-MSG                                  00253300
253400                TO ABEND-MSG                                      00253400
253500              MOVE "5115C"                                        00253500
253600                TO ABEND-PARAGRAPH                                00253600
253700              PERFORM 9999I-ABEND                                 00253700
253800     END-EVALUATE                                                 00253800
253900     .                                                            00253900
254000                                                                  00254000
254100******************************************************************00254100
254200* A ROW CONTAINING THE MOST RECENT 20T STATUS CODE WHICH CONSISTS 00254200
254300* OF THE DATE THAT THE VEHICLE WAS PRODUCED WILL BE RETRIEVED.    00254300
254400******************************************************************00254400
254500 5120C-OBTAIN-MEXW003-20T.                                        00254500
254600                                                                  00254600
254700     MOVE VEH-ORD-ID-C                                            00254700
254800       TO VST-VEH-ORD-ID-C                                        00254800
254900     MOVE VEH-DTA-DATA-SRC-C                                      00254900
255000       TO VST-DTA-DATA-SRC-C                                      00255000
255100     MOVE LIT-20T                                                 00255100
255200       TO VST-STA-STATUS-C                                        00255200
255300     MOVE LIT-Y                                                   00255300
255400       TO VST-LAST-OCCUR-F                                        00255400
255500          VST-ACTIVE-F                                            00255500
255600                                                                  00255600
255700     EXEC SQL                                                     00255700
255800         SELECT  VST_STAT_Y                                       00255800
255900           INTO                                                   00255900
256000                 :VST-STAT-Y                                      00256000
256100           FROM  MEXW003_VEH_STATUS                               00256100
256200          WHERE  VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C            00256200
256300            AND  DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C          00256300
256400            AND  STA_STATUS_C      = :VST-STA-STATUS-C            00256400
256500            AND  VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F            00256500
256600            AND  VST_ACTIVE_F      = :VST-ACTIVE-F                00256600
256700     END-EXEC                                                     00256700
256800                                                                  00256800
256900     MOVE SQLCODE                                                 00256900
257000       TO SC-DB2-SQLCODE                                          00257000
257100                                                                  00257100
257200     EVALUATE TRUE                                                00257200
257300         WHEN SC-DB2-SQLCODE-OK                                   00257300
257400              ADD +1                                              00257400
257500               TO WS-NBR-ROWS-READ-MEXW003                        00257500
257600              SET MEXW003-FOUND-20T                               00257600
257700               TO TRUE                                            00257700
257800                                                                  00257800
257900         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00257900
258000              SET MEXW003-NOT-FOUND-20T                           00258000
258100               TO TRUE                                            00258100
258200                                                                  00258200
258300         WHEN OTHER                                               00258300
258400              MOVE SQLCODE                                        00258400
258500                TO DB2-ABEND-SQLCODE                              00258500
258600              MOVE "SELECT"                                       00258600
258700                TO DB2-ABEND-FUNCTION                             00258700
258800              MOVE LIT-TBL-VEH-STATUS                             00258800
258900                TO DB2-ABEND-TABLE                                00258900
259000              MOVE DB2-ABEND-MSG                                  00259000
259100                TO ABEND-MSG                                      00259100
259200              MOVE "5120C"                                        00259200
259300                TO ABEND-PARAGRAPH                                00259300
259400              PERFORM 9999I-ABEND                                 00259400
259500     END-EVALUATE                                                 00259500
259600     .                                                            00259600
259700                                                                  00259700
259800******************************************************************00259800
259900* RETRIEVES THE MOST RECENT 30R STATUS CODE WHICH CONSISTS OF THE 00259900
260000* DATE THAT THE VEHICLE WAS PRODUCED AND PASSED THE PLANT INSPEC- 00260000
260100* TION. IF NOT FOUND, THEN A 30P STATUS CODE WILL BE SELECTED.    00260100
260200* THE 30P CONSISTS OF THE DATE THAT THE VEHICLE WAS PRODUCED, BUT 00260200
260300* INSPECTION DID NOT OCCUR.                                       00260300
260400******************************************************************00260400
260500 5140C-OBTAIN-MEXW003-30R.                                        00260500
260600                                                                  00260600
260700     MOVE VEH-ORD-ID-C                                            00260700
260800       TO VST-VEH-ORD-ID-C                                        00260800
260900     MOVE VEH-DTA-DATA-SRC-C                                      00260900
261000       TO VST-DTA-DATA-SRC-C                                      00261000
261100     MOVE LIT-30R                                                 00261100
261200       TO VST-STA-STATUS-C                                        00261200
261300     MOVE LIT-Y                                                   00261300
261400       TO VST-LAST-OCCUR-F                                        00261400
261500          VST-ACTIVE-F                                            00261500
261600                                                                  00261600
261700     EXEC SQL                                                     00261700
261800         SELECT  VST_STAT_Y                                       00261800
261900           INTO                                                   00261900
262000                 :VST-STAT-Y                                      00262000
262100           FROM  MEXW003_VEH_STATUS                               00262100
262200          WHERE  VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C            00262200
262300            AND  DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C          00262300
262400            AND  STA_STATUS_C      = :VST-STA-STATUS-C            00262400
262500            AND  VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F            00262500
262600            AND  VST_ACTIVE_F      = :VST-ACTIVE-F                00262600
262700     END-EXEC                                                     00262700
262800                                                                  00262800
262900     MOVE SQLCODE                                                 00262900
263000       TO SC-DB2-SQLCODE                                          00263000
263100                                                                  00263100
263200     EVALUATE TRUE                                                00263200
263300         WHEN SC-DB2-SQLCODE-OK                                   00263300
263400              ADD +1                                              00263400
263500               TO WS-NBR-ROWS-READ-MEXW003                        00263500
263600              SET MEXW003-FOUND-30R                               00263600
263700               TO TRUE                                            00263700
263800                                                                  00263800
263900         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00263900
264000              SET MEXW003-NOT-FOUND-30R                           00264000
264100               TO TRUE                                            00264100
264200                                                                  00264200
264300         WHEN OTHER                                               00264300
264400              MOVE SQLCODE                                        00264400
264500                TO DB2-ABEND-SQLCODE                              00264500
264600              MOVE "SELECT"                                       00264600
264700                TO DB2-ABEND-FUNCTION                             00264700
264800              MOVE LIT-TBL-VEH-STATUS                             00264800
264900                TO DB2-ABEND-TABLE                                00264900
265000              MOVE DB2-ABEND-MSG                                  00265000
265100                TO ABEND-MSG                                      00265100
265200              MOVE "5140C"                                        00265200
265300                TO ABEND-PARAGRAPH                                00265300
265400              PERFORM 9999I-ABEND                                 00265400
265500     END-EVALUATE                                                 00265500
265600     .                                                            00265600
265700                                                                  00265700
265800******************************************************************00265800
265900* RETRIEVES THE MOST RECENT 30P STATUS CODE WHICH CONSISTS OF THE 00265900
266000* DATE THAT THE VEHICLE WAS PRODUCED, BUT NOT INSPECTED.          00266000
266100******************************************************************00266100
266200 5160C-OBTAIN-MEXW003-30P.                                        00266200
266300                                                                  00266300
266400     MOVE VEH-ORD-ID-C                                            00266400
266500       TO VST-VEH-ORD-ID-C                                        00266500
266600     MOVE VEH-DTA-DATA-SRC-C                                      00266600
266700       TO VST-DTA-DATA-SRC-C                                      00266700
266800     MOVE LIT-30P                                                 00266800
266900       TO VST-STA-STATUS-C                                        00266900
267000     MOVE LIT-Y                                                   00267000
267100       TO VST-LAST-OCCUR-F                                        00267100
267200          VST-ACTIVE-F                                            00267200
267300                                                                  00267300
267400     EXEC SQL                                                     00267400
267500         SELECT  VST_STAT_Y                                       00267500
267600           INTO                                                   00267600
267700                 :VST-STAT-Y                                      00267700
267800           FROM  MEXW003_VEH_STATUS                               00267800
267900          WHERE  VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C            00267900
268000            AND  DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C          00268000
268100            AND  STA_STATUS_C      = :VST-STA-STATUS-C            00268100
268200            AND  VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F            00268200
268300            AND  VST_ACTIVE_F      = :VST-ACTIVE-F                00268300
268400     END-EXEC                                                     00268400
268500                                                                  00268500
268600     MOVE SQLCODE                                                 00268600
268700       TO SC-DB2-SQLCODE                                          00268700
268800                                                                  00268800
268900     EVALUATE TRUE                                                00268900
269000         WHEN SC-DB2-SQLCODE-OK                                   00269000
269100              ADD +1                                              00269100
269200               TO WS-NBR-ROWS-READ-MEXW003                        00269200
269300              SET MEXW003-FOUND-30P                               00269300
269400               TO TRUE                                            00269400
269500                                                                  00269500
269600         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00269600
269700              SET MEXW003-NOT-FOUND-30P                           00269700
269800               TO TRUE                                            00269800
269900                                                                  00269900
270000         WHEN OTHER                                               00270000
270100              MOVE SQLCODE                                        00270100
270200                TO DB2-ABEND-SQLCODE                              00270200
270300              MOVE "SELECT"                                       00270300
270400                TO DB2-ABEND-FUNCTION                             00270400
270500              MOVE LIT-TBL-VEH-STATUS                             00270500
270600                TO DB2-ABEND-TABLE                                00270600
270700              MOVE DB2-ABEND-MSG                                  00270700
270800                TO ABEND-MSG                                      00270800
270900              MOVE "5160C"                                        00270900
271000                TO ABEND-PARAGRAPH                                00271000
271100              PERFORM 9999I-ABEND                                 00271100
271200     END-EVALUATE                                                 00271200
271300     .                                                            00271300
271400                                                                  00271400
271500******************************************************************00271500
271600* RETRIEVES THE MOST RECENT 30T STATUS CODE WHICH CONSISTS OF THE 00271600
271700* DATE THAT THE VEHICLE WAS RELEASED FROM THE ASSEMBLY PLANT.     00271700
271800******************************************************************00271800
271900 5180C-OBTAIN-MEXW003-30T.                                        00271900
272000                                                                  00272000
272100     MOVE VEH-ORD-ID-C                                            00272100
272200       TO VST-VEH-ORD-ID-C                                        00272200
272300     MOVE VEH-DTA-DATA-SRC-C                                      00272300
272400       TO VST-DTA-DATA-SRC-C                                      00272400
272500     MOVE LIT-30T                                                 00272500
272600       TO VST-STA-STATUS-C                                        00272600
272700     MOVE LIT-Y                                                   00272700
272800       TO VST-LAST-OCCUR-F                                        00272800
272900          VST-ACTIVE-F                                            00272900
273000                                                                  00273000
273100     EXEC SQL                                                     00273100
273200         SELECT  VST_STAT_Y                                       00273200
273300           INTO                                                   00273300
273400                 :VST-STAT-Y                                      00273400
273500           FROM  MEXW003_VEH_STATUS                               00273500
273600          WHERE  VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C            00273600
273700            AND  DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C          00273700
273800            AND  STA_STATUS_C      = :VST-STA-STATUS-C            00273800
273900            AND  VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F            00273900
274000            AND  VST_ACTIVE_F      = :VST-ACTIVE-F                00274000
274100     END-EXEC                                                     00274100
274200                                                                  00274200
274300     MOVE SQLCODE                                                 00274300
274400       TO SC-DB2-SQLCODE                                          00274400
274500                                                                  00274500
274600     EVALUATE TRUE                                                00274600
274700         WHEN SC-DB2-SQLCODE-OK                                   00274700
274800              ADD +1                                              00274800
274900               TO WS-NBR-ROWS-READ-MEXW003                        00274900
275000              SET MEXW003-FOUND-30T                               00275000
275100               TO TRUE                                            00275100
275200                                                                  00275200
275300         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00275300
275400              SET MEXW003-NOT-FOUND-30T                           00275400
275500               TO TRUE                                            00275500
275600                                                                  00275600
275700         WHEN OTHER                                               00275700
275800              MOVE SQLCODE                                        00275800
275900                TO DB2-ABEND-SQLCODE                              00275900
276000              MOVE "SELECT"                                       00276000
276100                TO DB2-ABEND-FUNCTION                             00276100
276200              MOVE LIT-TBL-VEH-STATUS                             00276200
276300                TO DB2-ABEND-TABLE                                00276300
276400              MOVE DB2-ABEND-MSG                                  00276400
276500                TO ABEND-MSG                                      00276500
276600              MOVE "5180C"                                        00276600
276700                TO ABEND-PARAGRAPH                                00276700
276800              PERFORM 9999I-ABEND                                 00276800
276900     END-EVALUATE                                                 00276900
277000     .                                                            00277000
277100                                                                  00277100
277200******************************************************************00277200
277300* RETRIEVES THE MOST RECENT 80F STATUS CODE WHICH CONSISTS OF THE 00277300
277400* DATE THAT THE VEHICLE HAS ARRIVED AT THE FINAL DESTINATION.     00277400
277500******************************************************************00277500
277600 5200C-OBTAIN-MEXW003-80F.                                        00277600
277700     MOVE VEH-ORD-ID-C                                            00277700
277800       TO VST-VEH-ORD-ID-C                                        00277800
277900     MOVE VEH-DTA-DATA-SRC-C                                      00277900
278000       TO VST-DTA-DATA-SRC-C                                      00278000
278100     MOVE LIT-80F                                                 00278100
278200       TO VST-STA-STATUS-C                                        00278200
278300     MOVE LIT-Y                                                   00278300
278400       TO VST-LAST-OCCUR-F                                        00278400
278500          VST-ACTIVE-F                                            00278500
278600                                                                  00278600
278700     EXEC SQL                                                     00278700
278800         SELECT  VST_STAT_Y                                       00278800
278900           INTO                                                   00278900
279000                 :VST-STAT-Y                                      00279000
279100           FROM  MEXW003_VEH_STATUS                               00279100
279200          WHERE  VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C            00279200
279300            AND  DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C          00279300
279400            AND  STA_STATUS_C      = :VST-STA-STATUS-C            00279400
279500            AND  VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F            00279500
279600            AND  VST_ACTIVE_F      = :VST-ACTIVE-F                00279600
279700     END-EXEC                                                     00279700
279800                                                                  00279800
279900     MOVE SQLCODE                                                 00279900
280000       TO SC-DB2-SQLCODE                                          00280000
280100                                                                  00280100
280200     EVALUATE TRUE                                                00280200
280300         WHEN SC-DB2-SQLCODE-OK                                   00280300
280400              ADD +1                                              00280400
280500               TO WS-NBR-ROWS-READ-MEXW003                        00280500
280600              SET MEXW003-FOUND-80F                               00280600
280700               TO TRUE                                            00280700
280800                                                                  00280800
280900         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00280900
281000              SET MEXW003-NOT-FOUND-80F                           00281000
281100               TO TRUE                                            00281100
281200                                                                  00281200
281300         WHEN OTHER                                               00281300
281400              MOVE SQLCODE                                        00281400
281500                TO DB2-ABEND-SQLCODE                              00281500
281600              MOVE "SELECT"                                       00281600
281700                TO DB2-ABEND-FUNCTION                             00281700
281800              MOVE LIT-TBL-VEH-STATUS                             00281800
281900                TO DB2-ABEND-TABLE                                00281900
282000              MOVE DB2-ABEND-MSG                                  00282000
282100                TO ABEND-MSG                                      00282100
282200              MOVE "5200C"                                        00282200
282300                TO ABEND-PARAGRAPH                                00282300
282400              PERFORM 9999I-ABEND                                 00282400
282500     END-EVALUATE                                                 00282500
282600     .                                                            00282600
282700                                                                  00282700
282800******************************************************************00282800
282900* AT THIS POINT, A CURSOR WILL BE CREATED USING TABLE MEXW003 TO  00282900
283000* SELECT ALL 40V STATUS CODES WITH AN FTC QAD CURRENT DATA SOURCE 00283000
283100* (WD). THE NEWEST ROW CONTAINS THE WHOLESALE GLOBAL DEALER CODE  00283100
283200* TO SEND TO VINCENT. AN "ORDER BY VST_STAT_Y DESC" IS USED       00283200
283300* TO ACCOMPLISH THIS, WITH THE STATIC TIMESTAMP BREAKING ANY TIES.00283300
283400******************************************************************00283400
283500 5220C-OPEN-40V-CSR.                                              00283500
283600                                                                  00283600
283700     MOVE VEH-ORD-ID-C                                            00283700
283800       TO VST-VEH-ORD-ID-C                                        00283800
283900     MOVE VEH-DTA-DATA-SRC-C                                      00283900
284000       TO VST-DTA-DATA-SRC-C                                      00284000
284100     MOVE LIT-40V                                                 00284100
284200       TO VST-STA-STATUS-C                                        00284200
284300     MOVE LIT-D                                                   00284300
284400       TO VST-STAT-TYP-C                                          00284400
284500     MOVE LIT-Y                                                   00284500
284600       TO VST-ACTIVE-F                                            00284600
284700     MOVE LIT-WD                                                  00284700
284800       TO VST-CUR-DATA-SRC-C                                      00284800
284900                                                                  00284900
285000     EXEC SQL                                                     00285000
285100        OPEN MEXW003_40V_CSR                                      00285100
285200     END-EXEC                                                     00285200
285300                                                                  00285300
285400     MOVE SQLCODE                                                 00285400
285500       TO SC-DB2-SQLCODE                                          00285500
285600                                                                  00285600
285700     EVALUATE TRUE                                                00285700
285800         WHEN SC-DB2-SQLCODE-OK                                   00285800
285900              CONTINUE                                            00285900
286000                                                                  00286000
286100         WHEN OTHER                                               00286100
286200              MOVE SQLCODE                                        00286200
286300                TO DB2-ABEND-SQLCODE                              00286300
286400              MOVE "OPEN"                                         00286400
286500                TO DB2-ABEND-FUNCTION                             00286500
286600              MOVE LIT-TBL-VEH-STATUS                             00286600
286700                TO DB2-ABEND-TABLE                                00286700
286800              MOVE DB2-ABEND-MSG                                  00286800
286900                TO ABEND-MSG                                      00286900
287000              MOVE "5220C"                                        00287000
287100                TO ABEND-PARAGRAPH                                00287100
287200              PERFORM 9999I-ABEND                                 00287200
287300     END-EVALUATE                                                 00287300
287400     .                                                            00287400
287500                                                                  00287500
287600******************************************************************00287600
287700* FETCHES A ROW FROM MEXW003_40V_CSR WHICH WILL RETRIEVE THE      00287700
287800* MOST RECENT FTC QAD (WD) WHOLESALE GLOBAL DEALER CODE.          00287800
287900******************************************************************00287900
288000 5230C-FETCH-40V-ROW.                                             00288000
288100                                                                  00288100
288200     EXEC SQL                                                     00288200
288300        FETCH  MEXW003_40V_CSR                                    00288300
288400         INTO   :VST-GBL-LOC-C                                    00288400
288500     END-EXEC                                                     00288500
288600                                                                  00288600
288700     MOVE SQLCODE                                                 00288700
288800       TO SC-DB2-SQLCODE                                          00288800
288900                                                                  00288900
289000     EVALUATE TRUE                                                00289000
289100         WHEN SC-DB2-SQLCODE-OK                                   00289100
289200              ADD +1                                              00289200
289300               TO WS-NBR-ROWS-READ-MEXW003                        00289300
289400              SET MEXW003-40V-CSR-ROW-FOUND                       00289400
289500               TO TRUE                                            00289500
289600                                                                  00289600
289700         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00289700
289800              SET MEXW003-40V-CSR-ROW-NOT-FOUND                   00289800
289900               TO TRUE                                            00289900
290000                                                                  00290000
290100         WHEN OTHER                                               00290100
290200              MOVE SQLCODE                                        00290200
290300                TO DB2-ABEND-SQLCODE                              00290300
290400              MOVE "FETCH"                                        00290400
290500                TO DB2-ABEND-FUNCTION                             00290500
290600              MOVE LIT-TBL-VEH-STATUS                             00290600
290700                TO DB2-ABEND-TABLE                                00290700
290800              MOVE DB2-ABEND-MSG                                  00290800
290900                TO ABEND-MSG                                      00290900
291000              MOVE "5230C"                                        00291000
291100                TO ABEND-PARAGRAPH                                00291100
291200              PERFORM 9999I-ABEND                                 00291200
291300     END-EVALUATE                                                 00291300
291400     .                                                            00291400
291500                                                                  00291500
291600******************************************************************00291600
291700* CLOSES THE MEXW003_40V_CSR WHICH WAS USED TO RETRIEVE THE       00291700
291800* MOST RECENT FTC QAD (WD) WHOLESALE GLOBAL DEALER CODE.          00291800
291900******************************************************************00291900
292000 5240C-CLOSE-40V-CSR.                                             00292000
292100                                                                  00292100
292200     EXEC SQL                                                     00292200
292300        CLOSE MEXW003_40V_CSR                                     00292300
292400     END-EXEC                                                     00292400
292500                                                                  00292500
292600     MOVE SQLCODE                                                 00292600
292700       TO SC-DB2-SQLCODE                                          00292700
292800                                                                  00292800
292900     EVALUATE TRUE                                                00292900
293000         WHEN SC-DB2-SQLCODE-OK                                   00293000
293100              CONTINUE                                            00293100
293200                                                                  00293200
293300         WHEN OTHER                                               00293300
293400              MOVE SQLCODE                                        00293400
293500                TO DB2-ABEND-SQLCODE                              00293500
293600              MOVE "CLOSE"                                        00293600
293700                TO DB2-ABEND-FUNCTION                             00293700
293800              MOVE LIT-TBL-VEH-STATUS                             00293800
293900                TO DB2-ABEND-TABLE                                00293900
294000              MOVE DB2-ABEND-MSG                                  00294000
294100                TO ABEND-MSG                                      00294100
294200              MOVE "5240C"                                        00294200
294300                TO ABEND-PARAGRAPH                                00294300
294400              PERFORM 9999I-ABEND                                 00294400
294500     END-EVALUATE                                                 00294500
294600     .                                                            00294600
294700                                                                  00294700
294800******************************************************************00294800
294900* A CURSOR WILL BE CREATED USING TABLE MEXW031.  ALL NON 'NA' AND 00294900
295000* NON 'EA' SOURCES WILL SELECT FROM IT.  THE RETRIEVED VALUES     00295000
295100* WILL BE SENT IN PLACE OF THE LOCAL BODY STYLE CODE THAT WAS     00295100
295200* OBTAINED FROM TABLE MEXW001_VEH_ORDER.                          00295200
295300******************************************************************00295300
295400 5300C-OPEN-MEXW031-CSR.                                          00295400
295500                                                                  00295500
295600     MOVE VEH-DTA-DATA-SRC-C                                      00295600
295700       TO CTM-DTA-DATA-SRC-C                                      00295700
295800     MOVE VEH-CATALOG-C                                           00295800
295900       TO CTM-LCL-CATALOG-C                                       00295900
296000                                                                  00296000
296100     EXEC SQL                                                     00296100
296200        OPEN MEXW031_CSR                                          00296200
296300     END-EXEC                                                     00296300
296400                                                                  00296400
296500     MOVE SQLCODE                                                 00296500
296600       TO SC-DB2-SQLCODE                                          00296600
296700                                                                  00296700
296800     EVALUATE TRUE                                                00296800
296900         WHEN SC-DB2-SQLCODE-OK                                   00296900
297000              CONTINUE                                            00297000
297100                                                                  00297100
297200         WHEN OTHER                                               00297200
297300              MOVE SQLCODE                                        00297300
297400                TO DB2-ABEND-SQLCODE                              00297400
297500              MOVE "OPEN"                                         00297500
297600                TO DB2-ABEND-FUNCTION                             00297600
297700              MOVE LIT-TBL-CATMAP                                 00297700
297800                TO DB2-ABEND-TABLE                                00297800
297900              MOVE DB2-ABEND-MSG                                  00297900
298000                TO ABEND-MSG                                      00298000
298100              MOVE "5300C"                                        00298100
298200                TO ABEND-PARAGRAPH                                00298200
298300              PERFORM 9999I-ABEND                                 00298300
298400     END-EVALUATE                                                 00298400
298500     .                                                            00298500
298600                                                                  00298600
298700******************************************************************00298700
298800* FETCHES A ROW FROM MEXW031_CSR WHICH WILL RETRIEVE OPTION CODE  00298800
298900* AND PRODUCT TYPE WHICH WILL BE COMBINED AND THEN USED TO POP-   00298900
299000* ULATE THE WERS BODY STYLE CODE FOR NON 'NA' AND NON 'EA' DATA   00299000
299100* SOURCES.                                                        00299100
299200******************************************************************00299200
299300 5320C-FETCH-MEXW031-CSR.                                         00299300
299400                                                                  00299400
299500     EXEC SQL                                                     00299500
299600        FETCH  MEXW031_CSR                                        00299600
299700         INTO   :CTM-OPT-OPTION-C                                 00299700
299800               ,:CTM-VPT-PROD-TYP-C                               00299800
299900     END-EXEC                                                     00299900
300000                                                                  00300000
300100     MOVE SQLCODE                                                 00300100
300200       TO SC-DB2-SQLCODE                                          00300200
300300                                                                  00300300
300400     EVALUATE TRUE                                                00300400
300500         WHEN SC-DB2-SQLCODE-OK                                   00300500
300600              ADD +1                                              00300600
300700               TO WS-NBR-ROWS-READ-MEXW031                        00300700
300800              SET MEXW031-FOUND                                   00300800
300900               TO TRUE                                            00300900
301000                                                                  00301000
301100         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00301100
301200              SET MEXW031-NOT-FOUND                               00301200
301300               TO TRUE                                            00301300
301400                                                                  00301400
301500         WHEN OTHER                                               00301500
301600              MOVE SQLCODE                                        00301600
301700                TO DB2-ABEND-SQLCODE                              00301700
301800              MOVE "FETCH"                                        00301800
301900                TO DB2-ABEND-FUNCTION                             00301900
302000              MOVE LIT-TBL-CATMAP                                 00302000
302100                TO DB2-ABEND-TABLE                                00302100
302200              MOVE DB2-ABEND-MSG                                  00302200
302300                TO ABEND-MSG                                      00302300
302400              MOVE "5320C"                                        00302400
302500                TO ABEND-PARAGRAPH                                00302500
302600              PERFORM 9999I-ABEND                                 00302600
302700     END-EVALUATE                                                 00302700
302800     .                                                            00302800
302900                                                                  00302900
303000******************************************************************00303000
303100* CLOSES CURSOR MEXW031_CSE WHICH RETRIEVED THE OPTION CODE AND   00303100
303200* PRODUCT TYPE FOR NON 'NA' AND NON 'EA' DATA SOURCES.            00303200
303300******************************************************************00303300
303400 5340C-CLOSE-MEXW031-CSR.                                         00303400
303500                                                                  00303500
303600     EXEC SQL                                                     00303600
303700        CLOSE MEXW031_CSR                                         00303700
303800     END-EXEC                                                     00303800
303900                                                                  00303900
304000     MOVE SQLCODE                                                 00304000
304100       TO SC-DB2-SQLCODE                                          00304100
304200                                                                  00304200
304300     EVALUATE TRUE                                                00304300
304400         WHEN SC-DB2-SQLCODE-OK                                   00304400
304500              CONTINUE                                            00304500
304600                                                                  00304600
304700         WHEN OTHER                                               00304700
304800              MOVE SQLCODE                                        00304800
304900                TO DB2-ABEND-SQLCODE                              00304900
305000              MOVE "CLOSE"                                        00305000
305100                TO DB2-ABEND-FUNCTION                             00305100
305200              MOVE LIT-TBL-CATMAP                                 00305200
305300                TO DB2-ABEND-TABLE                                00305300
305400              MOVE DB2-ABEND-MSG                                  00305400
305500                TO ABEND-MSG                                      00305500
305600              MOVE "5340C"                                        00305600
305700                TO ABEND-PARAGRAPH                                00305700
305800              PERFORM 9999I-ABEND                                 00305800
305900     END-EVALUATE                                                 00305900
306000     .                                                            00306000
306100                                                                  00306100
306200***************************************************************** 00306200
306300* WRITES A RECORD TO THE GSAM OUTPUT FILE.                        00306300
306400***************************************************************** 00306400
306500 6000C-WRITE-VINCENT-RECORD.                                      00306500
306600                                                                  00306600
306700     CALL "CBLTDLI" USING SL-FUNC-ISRT                            00306700
306800                          VINCENT-PCB                             00306800
306900                          WS-VINCENT-OUTPUT-RECORD                00306900
307000                                                                  00307000
307100     MOVE VINCENT-PCB-STATUS                                      00307100
307200       TO SC-IMS-STAT                                             00307200
307300                                                                  00307300
307400     IF  SC-IMS-STAT-OK                                           00307400
307500         ADD +1                                                   00307500
307600          TO WS-NBR-OUTPUT-RECS-WRITTEN                           00307600
307700     ELSE                                                         00307700
307800         MOVE VINCENT-PCB-STATUS                                  00307800
307900           TO IMS-ABEND-STATUS                                    00307900
308000         MOVE SL-FUNC-ISRT                                        00308000
308100           TO IMS-ABEND-FUNCTION                                  00308100
308200         MOVE VINCENT-PCB-NAME                                    00308200
308300           TO IMS-ABEND-PCB-NAME                                  00308300
308400         MOVE IMS-ABEND-MSG                                       00308400
308500           TO ABEND-MSG                                           00308500
308600         MOVE "6000C"                                             00308600
308700           TO ABEND-PARAGRAPH                                     00308700
308800         PERFORM 9999I-ABEND                                      00308800
308900     END-IF                                                       00308900
309000     .                                                            00309000
309100                                                                  00309100
309200******************************************************************00309200
309300* THIS PARAGRAPH WILL WRITE ALL THE AUDIT INFORMATION OUT TO THE  00309300
309400* AUDIT REPORT.                                                   00309400
309500******************************************************************00309500
309600 6020C-WRITE-AUDIT-DETAIL.                                        00309600
309700                                                                  00309700
309800     MOVE SPACES                                                  00309800
309900       TO AUDIT-RECORD                                            00309900
310000     WRITE AUDIT-RECORD                                           00310000
310100                                                                  00310100
310200     MOVE ALL "="                                                 00310200
310300       TO AUDIT-RECORD                                            00310300
310400     WRITE AUDIT-RECORD                                           00310400
310500                                                                  00310500
310600     MOVE SPACES                                                  00310600
310700       TO AUDIT-RECORD                                            00310700
310800     WRITE AUDIT-RECORD                                           00310800
310900                                                                  00310900
311000     MOVE "TTL ROWS READ FROM MEXW001 :"                          00311000
311100       TO AUDIT-LABEL                                             00311100
311200     MOVE WS-NBR-ROWS-READ-MEXW001                                00311200
311300       TO AUDIT-DATA                                              00311300
311400     WRITE AUDIT-RECORD                                           00311400
311500                                                                  00311500
311600     MOVE "TTL ROWS READ FROM SALE-CHK :"                         00311600
311700       TO AUDIT-LABEL                                             00311700
311800     MOVE WS-NBR-ROWS-READ-SALE-CHK                               00311800
311900       TO AUDIT-DATA                                              00311900
312000     WRITE AUDIT-RECORD                                           00312000
312100                                                                  00312100
312200     MOVE "TTL ROWS READ FROM MEXW003 :"                          00312200
312300       TO AUDIT-LABEL                                             00312300
312400     MOVE WS-NBR-ROWS-READ-MEXW003                                00312400
312500       TO AUDIT-DATA                                              00312500
312600     WRITE AUDIT-RECORD                                           00312600
312700                                                                  00312700
312800     MOVE "TTL ROWS READ FROM MEXW004 :"                          00312800
312900       TO AUDIT-LABEL                                             00312900
313000     MOVE WS-NBR-ROWS-READ-MEXW004                                00313000
313100       TO AUDIT-DATA                                              00313100
313200     WRITE AUDIT-RECORD                                           00313200
313300                                                                  00313300
313400     MOVE "TTL ROWS READ FROM MEXW007 :"                          00313400
313500       TO AUDIT-LABEL                                             00313500
313600     MOVE WS-NBR-ROWS-READ-MEXW007                                00313600
313700       TO AUDIT-DATA                                              00313700
313800     WRITE AUDIT-RECORD                                           00313800
313900                                                                  00313900
314000     MOVE "TTL ROWS READ FROM MEXW008 :"                          00314000
314100       TO AUDIT-LABEL                                             00314100
314200     MOVE WS-NBR-ROWS-READ-MEXW008                                00314200
314300       TO AUDIT-DATA                                              00314300
314400     WRITE AUDIT-RECORD                                           00314400
314500                                                                  00314500
314600     MOVE "TTL ROWS READ FROM MEXW027 :"                          00314600
314700       TO AUDIT-LABEL                                             00314700
314800     MOVE WS-NBR-ROWS-READ-MEXW027                                00314800
314900       TO AUDIT-DATA                                              00314900
315000     WRITE AUDIT-RECORD                                           00315000
315100                                                                  00315100
315200     MOVE "TTL ROWS READ FROM MEXW031 :"                          00315200
315300       TO AUDIT-LABEL                                             00315300
315400     MOVE WS-NBR-ROWS-READ-MEXW031                                00315400
315500       TO AUDIT-DATA                                              00315500
315600     WRITE AUDIT-RECORD                                           00315600
315700                                                                  00315700
315800     MOVE "TTL ROWS READ FROM MEXW032 :"                          00315800
315900       TO AUDIT-LABEL                                             00315900
316000     MOVE WS-NBR-ROWS-READ-MEXW032                                00316000
316100       TO AUDIT-DATA                                              00316100
316200     WRITE AUDIT-RECORD                                           00316200
316300                                                                  00316300
316400     MOVE "TTL ROWS READ FROM MEXW033 :"                          00316400
316500       TO AUDIT-LABEL                                             00316500
316600     MOVE WS-NBR-ROWS-READ-MEXW033                                00316600
316700       TO AUDIT-DATA                                              00316700
316800     WRITE AUDIT-RECORD                                           00316800
316900                                                                  00316900
317000     MOVE "TTL ROWS READ FROM MEXW034 :"                          00317000
317100       TO AUDIT-LABEL                                             00317100
317200     MOVE WS-NBR-ROWS-READ-MEXW034                                00317200
317300       TO AUDIT-DATA                                              00317300
317400     WRITE AUDIT-RECORD                                           00317400
317500                                                                  00317500
317600     MOVE "TTL ROWS READ FROM MEXW035 :"                          00317600
317700       TO AUDIT-LABEL                                             00317700
317800     MOVE WS-NBR-ROWS-READ-MEXW035                                00317800
317900       TO AUDIT-DATA                                              00317900
318000     WRITE AUDIT-RECORD                                           00318000
318100                                                                  00318100
318200     MOVE "TTL SYSPARM RECORDS READ   :"                          00318200
318300       TO AUDIT-LABEL                                             00318300
318400     MOVE WS-NBR-SYSPARM-RECS-READ                                00318400
318500       TO AUDIT-DATA                                              00318500
318600     WRITE AUDIT-RECORD                                           00318600
318700                                                                  00318700
318800     MOVE "TTL SUBROUTINE SSTK CALLS  :"                          00318800
318900       TO AUDIT-LABEL                                             00318900
319000     MOVE WS-NBR-EXWWSSTK-CALLS                                   00319000
319100       TO AUDIT-DATA                                              00319100
319200     WRITE AUDIT-RECORD                                           00319200
319300                                                                  00319300
319400     MOVE "TTL SSTK CALLS WITH +100   :"                          00319400
319500       TO AUDIT-LABEL                                             00319500
319600     MOVE WS-NBR-EXWWSSTK-NOTFOUND-CALLS                          00319600
319700       TO AUDIT-DATA                                              00319700
319800     WRITE AUDIT-RECORD                                           00319800
319900                                                                  00319900
320000     MOVE "TTL MEXW027 ROWS NOT FOUND :"                          00320000
320100       TO AUDIT-LABEL                                             00320100
320200     MOVE WS-NBR-MEXW027-NOTFOUND-CALLS                           00320200
320300       TO AUDIT-DATA                                              00320300
320400     WRITE AUDIT-RECORD                                           00320400
320500                                                                  00320500
320600     MOVE "TTL MEXW035 ROWS NOT FOUND :"                          00320600
320700       TO AUDIT-LABEL                                             00320700
320800     MOVE WS-NBR-MEXW035-NOTFOUND-CALLS                           00320800
320900       TO AUDIT-DATA                                              00320900
321000     WRITE AUDIT-RECORD                                           00321000
321100                                                                  00321100
321200     MOVE "TTL OUTPUT RECORDS WRITTEN :"                          00321200
321300       TO AUDIT-LABEL                                             00321300
321400     MOVE WS-NBR-OUTPUT-RECS-WRITTEN                              00321400
321500       TO AUDIT-DATA                                              00321500
321600     WRITE AUDIT-RECORD                                           00321600
321700     .                                                            00321700
321800                                                                  00321800
321900******************************************************************00321900
322000* OBTAINS THE CURRENT DEARBORN TIMESTAMP, PART OF WHICH WILL BE   00322000
322100* USED IN THE MAIN DRIVING CURSOR AND THE E & G HEADER/TRAILER    00322100
322200* ALONG WITH THE VINCENT HEADER.                                  00322200
322300******************************************************************00322300
322400 7000C-OBTAIN-DRBN-TIMESTAMP.                                     00322400
322500                                                                  00322500
322600     EXEC SQL                                                     00322600
322700        SET  :WS-CURR-DRBN-TIMESTAMP  = CURRENT TIMESTAMP         00322700
322800     END-EXEC                                                     00322800
322900                                                                  00322900
323000     MOVE SQLCODE TO SC-DB2-SQLCODE                               00323000
323100                                                                  00323100
323200     EVALUATE TRUE                                                00323200
323300         WHEN SC-DB2-SQLCODE-OK                                   00323300
323400              CONTINUE                                            00323400
323500                                                                  00323500
323600         WHEN OTHER                                               00323600
323700              MOVE SQLCODE                                        00323700
323800                TO DB2-ABEND-SQLCODE                              00323800
323900              MOVE "SELECT"                                       00323900
324000                TO DB2-ABEND-FUNCTION                             00324000
324100              MOVE LIT-TBL-GENERIC                                00324100
324200                TO DB2-ABEND-TABLE                                00324200
324300              MOVE DB2-ABEND-MSG                                  00324300
324400                TO ABEND-MSG                                      00324400
324500              MOVE "7000C"                                        00324500
324600                TO ABEND-PARAGRAPH                                00324600
324700              PERFORM 9999I-ABEND                                 00324700
324800     END-EVALUATE                                                 00324800
324900     .                                                            00324900
325000                                                                  00325000
325100******************************************************************00325100
325200* UPDATE THE TIMESTAMP ON THE MEXS016 TABLE WITH THE TIME THAT    00325200
325300* THE JOB STARTED.  THIS VALUE WILL BE READ IN THE NEXT TIME THIS 00325300
325400* PROGRAM IS EXECUTED.                                            00325400
325500******************************************************************00325500
325600 7250C-UPDATE-TIMESTAMP.                                          00325600
325700                                                                  00325700
325800      MOVE LIT-SYSTEM-ID                                          00325800
325900        TO GNT-SYSTEM-CD                                          00325900
326000      MOVE LIT-TABLE-ID                                           00326000
326100        TO GNT-TABLE-ID                                           00326100
326200      MOVE LIT-KEY-DATA-TIMESTAMP                                 00326200
326300        TO GNT-KEY-DATA                                           00326300
326400                                                                  00326400
326500      EXEC SQL                                                    00326500
326600          UPDATE MEXS016_GENERIC2                                 00326600
326700          SET    GNT_ATTRIBUTE_DATA = :WS-CURR-DRBN-TIMESTAMP     00326700
326800          WHERE  GNT_SYSTEM_CD      = :GNT-SYSTEM-CD              00326800
326900          AND    GNT_TABLE_ID       = :GNT-TABLE-ID               00326900
327000          AND    GNT_KEY_DATA       = :GNT-KEY-DATA               00327000
327100      END-EXEC                                                    00327100
327200                                                                  00327200
327300      MOVE SQLCODE TO SC-DB2-SQLCODE                              00327300
327400                                                                  00327400
327500     EVALUATE TRUE                                                00327500
327600         WHEN SC-DB2-SQLCODE-OK                                   00327600
327700              CONTINUE                                            00327700
327800                                                                  00327800
327900         WHEN OTHER                                               00327900
328000              MOVE SQLCODE                                        00328000
328100                TO DB2-ABEND-SQLCODE                              00328100
328200              MOVE "UPDATE"                                       00328200
328300                TO DB2-ABEND-FUNCTION                             00328300
328400              MOVE LIT-TBL-GENERIC                                00328400
328500                TO DB2-ABEND-TABLE                                00328500
328600              MOVE DB2-ABEND-MSG                                  00328600
328700                TO ABEND-MSG                                      00328700
328800              MOVE "7250C"                                        00328800
328900                TO ABEND-PARAGRAPH                                00328900
329000              PERFORM 9999I-ABEND                                 00329000
329100     END-EVALUATE                                                 00329100
329200     .                                                            00329200
329300                                                                  00329300
329400******************************************************************00329400
329500* SELECT THE PREVIOUS RUN'S OUTPUT FILE BATCH NUMBER.             00329500
329600******************************************************************00329600
329700 7300C-GET-BATCH-NBR.                                             00329700
329800                                                                  00329800
329900      MOVE LIT-SYSTEM-ID                                          00329900
330000        TO GNT-SYSTEM-CD                                          00330000
330100      MOVE LIT-TABLE-ID                                           00330100
330200        TO GNT-TABLE-ID                                           00330200
330300      MOVE LIT-KEY-DATA-BATCHCTL                                  00330300
330400        TO GNT-KEY-DATA                                           00330400
330500                                                                  00330500
330600     EXEC SQL                                                     00330600
330700         SELECT GNT_ATTRIBUTE_DATA                                00330700
330800         INTO  :GNT-ATTRIBUTE-DATA                                00330800
330900         FROM   MEXS016_GENERIC2                                  00330900
331000         WHERE  GNT_SYSTEM_CD = :GNT-SYSTEM-CD                    00331000
331100         AND    GNT_TABLE_ID  = :GNT-TABLE-ID                     00331100
331200         AND    GNT_KEY_DATA  = :GNT-KEY-DATA                     00331200
331300     END-EXEC                                                     00331300
331400                                                                  00331400
331500     MOVE SQLCODE                                                 00331500
331600               TO SC-DB2-SQLCODE                                  00331600
331700                                                                  00331700
331800     EVALUATE TRUE                                                00331800
331900         WHEN SC-DB2-SQLCODE-OK                                   00331900
332000              SET BATCHCTL-FOUND                                  00332000
332100               TO TRUE                                            00332100
332200                                                                  00332200
332300         WHEN SC-DB2-SQLCODE-INVALID-DATE                         00332300
332400              SET BATCHCTL-NOT-FOUND                              00332400
332500               TO TRUE                                            00332500
332600                                                                  00332600
332700         WHEN OTHER                                               00332700
332800              MOVE SQLCODE                                        00332800
332900                TO DB2-ABEND-SQLCODE                              00332900
333000              MOVE "SELECT"                                       00333000
333100                TO DB2-ABEND-FUNCTION                             00333100
333200              MOVE LIT-TBL-GENERIC                                00333200
333300                TO DB2-ABEND-TABLE                                00333300
333400              MOVE DB2-ABEND-MSG                                  00333400
333500                TO ABEND-MSG                                      00333500
333600              MOVE "7300C"                                        00333600
333700                TO ABEND-PARAGRAPH                                00333700
333800              PERFORM 9999I-ABEND                                 00333800
333900     END-EVALUATE                                                 00333900
334000     .                                                            00334000
334100                                                                  00334100
334200******************************************************************00334200
334300* UPDATE THE OUTPUT FILE'S BATCH NUMBER BY +1.                    00334300
334400******************************************************************00334400
334500 7350C-UPDATE-BATCH-NBR.                                          00334500
334600                                                                  00334600
334700      MOVE LIT-SYSTEM-ID                                          00334700
334800        TO GNT-SYSTEM-CD                                          00334800
334900      MOVE LIT-TABLE-ID                                           00334900
335000        TO GNT-TABLE-ID                                           00335000
335100      MOVE LIT-KEY-DATA-BATCHCTL                                  00335100
335200        TO GNT-KEY-DATA                                           00335200
335300      MOVE WS-CURRENT-BATCH-NBR                                   00335300
335400        TO GNT-ATTRIBUTE-DATA                                     00335400
335500                                                                  00335500
335600      EXEC SQL                                                    00335600
335700          UPDATE MEXS016_GENERIC2                                 00335700
335800          SET    GNT_ATTRIBUTE_DATA = :GNT-ATTRIBUTE-DATA         00335800
335900          WHERE  GNT_SYSTEM_CD      = :GNT-SYSTEM-CD              00335900
336000          AND    GNT_TABLE_ID       = :GNT-TABLE-ID               00336000
336100          AND    GNT_KEY_DATA       = :GNT-KEY-DATA               00336100
336200      END-EXEC                                                    00336200
336300                                                                  00336300
336400      MOVE SQLCODE TO SC-DB2-SQLCODE                              00336400
336500                                                                  00336500
336600     EVALUATE TRUE                                                00336600
336700         WHEN SC-DB2-SQLCODE-OK                                   00336700
336800              CONTINUE                                            00336800
336900                                                                  00336900
337000         WHEN OTHER                                               00337000
337100              MOVE SQLCODE                                        00337100
337200                TO DB2-ABEND-SQLCODE                              00337200
337300              MOVE "UPDATE"                                       00337300
337400                TO DB2-ABEND-FUNCTION                             00337400
337500              MOVE LIT-TBL-GENERIC                                00337500
337600                TO DB2-ABEND-TABLE                                00337600
337700              MOVE DB2-ABEND-MSG                                  00337700
337800                TO ABEND-MSG                                      00337800
337900              MOVE "7350C"                                        00337900
338000                TO ABEND-PARAGRAPH                                00338000
338100              PERFORM 9999I-ABEND                                 00338100
338200     END-EVALUATE                                                 00338200
338300     .                                                            00338300
338400                                                                  00338400
338500******************************************************************00338500
338600* POPULATES THE HUB HEADER TO THE OUTPUT FILE.                    00338600
338700******************************************************************00338700
338800 7400C-POPULATE-HUB-HEADER.                                       00338800
338900                                                                  00338900
339000      MOVE WS-LAYOUT-ID                                           00339000
339100        TO HUB-HDR-LAYOUT-ID                                      00339100
339200      MOVE WS-ENTITY-CD                                           00339200
339300        TO HUB-HDR-ENTITY-CODE                                    00339300
339400      MOVE WS-LAYOUT-ID                                           00339400
339500        TO HUB-HDR-LAYOUT-ID                                      00339500
339600      MOVE WS-CURR-DRBN-TIMESTAMP                                 00339600
339700        TO HUB-HDR-TIMESTAMP                                      00339700
339800      MOVE WS-CURRENT-BATCH-NBR                                   00339800
339900        TO HUB-HDR-BATCH-NBR                                      00339900
340000      MOVE WS-PROCESS-ID                                          00340000
340100        TO HUB-HDR-PROCESS-ID                                     00340100
340200      MOVE ZERO                                                   00340200
340300        TO HUB-HDR-TOTAL-REC-CNT                                  00340300
340400      MOVE SPACES                                                 00340400
340500        TO HUB-HDR-PRIMARY-CONTACT                                00340500
340600           HUB-HDR-SECOND-CONTACT                                 00340600
340700     MOVE HUB-HEADER                                              00340700
340800       TO WS-VINCENT-OUTPUT-RECORD                                00340800
340900      .                                                           00340900
341000                                                                  00341000
341100******************************************************************00341100
341200* POPULATES THE HUB TRAILER IN THE OUTPUT FILE.                   00341200
341300******************************************************************00341300
341400 7450C-POPULATE-HUB-TRAILER.                                      00341400
341500                                                                  00341500
341600      MOVE WS-ENTITY-CD                                           00341600
341700        TO HUB-TRL-ENTITY-CODE                                    00341700
341800      MOVE WS-LAYOUT-ID                                           00341800
341900        TO HUB-TRL-LAYOUT-ID                                      00341900
342000      MOVE WS-CURR-DRBN-TIMESTAMP                                 00342000
342100        TO HUB-TRL-TIMESTAMP                                      00342100
342200      MOVE WS-CURRENT-BATCH-NBR                                   00342200
342300        TO HUB-TRL-BATCH-NBR                                      00342300
342400      MOVE WS-PROCESS-ID                                          00342400
342500        TO HUB-TRL-PROCESS-ID                                     00342500
342600      MOVE WS-COUNT-DTL-NBR                                       00342600
342700        TO HUB-TRL-TOTAL-REC-CNT                                  00342700
342800      MOVE SPACES                                                 00342800
342900        TO HUB-TRL-PRIMARY-CONTACT                                00342900
343000           HUB-TRL-SECOND-CONTACT                                 00343000
343100     MOVE HUB-TRAILER                                             00343100
343200       TO WS-VINCENT-OUTPUT-RECORD                                00343200
343300      .                                                           00343300
343400                                                                  00343400
343500******************************************************************00343500
343600* POPULATES THE VINCENT HEADER IN THE OUTPUT FILE.                00343600
343700******************************************************************00343700
343800 7500C-POPULATE-VINCENT-HEADER.                                   00343800
343900                                                                  00343900
344000      INITIALIZE VNT-HDR-HUB-REC-ID-NBR                           00344000
344100      MOVE 1                                                      00344100
344200        TO VNT-HDR-HUB-LINE-NBR                                   00344200
344300           VNT-HDR-REC-ID-NBR                                     00344300
344400           WS-COUNT-LINE-NBR                                      00344400
344500      STRING                                                      00344500
344600          WS-DRBN-YEAR                                            00344600
344700          WS-DRBN-MONTH                                           00344700
344800          WS-DRBN-DAY                                             00344800
344900          DELIMITED BY SIZE                                       00344900
345000        INTO                                                      00345000
345100          VNT-HDR-CURR-DATE                                       00345100
345200      END-STRING                                                  00345200
345300      STRING                                                      00345300
345400          WS-DRBN-HOUR                                            00345400
345500          WS-DRBN-MINUTE                                          00345500
345600          WS-DRBN-SECOND                                          00345600
345700          DELIMITED BY SIZE                                       00345700
345800        INTO                                                      00345800
345900          VNT-HDR-CURR-TIME                                       00345900
346000      END-STRING                                                  00346000
346100      MOVE LIT-WDMSALEM                                           00346100
346200        TO VNT-HDR-REC-TYPE                                       00346200
346300      MOVE WS-CURRENT-BATCH-NBR                                   00346300
346400        TO VNT-HDR-CURR-BATCH-NBR                                 00346400
346500      MOVE WS-PREV-BATCH-NBR                                      00346500
346600        TO VNT-HDR-PREV-BATCH-NBR                                 00346600
346700      MOVE LOW-VALUES                                             00346700
346800        TO VNT-HDR-LOW-VALUES                                     00346800
346900      MOVE VINCENT-HEADER                                         00346900
347000        TO WS-VINCENT-OUTPUT-RECORD                               00347000
347100      .                                                           00347100
347200                                                                  00347200
347300******************************************************************00347300
347400* POPULATES THE VINCENT TRAILER IN THE OUTPUT FILE.               00347400
347500******************************************************************00347500
347600 7550C-POPULATE-VINCENT-TRAILER.                                  00347600
347700                                                                  00347700
347800      INITIALIZE VNT-TRL-HUB-REC-ID-NBR                           00347800
347900      ADD  1                                                      00347900
348000        TO WS-COUNT-LINE-NBR                                      00348000
348100      MOVE WS-COUNT-LINE-NBR                                      00348100
348200        TO VNT-TRL-HUB-LINE-NBR                                   00348200
348300           VNT-TRL-REC-ID-NBR                                     00348300
348400      MOVE LIT-999                                                00348400
348500        TO VNT-TRL-HUB-REC-TYPE                                   00348500
348600      MOVE LIT-WDMSALEM                                           00348600
348700        TO VNT-TRL-REC-TYPE                                       00348700
348800      MOVE WS-CURRENT-BATCH-NBR                                   00348800
348900        TO VNT-TRL-CURR-BATCH-NBR                                 00348900
349000      MOVE WS-COUNT-DTL-NBR                                       00349000
349100        TO VNT-TRL-COUNTER                                        00349100
349200      MOVE VINCENT-TRAILER                                        00349200
349300        TO WS-VINCENT-OUTPUT-RECORD                               00349300
349400      .                                                           00349400
349500                                                                  00349500
349600******************************************************************00349600
349700* SELECTS WERS STRING FROM MEXW004_VEH_WERS_STRING DB2 TABLE      00349700
349800******************************************************************00349800
349900 7600C-SELECT-WERS-DATA-W004.                                     00349900
350000                                                                  00350000
350100     EXEC SQL                                                     00350100
350200         SELECT  VWR_WERS_STRING_X                                00350200
350300                ,VWR_WERS_VL_C                                    00350300
350400                ,VWR_WERS_PRD_TP_C                                00350400
350500                ,VWR_MAJ_FEAT_DFNED_F                             00350500
350600           INTO :VWR-WERS-STRING-X                                00350600
350700               ,:VWR-WERS-VL-C                                    00350700
350800               ,:VWR-WERS-PRD-TP-C                                00350800
350900               ,:VWR-MAJ-FEAT-DFNED-F                             00350900
351000           FROM  MEXW004_VEH_WERS_STRING                          00351000
351100          WHERE  VEH_ORD_ID_C     =  :VWR-VEH-ORD-ID-C            00351100
351200            AND  DTA_DATA_SRC_C   =  :VWR-DTA-DATA-SRC-C          00351200
351300     END-EXEC                                                     00351300
351400                                                                  00351400
351500     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00351500
351600                                                                  00351600
351700     EVALUATE TRUE                                                00351700
351800         WHEN SC-DB2-SQLCODE-OK                                   00351800
351900              IF VWR-WERS-STRING-X-TEXT    > SPACES    AND        00351900
352000                 VWR-MAJ-FEAT-DFNED-F      = LIT-Y                00352000
352100                 SET WERS-STRING-FOUND-SW     TO TRUE             00352100
352200                 ADD +1                       TO                  00352200
352300                                      WS-NBR-ROWS-READ-MEXW004    00352300
352400              END-IF                                              00352400
352500                                                                  00352500
352600         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00352600
352700              SET WERS-STRING-NOT-FOUND-SW                        00352700
352800                                      TO TRUE                     00352800
352900                                                                  00352900
353000         WHEN OTHER                                               00353000
353100              PERFORM 7620C-WRITE-MEXW004-AUDIT-RPT               00353100
353200              MOVE SC-DB2-SQLCODE     TO DB2-ABEND-SQLCODE        00353200
353300              MOVE "SELECT"           TO DB2-ABEND-FUNCTION       00353300
353400              MOVE LIT-TBL-MEXW004    TO DB2-ABEND-TABLE          00353400
353500              MOVE DB2-ABEND-MSG      TO ABEND-MSG                00353500
353600              MOVE "7600C"            TO ABEND-PARAGRAPH          00353600
353700                                                                  00353700
353800              PERFORM 9999I-ABEND                                 00353800
353900                                                                  00353900
354000     END-EVALUATE                                                 00354000
354100                                                                  00354100
354200     .                                                            00354200
354300                                                                  00354300
354400/*****************************************************************00354400
354500* WRITE AUDIT REPORT FOR MEXW004_VEH_WERS_STRING TABLE           *00354500
354600******************************************************************00354600
354700 7620C-WRITE-MEXW004-AUDIT-RPT.                                   00354700
354800                                                                  00354800
354900     MOVE SPACES                     TO AUDIT-RECORD              00354900
355000                                                                  00355000
355100     MOVE " VWR-VEH-ORD-ID-C: "      TO AUDIT-LABEL               00355100
355200     MOVE VWR-VEH-ORD-ID-C           TO AUDIT-DATA                00355200
355300                                                                  00355300
355400     WRITE AUDIT-RECORD                                           00355400
355500     MOVE SPACES                     TO AUDIT-RECORD              00355500
355600                                                                  00355600
355700     MOVE " VWR-DTA-DATA-SRC-C: "    TO AUDIT-LABEL               00355700
355800     MOVE VWR-DTA-DATA-SRC-C         TO AUDIT-DATA                00355800
355900                                                                  00355900
356000     WRITE AUDIT-RECORD                                           00356000
356100     MOVE SPACES                     TO AUDIT-RECORD              00356100
356200                                                                  00356200
356300     .                                                            00356300
356400                                                                  00356400
356500******************************************************************00356500
356600* READS THE INPUT SYSPARM FILE TO OBTAIN THE PRODUCTION SOURCE.   00356600
356700******************************************************************00356700
356800 8000C-GET-SYSPARM-RECORD.                                        00356800
356900                                                                  00356900
357000     CALL "CBLTDLI" USING SL-FUNC-GN                              00357000
357100                          SYSPARM-PCB                             00357100
357200                          SYSPARM-RECORD                          00357200
357300                                                                  00357300
357400     MOVE SYSPARM-PCB-STATUS                                      00357400
357500       TO SC-IMS-STAT                                             00357500
357600                                                                  00357600
357700     EVALUATE TRUE                                                00357700
357800         WHEN SC-IMS-STAT-OK                                      00357800
357900              ADD +1                                              00357900
358000               TO WS-NBR-SYSPARM-RECS-READ                        00358000
358100              SET NOT-END-OF-SYSPARM-FILE                         00358100
358200               TO TRUE                                            00358200
358300         WHEN SC-IMS-STAT-END-OF-DB                               00358300
358400              SET END-OF-SYSPARM-FILE                             00358400
358500               TO TRUE                                            00358500
358600         WHEN OTHER                                               00358600
358700              MOVE SYSPARM-PCB-STATUS                             00358700
358800                TO IMS-ABEND-STATUS                               00358800
358900              MOVE SL-FUNC-GN                                     00358900
359000                TO IMS-ABEND-FUNCTION                             00359000
359100              MOVE SYSPARM-PCB-NAME                               00359100
359200                TO IMS-ABEND-PCB-NAME                             00359200
359300              MOVE IMS-ABEND-MSG                                  00359300
359400                TO ABEND-MSG                                      00359400
359500              MOVE "8000C"                                        00359500
359600                TO ABEND-PARAGRAPH                                00359600
359700              PERFORM 9999I-ABEND                                 00359700
359800     END-EVALUATE                                                 00359800
359900     .                                                            00359900
360000                                                                  00360000
360100******************************************************************00360100
360200* IF A CALL TO TABLE MEXW035 RESULTED IN A SQL +100 (NOT FOUND)   00360200
360300* CONDITION, THE INFORMATION WILL BE WRITTEN OUT TO THE AUDIT     00360300
360400* REPORT AND RETURN-CODE WILL BE SET TO 3, SO THAT AN EMAIL       00360400
360500* MESSAGE WILL BE SENT TO THE GEVIS HELPDESK TO INFORM THEM TO    00360500
360600* LOOK AT THE AUDIT REPORT.                                       00360600
360700******************************************************************00360700
360800 9000C-MISSING-MEXW035-ROW.                                       00360800
360900                                                                  00360900
361000     MOVE SPACES                                                  00361000
361100       TO AUDIT-RECORD                                            00361100
361200     WRITE AUDIT-RECORD                                           00361200
361300                                                                  00361300
361400     MOVE "MISSING DEALER ON MEXW035:  "                          00361400
361500       TO AUDIT-LABEL                                             00361500
361600     WRITE AUDIT-RECORD                                           00361600
361700                                                                  00361700
361800     MOVE "DEALER CODE:         "                                 00361800
361900       TO AUDIT-LABEL                                             00361900
362000     MOVE DLR-DLR-DLR-C                                           00362000
362100       TO AUDIT-DATA                                              00362100
362200     WRITE AUDIT-RECORD                                           00362200
362300                                                                  00362300
362400     MOVE "ASSOCIATED VIN:      "                                 00362400
362500       TO AUDIT-LABEL                                             00362500
362600     MOVE VEH-VIN-FULL-C                                          00362600
362700       TO AUDIT-DATA                                              00362700
362800     WRITE AUDIT-RECORD                                           00362800
362900                                                                  00362900
363000     ADD 1                                                        00363000
363100      TO WS-NBR-MEXW035-NOTFOUND-CALLS                            00363100
363200     .                                                            00363200
363300                                                                  00363300
363400******************************************************************00363400
363500* IF A CALL TO TABLE MEXW027 RESULTED IN A SQL +100 (NOT FOUND)   00363500
363600* CONDITION, THE INFORMATION WILL BE WRITTEN OUT TO THE AUDIT     00363600
363700* REPORT AND RETURN-CODE WILL BE SET TO 3, SO THAT AN EMAIL       00363700
363800* MESSAGE WILL BE SENT TO THE GEVIS HELPDESK TO INFORM THEM TO    00363800
363900* LOOK AT THE AUDIT REPORT.                                       00363900
364000******************************************************************00364000
364100 9100C-MISSING-MEXW027-ROW.                                       00364100
364200                                                                  00364200
364300     MOVE SPACES                                                  00364300
364400       TO AUDIT-RECORD                                            00364400
364500     WRITE AUDIT-RECORD                                           00364500
364600                                                                  00364600
364700     MOVE "MISSING STATUS ON MEXW027:  "                          00364700
364800       TO AUDIT-LABEL                                             00364800
364900     MOVE PL-SPACE                                                00364900
365000       TO AUDIT-DATA                                              00365000
365100     WRITE AUDIT-RECORD                                           00365100
365200                                                                  00365200
365300     MOVE "STATUS CODE:         "                                 00365300
365400       TO AUDIT-LABEL                                             00365400
365500     MOVE CNT-GBL-DATA-X                                          00365500
365600       TO AUDIT-DATA                                              00365600
365700     WRITE AUDIT-RECORD                                           00365700
365800                                                                  00365800
365900     MOVE "ASSOCIATED VIN:      "                                 00365900
366000       TO AUDIT-LABEL                                             00366000
366100     MOVE VEH-VIN-FULL-C                                          00366100
366200       TO AUDIT-DATA                                              00366200
366300     WRITE AUDIT-RECORD                                           00366300
366400                                                                  00366400
366500     ADD 1                                                        00366500
366600      TO WS-NBR-MEXW027-NOTFOUND-CALLS                            00366600
366700     .                                                            00366700
366800                                                                  00366800
366900******************************************************************00366900
367000* CALLS COREDUMP TO FORCE AN ABEND CAUSED BY AN ERROR.            00367000
367100******************************************************************00367100
367200 9999C-CALL-COREDUMP.                                             00367200
367300                                                                  00367300
367400     CALL "COREDUMP"                                              00367400
367500     .                                                            00367500
367600                                                                  00367600
367700 COPY CPESEBCR.                                                   00367700
367800*BMPSHELL CALLED ROUTINES                                         00367800
367900                                                                  00367900
