000100 IDENTIFICATION DIVISION.                                         00000100
000200 PROGRAM-ID.    EXWWB910.                                         00000200
000300 AUTHOR.        STEVEN RYDZEWSKI.                                 00000300
000400 DATE-WRITTEN.  JULY 2006.                                        00000400
000500 DATE-COMPILED.                                                   00000500
000600                                                                  00000600
000700******************************************************************00000700
000800* PROGRAM DESCRIPTION                                             00000800
000900*                                                                 00000900
001000* EXWWB910 IS A BATCH PROGRAM THAT IS DESIGNED TO EXTRACT VEHICLE 00001000
001100* DATA, CUSTOMER DATA AND DEALER DATA FROM VARIOUS DB2 TABLES     00001100
001200* WHICH ARE OWNED AND MAINTAINED BY GEVIS AND TO CREATE AN        00001200
001300* OUTBOUND BRIDGE FILE WHICH WILL BE USED BY VINCENT (NORTH       00001300
001400* AMERICAN INCENTIVE CLAIMING SYSTEM) TO RE-REVIEW ALL VRULES     00001400
001500* PROGRAMS AND COMPARE TO ALL VIN RECORDS.  VINCENT WILL REVIEW   00001500
001600* CHARGEBACK (AUTOMATIC POST CLAIM VALIDATION) ) AND AUTO CLAIM   00001600
001700* GENERATION WHEN THE BUSINESS REQUESTS A "FULL PASS" IN VRULES.  00001700
001800*                                                                 00001800
001900* PROGRAM PROCESSSING:                                            00001900
002000* THE PROGRAM WILL READ IN AN INPUT SYSPARM FILE WHICH WILL       00002000
002100* CONTAIN A LIST OF PRODUCERS TO BE PROCESSED.  IT WILL PROCESS   00002100
002200* ONE PRODUCER AT A TIME.  WHEN A PRODUCER IS FIRST READ IN, A    00002200
002300* DB2 CURSOR WILL BE OPENED WHICH DRIVES OFF OF TABLE MEXW001_    00002300
002400* VEH_ORDER AND SELECTS ROWS WHERE THE MODEL YEARS ARE 1 YEAR     00002400
002500* BACK AND 2 YEARS FORWARD.  ONLY ROWS THAT ARE ASSOCIATED WITH   00002500
002600* A CURRENT WDMO DEALER WILL BE FURTHER  PROCESSED AND OUTPUT     00002600
002700* TO THE OUTBOUND BRIDGE FILE.  THE BRIDGE FILE WILL CONTAIN      00002700
002800* STANDARD E & G HEADERS/TRAILERS ALONG WITH VINCENT HEADERS/     00002800
002900* TRAILERS.                                                       00002900
003000* NOTE:  THERE MAY BE INSTANCES WHERE SOME FIELDS EXTRACTED       00003000
003100* FROM THE GEVIS DB2 TABLES, MAY NOT BE POPULATED WITH DATA.      00003100
003200* IN THAT CASE, IF THE FIELD IS ALPHANUMERIC, SPACES WILL BE      00003200
003300* CONTAINED WITHIN THE CORRESPONDING OUTPUT FIELD AND IF THE      00003300
003400* FIELD IS NUMERIC, ZEROS WILL BE CONTAINED WITHIN THE COR-       00003400
003500* CORRESPONDING OUTPUT FIELD.                                     00003500
003600*                                                                 00003600
003700******************************************************************00003700
003800*                       REVISION LOG                              00003800
003900*                                                                 00003900
004000* DATE     PROGRAMMER REVISION                                    00004000
004100* -------- ---------- ------------------------------------------- 00004100
004200* 07/25/06 SRYDZEW1   ORIGINAL PROGRAM CREATION                   00004200
004300*                                                                 00004300
004400* 11/21/06 SRYDZEW1   MODIFED PROGRAM TO SEND A VINCENT STATUS    00004400
004500*                     CODE OF 600 INSTEAD OF 800 WHEN THERE ARE   00004500
004600*                     NO SALES TYPE OR SALES DATE AVAILABLE.      00004600
004700*                     ALSO, THE GLOBAL ORDERING DEALER AND        00004700
004800*                     CURRENT GLOBAL STOCKING DEALER WILL BE      00004800
004900*                     POPULATED WITH A SUPER DEALER CODE, IF      00004900
005000*                     ONE EXISTS.  IF THERE IS NO CORRESPONDING   00005000
005100*                     SUPER DEALER CODE, THEN SPACES WILL BE      00005100
005200*                     MOVED.                                      00005200
005300*                                                                 00005300
005400* 05/01/07 SRYDZEW1   MODIFIED PROGRAM TO CALL NEW SUBROUTINE     00005400
005500*                     EXWWSSTK WHICH WILL BE USED TO OBTAIN THE   00005500
005600*                     CURRENT STOCKING DEALER, CURRENT STOCKING   00005600
005700*                     DEALER STATUS CODE AND CURRENT STOCKING     00005700
005800*                     DEALER STATUS DATE.  PREVIOUSLY, THAT DATA  00005800
005900*                     WAS OBTAINED INTERNALLY BY A CALL TO TABLE  00005900
006000*                     MEXW003.  NOTE:  IF A CALL TO EXWWSSTK      00006000
006100*                     RESULTS IN A SQL +100, THEN AN EMAIL        00006100
006200*                     MESSAGE WILL BE SENT TO THE HELP DESK       00006200
006300*                     TO LET THEM KNOW TO CHECK THE AUDIT REPORT  00006300
006400*                     WHICH WILL CONTAIN THE ORDER-ID AND SOURCE  00006400
006500*                     OF THE VEHICLES NOT FOUND.                  00006500
006600*                     E-TRACKER 1090765                           00006600
006700*                                                                 00006700
006800* 07/18/07 SRYDZEW1   MODIFIED PROGRAM TO RETURN THE CURRENT      00006800
006900*                     STATUS CODE RATHER THAN THE CURRENT STOCKING00006900
007000*                     DEALER'S STATUS CODE.  NOTE: THE CURRENT    00007000
007100*                     STOCKING DEALER AND CURRENT DEALER ARE THE  00007100
007200*                     SAME AS FAR AS VINCENT IS CONCERNED AND THAT00007200
007300*                     WILL NOT BE CHANGING.                       00007300
007400*                     E-TRACKER 5333232                           00007400
007500*                                                                 00007500
007600* 07/23/07 EGOSSEL2   MODIFIED PROGRAM TO RETURN THE CURRENT      00007600
007700*                     STATUS DATE RATHER THAN THE CURRENT STOCKING00007700
007800*                     DEALER'S STATUS DATE.                       00007800
007900*                                                                 00007900
008000******************************************************************00008000
008100* 04/29/08 SRYDZEW1   MODIFIED PROGRAM WITH THE FOLLOWING CHANGES 00008100
008200* WHICH WERE REQUESTED BY THE VINCENT/GEVIS BUSINESS TEAM:        00008200
008300*                                                                 00008300
008400* 1) THE MAIN DRIVING CURSOR WILL RETRIEVE ROWS WHICH ARE NOW 2   00008400
008500*    MODEL YEARS BACK, INSTEAD OF 1 MODEL YEAR BACK.              00008500
008600*                                                                 00008600
008700* 2) ALL VEHICLES WHICH HAVE BEEN REPORTED AS SOLD IN THE PAST    00008700
008800*    YEAR AND THAT ARE OLDER THAN 2 MODEL YEARS FROM THE CURRENT  00008800
008900*    RUN TIME YEAR WILL BE RETRIEVED.                             00008900
009000*                                                                 00009000
009100* ETRACKER 6726596                                                00009100
009200******************************************************************00009200
009300* 06/27/08 SRYDZEW1   MODIFIED PROGRAM TO BACK OUT THE CHANGE FROM00009300
009400* #1 ABOVE WHICH RETRIEVES ROWS THAT ARE 2 MODEL YEARS BACK.  WE  00009400
009500* WILL REVERT BACK TO GOING ONLY 1 MODEL YEAR BACK.  THIS CHANGE  00009500
009600* WILL REQUIRE A CHANGE TO #2 ABOVE.  THE CHANGE WILL BE TO PULL  00009600
009700* VEHICLES THAT HAVE BEEN REPORTED AS SOLD IN THE PAST YEAR AND   00009700
009800* ARE OLDER THAN 1 MODEL YEAR, INSTEAD OF 2 MODEL YEARS.  FINALLY,00009800
009900* A NEW CHANGE WILL BE IMPLEMENTED WHICH RETRIEVES BODY STYLE     00009900
010000* INFORMATION FROM TABLE MEXW031_CATMAP FOR NON 'NA' AND NON 'EA' 00010000
010100* SOURCES.  ALSO, THE GEVIS VEHICLE LINE WILL BE RETRIEVED FOR    00010100
010200* ALL SOURCES EXCEPT 'NA' AND 'EA' USING THE WERS VEHICLE LINE    00010200
010300* FROM THE CATALOG CODE AND SELECTING THE GEVIS VEHICLE LINE      00010300
010400* FROM TABLE MEXW034.                                             00010400
010500* THE FORE MENTIONED CHANGES ARE STILL PART OF ETRACKER 6726596.  00010500
010600*                                                                 00010600
010700* 07/13/09 TALFIERI   MODIFIED PROGRAM TO PROCESS DEMO SALES.     00010700
010800*                     ON A SALE SENT FROM GOALS, IF CUSTOMER TYPE 00010800
010900*                     IS "A4" (FOR DEALERSHIP USE), SEND A STATUS 00010900
011000*                     CODE OF "801" TO VINCENT.                   00011000
011100*                                                                 00011100
011200* 06/01/11 EDAVIS15   CHANGES MADE TO GET FEATURE DATA FROM THE   00011200
011300*                     WERS STRING ON MEXW004_VEH_WERS_STRING DB2  00011300
011400*                     TABLE INSTEAD OF THE CATALOG CODE IF THE    00011400
011500*                     WERS STRING EXISTS.                         00011500
011600*                     ETRACKER #10169343                          00011600
011700*                                                                 00011700
011800* 09/18/12 EDAVIS15   MODIFIED PROGRAM MEXW001_CSR CURSOR TO      00011800
011900*                     INCLUDE AN 'ORDER BY' DB2 STATEMENT TO      00011900
012000*                     IMPROVE PROFORMANCE AND REDUCE CPU USAGE.   00012000
012100*                     ETRACKER #11419683                          00012100
012200*                                                                 00012200
012300* 03/18/13 EDAVIS15   CHANGE PROGRAM TO REMOVE THE CALL TO        00012300
012400*                     SUBROUTINE EXWWSWER, IT IS USE TO FORMAT THE00012400
012500*                     WERS STRING PROCESS                         00012500
012600*                     ETRACKER: 11838861                          00012600
012700*                                                                 00012700
012900*                                                                 00012900
013000* DATE    : 05/20/2013  PROGRAMMER: DAWN MAHN                     00013000
013100* ETRACKER: 11108662                                              00013100
013200* REASON  : IF STATUS ROW IS NOT FOUND ON MEXW027 FOR SOURCE VI,  00013200
013300*           THE JOB WILL END WITH CC3 AND AN EMAIL WILL BE SENT   00013300
013400*           TO THE GEVIS HELP DESK.  THE TRANSACTION WILL NOT BE  00013400
013500*           WRITTEN TO THE OUTPUT FILE.                           00013500
013600*                                                                 00013600
013700* DATE    : 05/20/2013  PROGRAMMER: ESTES DAVIS                   00013700
013800* ETRACKER: 12551789                                              00013800
013900* REASON  : MODIFIED PROGRAM TO INCLUDE CHECKPOINT PROCESS AFTER  00013900
014000*           WRITING TO VINCENT OUTPUT FILE. THIS SHOULD           00014000
014100*           IMPROVE PROFORMANCE AND PREVENT LOCKING OF OTHER      00014100
014200*           GEVIS JOBS. ALSO, INCLUDE 'WITH HOLD' AND 'FOR READ   00014200
014300*           ONLY' FOR ALL CURSORS.                                00014300
014400*                                                                 00014400
014500* DATE    : 05/19/2014  PROGRAMMER: ESTES DAVIS                   00014500
014600* ETRACKER: 12661154                                              00014600
014700* REASON  : CODE CHANGES WERE INCLUDED TO INCREASE PERFORMANCE,   00014700
014800*           IF THIS DOESN'T HELP, ALL CODE ADDED SHOULD BE        00014800
014900*           REMOVED.                                              00014900
015000*           ADD 'WITH UR' DB2 OPTION TO ALL SELECT,               00015000
015100*           SELECT INTO AND FETCH (DECLARE) SQL STATEMENTS.       00015100
015200*           THIS IS ADDED FOR PERFORMANCE ISSUES.                 00015200
015300*                                                                 00015300
015400* DATE    : 06/18/2014  PROGRAMMER: ESTES DAVIS                   00015400
015500* ETRACKER: 12736949                                              00015500
015600* REASON  : REMOVED ALL 'WITH UR' DB2 OPTION FROM ALL CURSORS     00015600
015700*           AND SQL CALLS. UNFORTUNATELY THIS DID NOT IMPROVE     00015700
015800*           PRODUCTION RUN TIME.                                  00015800
015900*                                                                 00015900
016000* DATE    : 02/17/2015  PROGRAMMER: MARK FALLOT                   00016000
016100* ETRACKER: 12480445                                              00016100
016200* REASON  : CHANGE VINCENT SALES MINI EXTRACT TO GET THE          00016200
016300*           WHOLESALE GLOBAL DEALER CODE FROM FTC QAD.            00016300
016400*                                                                 00016400
016500* DATE    : 11/12/2015  PROGRAMMER: ESTES DAVIS                   00016500
016600* ETRACKER: 13835620                                              00016600
016700* REASON  : CHANGED TO INCLUDE WERS PRODUCT TYPE TO               00016700
016800*           MEXW034_VEH_BRAND TABLE.                              00016800
016900*           (5114C-SELECT-MEXW034-GEVIS-VL PARAGRAPH)             00016900
017000*           THE PRODUCT TYPE WAS SELECTED FROM                    00017000
017100*           MEXW032_CATALOG TABLE TO ACCOMPLISH THIS.             00017100
017200*           (5112C-SELECT-MEXW032-WERS-VL PARAGRAPH)              00017200
017300*                                                                 00017300
017310******************************************************************00017400
017320* DATE    : 02/08/2018  PROGRAMMER: DAWN MAHN                     00016500
017330* ETRACKER: 15334234                                              00016600
017340* REASON  : CHANGE THE MODEL YEAR CRITERIA IN THE CURSORS         00016700
017350*           FROM -1 TO -4.                                        00016800
017391*                                                                 00017300
017392*           CURSORS CHANGED: MEXW001_CSR AND SALE_CHK_CSR         00017300
017400******************************************************************00017400
017410* DATE    : 07/30/2018  PROGRAMMER: DAWN MAHN                     000165
017420* ETRACKER: 15525041                                              000166
017430* REASON  : REMOVE ALL REFERENCES TO STORED PROCEDURE EXWWSSTK    000167
017440*           TO IMPROVE PROCESSING TIME.                           000168
017450******************************************************************000174
017500 ENVIRONMENT DIVISION.                                            00017500
017600 INPUT-OUTPUT SECTION.                                            00017600
017700 FILE-CONTROL.                                                    00017700
017800                                                                  00017800
017900     SELECT AUDIT-FILE           ASSIGN TO AUDIT.                 00017900
018000                                                                  00018000
018100 DATA DIVISION.                                                   00018100
018200 FILE SECTION.                                                    00018200
018300                                                                  00018300
018400 FD  AUDIT-FILE.                                                  00018400
018500 01  AUDIT-RECORD.                                                00018500
018600     05  AUDIT-LABEL             PIC X(30).                       00018600
018700     05  AUDIT-DATA              PIC X(50).                       00018700
018800                                                                  00018800
018900******************************************************************00018900
019000*                 W O R K I N G   S T O R A G E                  *00019000
019100******************************************************************00019100
019200 WORKING-STORAGE SECTION.                                         00019200
019300 77  PAN-VALET PICTURE X(24) VALUE "070PEXWWB910 07/25/06".       00019300
019400                                                                  00019400
019500******************************************************************00019500
019600* WORKING STORAGE COPYBOOKS                                       00019600
019700******************************************************************00019700
019800                                                                  00019800
019900 COPY CPEWD001.                                                   00019900
020000*MEXW001 TABLE LAYOUT                                             00020000
020100                                                                  00020100
020200 COPY CPEWD003.                                                   00020200
020300*MEXW003 TABLE LAYOUT                                             00020300
020400                                                                  00020400
020500 COPY CPEWD004.                                                   00020500
020600* DCLGEN - MEXW004_WERS_STRING                                    00020600
020700                                                                  00020700
020800 COPY CPEWD007.                                                   00020800
020900*MEXW007 TABLE LAYOUT                                             00020900
021000                                                                  00021000
021100 COPY CPEWD008.                                                   00021100
021200*MEXW008 TABLE LAYOUT                                             00021200
021300                                                                  00021300
021400 COPY CPESD016.                                                   00021400
021500*MEXS016_GENERIC2                                                 00021500
021600                                                                  00021600
021700 COPY CPEWD021.                                                   00021700
021800*MEXW021 TABLE LAYOUT                                             00021800
021900                                                                  00021900
022000 COPY CPEWD027.                                                   00022000
022100*MEXW027 TABLE LAYOUT                                             00022100
022200                                                                  00022200
022300 COPY CPEWD031.                                                   00022300
022400*MEXW031 TABLE LAYOUT                                             00022400
022500                                                                  00022500
022600 COPY CPEWD032.                                                   00022600
022700*MEXW032 TABLE LAYOUT                                             00022700
022800                                                                  00022800
022900 COPY CPEWD033.                                                   00022900
023000*MEXW033 TABLE LAYOUT                                             00023000
023100                                                                  00023100
023200 COPY CPEWD034.                                                   00023200
023300*MEXW034 TABLE LAYOUT                                             00023300
023400                                                                  00023400
023500 COPY CPEWD035.                                                   00023500
023600*MEXW035 TABLE LAYOUT                                             00023600
023700                                                                  00023700
023800 COPY CPESDB2.                                                    00023800
023900*SQLCA AND SQLCODES                                               00023900
024000                                                                  00024000
024100 COPY CPESIMSB.                                                   00024100
024200*IMS FUNCTIONS AND STATUS CODES                                   00024200
024300                                                                  00024300
024400 COPY CPESGNTB.                                                   00024400
024500*GENERIC TABLE LAYOUTS - EXSE SYSTEM                              00024500
024600                                                                  00024600
024700 COPY CPEWGNTB.                                                   00024700
024800*GENERIC TABLE LAYOUT  - EXWW SYSTEM                              00024800
024900                                                                  00024900
025000 COPY CPESEBWS.                                                   00025000
025100*BMPSHELL WORKING STORAGE                                         00025100
025500                                                                  00025500
025700 01  CHKP-SAVE-AREA.                                              00025700
025800******************************************************************00025800
025900* WORKING STORAGE LITERALS                                        00025900
026000******************************************************************00026000
026100     05  LIT-00A                     PIC  X(03) VALUE "00A".      00026100
026200     05  LIT-001                     PIC  X(03) VALUE "001".      00026200
026300     05  LIT-010                     PIC  X(03) VALUE "010".      00026300
026400     05  LIT-10M                     PIC  X(03) VALUE "10M".      00026400
026500     05  LIT-20M                     PIC  X(03) VALUE "20M".      00026500
026600     05  LIT-20T                     PIC  X(03) VALUE "20T".      00026600
026700     05  LIT-30P                     PIC  X(03) VALUE "30P".      00026700
026800     05  LIT-30R                     PIC  X(03) VALUE "30R".      00026800
026900     05  LIT-30T                     PIC  X(03) VALUE "30T".      00026900
027000     05  LIT-40V                     PIC  X(03) VALUE "40V".      00027000
027100     05  LIT-80F                     PIC  X(03) VALUE "80F".      00027100
027200     05  LIT-90V                     PIC  X(03) VALUE "90V".      00027200
027300     05  LIT-025                     PIC  X(03) VALUE "025".      00027300
027400     05  LIT-185                     PIC  X(03) VALUE "185".      00027400
027500     05  LIT-190                     PIC  X(03) VALUE "190".      00027500
027600     05  LIT-600                     PIC  X(03) VALUE "600".      00027600
027700     05  LIT-800                     PIC  X(03) VALUE "800".      00027700
027800     05  LIT-801                     PIC  X(03) VALUE "801".      00027800
027900     05  LIT-999                     PIC  X(03) VALUE "999".      00027900
028000     05  LIT-TBL-VEH-ORDER           PIC X(18)                    00028000
028100                                     VALUE "MEXW001_VEH_ORDER ".  00028100
028200     05  LIT-TBL-VEH-STATUS          PIC X(18)                    00028200
028300                                     VALUE "MEXW003_VEH_STATUS".  00028300
028400     05  LIT-TBL-VEH-WHS             PIC X(18)                    00028400
028500                                     VALUE "MEXW007_VEH_WHS   ".  00028500
028600     05  LIT-TBL-MEXW003-07          PIC X(18)                    00028600
028700                                     VALUE "MEXW003/MEXW007   ".  00028700
028800     05  LIT-TBL-MEXW003-08          PIC X(18)                    00028800
028900                                     VALUE "MEXW003/MEXW008   ".  00028900
029000     05  LIT-TBL-MEXW004             PIC X(18)                    00029000
029100                                     VALUE "MEXW004_VEH_WERS_S".  00029100
029200     05  LIT-TBL-VEH-RTL             PIC X(18)                    00029200
029300                                     VALUE "MEXW008_VEH_RTL   ".  00029300
029400     05  LIT-TBL-GENERIC             PIC X(18)                    00029400
029500                                     VALUE "MEXS016_GENERIC2  ".  00029500
029600     05  LIT-TBL-SUBLVL-ASG          PIC X(18)                    00029600
029700                                     VALUE "MEXW021_SUBLVL_ASG".  00029700
029800     05  LIT-TBL-CONV                PIC X(18)                    00029800
029900                                     VALUE "MEXW027_CONV      ".  00029900
030000     05  LIT-TBL-VL-BRAND            PIC X(18)                    00030000
030100                                     VALUE "MEXW034_VL_BRAND  ".  00030100
030200     05  LIT-TBL-BODY-TYPE           PIC X(18)                    00030200
030300                                     VALUE "MEXW033_BODY_TYPE ".  00030300
030400     05  LIT-TBL-DLR-MSTR            PIC X(18)                    00030400
030500                                     VALUE "MEXW035_DLR_MSTR".    00030500
030600     05  LIT-TBL-CATMAP              PIC X(18)                    00030600
030700                                     VALUE "MEXW031_CATMAP".      00030700
030800     05  LIT-TBL-CATALOG             PIC X(18)                    00030800
030900                                     VALUE "MEXW032_CATALOG".     00030900
031000     05  LIT-SALE-CHK-CSR            PIC X(18)                    00031000
031100                                     VALUE "SALE_CHK_CSR".        00031100
031200     05  LIT-D                       PIC  X(01) VALUE "D".        00031200
031300     05  LIT-E                       PIC  X(01) VALUE "E".        00031300
031400     05  LIT-EX                      PIC  X(02) VALUE "EX".       00031400
031410     05  LIT-WDM                     PIC  X(03) VALUE "WDM".      00031400
031500     05  LIT-Y                       PIC  X(01) VALUE "Y".        00031500
031600     05  LIT-N                       PIC  X(01) VALUE "N".        00031600
031700     05  LIT-STATUS                  PIC  X(06) VALUE "STATUS".   00031700
031800     05  LIT-NA                      PIC  X(02) VALUE "NA".       00031800
031900     05  LIT-EA                      PIC  X(02) VALUE "EA".       00031900
032000     05  LIT-VI                      PIC  X(02) VALUE "VI".       00032000
032100     05  LIT-WD                      PIC  X(02) VALUE "WD".       00032100
032200     05  LIT-SYSTEM-ID               PIC  X(04) VALUE "EXWW".     00032200
032300     05  LIT-VEHLINE                 PIC  X(08) VALUE "VEHLINE ". 00032300
032400     05  LIT-USD                     PIC  X(04) VALUE "USD ".     00032400
032500     05  LIT-WDMSALEM                PIC  X(08) VALUE "WDMSALEM". 00032500
032600     05  LIT-TABLE-ID                PIC  X(08) VALUE "SYSPARM ". 00032600
032700     05  LIT-KEY-DATA-TIMESTAMP      PIC  X(20) VALUE             00032700
032800                                     "EXWWB910TIMESTMP".          00032800
032900     05  LIT-KEY-DATA-BATCHCTL       PIC  X(20) VALUE             00032900
033000                                     "EXWWB910BATCHCTL".          00033000
033100     05  PL-PGM-NAME                 PIC  X(08) VALUE "EXWWB910". 00033100
033300     05  PL-SYSTEM-CD                PIC  X(04) VALUE  "EXWW".    00033300
033400     05  PL-SPACE                    PIC  X(01) VALUE  " ".       00033400
033500     05  WS-LAYOUT-ID                PIC  X(20) VALUE             00033500
033600                                     "WGEVVNTEXTOUT010".          00033600
033700     05  WS-PROCESS-ID               PIC  X(20) VALUE             00033700
033800                                     "GEVVNTEXTOUT010".           00033800
033900     05  WS-ENTITY-CD                PIC  X(05) VALUE             00033900
034000                                     "EXPNG".                     00034000
034100     05  WS-VEH-VIN-BLANK            PIC  X(17) VALUE             00034100
034200                                     "                 ".         00034200
034300     05  WS-ORDER-ID-BLANK            PIC  X(25) VALUE            00034300
034400                                     "                         ". 00034400
034500                                                                  00034500
034600******************************************************************00034600
034700* WORKING STORAGE SWITCHES                                        00034700
034800******************************************************************00034800
034900     05  WS-SWITCHES.                                             00034900
035000         10  WS-MEXW001-SW               PIC X(01).               00035000
035100             88 MEXW001-FOUND            VALUE "Y".               00035100
035200             88 MEXW001-NOT-FOUND        VALUE "N".               00035200
035300         10  WS-MEXW003-20T-SW           PIC X(01).               00035300
035400             88 MEXW003-FOUND-20T        VALUE "Y".               00035400
035500             88 MEXW003-NOT-FOUND-20T    VALUE "N".               00035500
035600         10  WS-MEXW003-30P-SW           PIC X(01).               00035600
035700             88 MEXW003-FOUND-30P        VALUE "Y".               00035700
035800             88 MEXW003-NOT-FOUND-30P    VALUE "N".               00035800
035900         10  WS-MEXW003-30R-SW           PIC X(01).               00035900
036000             88 MEXW003-FOUND-30R        VALUE "Y".               00036000
036100             88 MEXW003-NOT-FOUND-30R    VALUE "N".               00036100
036200         10  WS-MEXW003-30T-SW           PIC X(01).               00036200
036300             88 MEXW003-FOUND-30T        VALUE "Y".               00036300
036400             88 MEXW003-NOT-FOUND-30T    VALUE "N".               00036400
036500         10  WS-MEXW003-40V-SW           PIC X(01).               00036500
036600             88 MEXW003-FOUND-40V        VALUE "Y".               00036600
036700             88 MEXW003-NOT-FOUND-40V    VALUE "N".               00036700
036800         10  WS-MEXW003-80F-SW           PIC X(01).               00036800
036900             88 MEXW003-FOUND-80F        VALUE "Y".               00036900
037000             88 MEXW003-NOT-FOUND-80F    VALUE "N".               00037000
037100         10  WS-MEXW008-90V-SW           PIC X(01).               00037100
037200             88 MEXW008-FOUND-90V        VALUE "Y".               00037200
037300             88 MEXW008-NOT-FOUND-90V    VALUE "N".               00037300
037400         10  WS-MEXW003-40V-CSR-ROW-FOUND                         00037400
037500                                         PIC X(01).               00037500
037600             88 MEXW003-40V-CSR-ROW-FOUND                         00037600
037700                                         VALUE "Y".               00037700
037800             88 MEXW003-40V-CSR-ROW-NOT-FOUND                     00037800
037900                                         VALUE "N".               00037900
038000         10  WS-MEXW007-SW               PIC X(01).               00038000
038100             88 MEXW007-FOUND            VALUE "Y".               00038100
038200             88 MEXW007-NOT-FOUND        VALUE "N".               00038200
038300         10  WS-MEXW008-SW               PIC X(01).               00038300
038400             88 MEXW008-FOUND            VALUE "Y".               00038400
038500             88 MEXW008-NOT-FOUND        VALUE "N".               00038500
038600         10  WS-MEXW021-SW               PIC X(01).               00038600
038700             88 MEXW021-FOUND            VALUE "Y".               00038700
038800             88 MEXW021-NOT-FOUND        VALUE "N".               00038800
038900         10  WS-MEXW027-SW               PIC X(01).               00038900
039000             88 MEXW027-FOUND            VALUE "Y".               00039000
039100             88 MEXW027-NOT-FOUND        VALUE "N".               00039100
039200         10  WS-MEXW027-MULTIPLE-SW      PIC X(01).               00039200
039300             88 MEXW027-MULTIPLE-FOUND   VALUE "Y".               00039300
039400             88 MEXW027-MULTIPLE-NOT-FOUND                        00039400
039500                                         VALUE "N".               00039500
039600         10  WS-MEXW031-SW               PIC X(01).               00039600
039700             88 MEXW031-FOUND            VALUE "Y".               00039700
039800             88 MEXW031-NOT-FOUND        VALUE "N".               00039800
039900         10  WS-MEXW032-SW               PIC X(01).               00039900
040000             88 MEXW032-FOUND            VALUE "Y".               00040000
040100             88 MEXW032-NOT-FOUND        VALUE "N".               00040100
040200         10  WS-MEXW033-SW               PIC X(01).               00040200
040300             88 MEXW033-FOUND            VALUE "Y".               00040300
040400             88 MEXW033-NOT-FOUND        VALUE "N".               00040400
040500         10  WS-MEXW034-SW                PIC X(01).              00040500
040600             88 MEXW034-FOUND            VALUE "Y".               00040600
040700             88 MEXW034-NOT-FOUND        VALUE "N".               00040700
040800         10  WS-MEXW035-SW               PIC X(01).               00040800
040900             88 MEXW035-FOUND            VALUE "Y".               00040900
041000             88 MEXW035-NOT-FOUND        VALUE "N".               00041000
041100         10  WS-END-OF-SYSPARM-FILE      PIC X(01).               00041100
041200             88 END-OF-SYSPARM-FILE      VALUE "Y".               00041200
041300             88 NOT-END-OF-SYSPARM-FILE  VALUE "N".               00041300
041400         10  WS-BATCHCTL-FOUND           PIC X(01).               00041400
041500             88 BATCHCTL-FOUND           VALUE "Y".               00041500
041600             88 BATCHCTL-NOT-FOUND       VALUE "N".               00041600
041700         10  WS-WDMO-DEALER              PIC X(01).               00041700
041800             88 WDMO-DEALER              VALUE "Y".               00041800
041900             88 NOT-WDMO-DEALER          VALUE "N".               00041900
042000         10  WS-SEND-EMAIL               PIC X(01).               00042000
042100             88 SEND-EMAIL               VALUE "Y".               00042100
042200             88 NOT-SEND-EMAIL           VALUE "N".               00042200
042300         10  WS-SALE-CHK-SW              PIC X(01).               00042300
042400             88 SALE-CHK-FOUND           VALUE "Y".               00042400
042500             88 SALE-CHK-NOT-FOUND       VALUE "N".               00042500
042600         10  SW-WERS-STRING              PIC X(01).               00042600
042700             88 WERS-STRING-FOUND-SW     VALUE "Y".               00042700
042800             88 WERS-STRING-NOT-FOUND-SW VALUE "N".               00042800
042810         10  SW-CURR-STAT                PIC X(01).
042820             88 CURR-STAT-FOUND-SW       VALUE "Y".
042900             88 CURR-STAT-NOT-FOUND-SW   VALUE "N".               00042900
042910
043000******************************************************************00043000
043100* WORKING STORAGE VARIABLES                                       00043100
043200******************************************************************00043200
043300     05  WS-VARIABLES.                                            00043300
043400         10  WS-NBR-ROWS-READ-MEXW001    PIC S9(9) COMP.          00043400
043500         10  WS-NBR-ROWS-READ-MEXW003    PIC S9(9) COMP.          00043500
043600         10  WS-NBR-ROWS-READ-MEXW004    PIC S9(9) COMP.          00043600
043700         10  WS-NBR-ROWS-READ-MEXW007    PIC S9(9) COMP.          00043700
043800         10  WS-NBR-ROWS-READ-MEXW008    PIC S9(9) COMP.          00043800
043900         10  WS-NBR-ROWS-READ-SALE-CHK   PIC S9(9) COMP.          00043900
044000         10  WS-NBR-ROWS-READ-MEXW021    PIC S9(9) COMP.          00044000
044100         10  WS-NBR-ROWS-READ-MEXW027    PIC S9(9) COMP.          00044100
044200         10  WS-NBR-ROWS-READ-MEXW031    PIC S9(9) COMP.          00044200
044300         10  WS-NBR-ROWS-READ-MEXW032    PIC S9(9) COMP.          00044300
044400         10  WS-NBR-ROWS-READ-MEXW033    PIC S9(9) COMP.          00044400
044500         10  WS-NBR-ROWS-READ-MEXW034    PIC S9(9) COMP.          00044500
044600         10  WS-NBR-ROWS-READ-MEXW035    PIC S9(9) COMP.          00044600
044700         10  WS-NBR-SYSPARM-RECS-READ    PIC S9(9) COMP.          00044700
045100         10  WS-NBR-MEXW027-NOTFOUND-CALLS                        00045100
045200                                         PIC S9(9) COMP.          00045200
045300         10  WS-NBR-MEXW035-NOTFOUND-CALLS                        00045300
045400                                         PIC S9(9) COMP.          00045400
045500         10  WS-NBR-OUTPUT-RECS-WRITTEN  PIC S9(9) COMP.          00045500
045600         10  WS-COUNT-DTL-NBR            PIC S9(9) COMP.          00045600
045700         10  WS-COUNT-LINE-NBR           PIC S9(9) COMP.          00045700
045800         10  WS-PREV-RUN-TIMESTAMP       PIC X(26).               00045800
045900         10  WS-PREV-BATCH-NBR           PIC 9(05).               00045900
046000         10  WS-CURRENT-BATCH-NBR        PIC 9(05).               00046000
046100         10  WS-CURR-DRBN-TIMESTAMP      PIC X(26).               00046100
046200         10  WS-CURR-DRBN-TIMESTAMP-REDEF REDEFINES               00046200
046300             WS-CURR-DRBN-TIMESTAMP.                              00046300
046400             15  WS-DRBN-YEAR            PIC 9(04).               00046400
046500             15  FILLER                  PIC X(01).               00046500
046600             15  WS-DRBN-MONTH           PIC X(02).               00046600
046700             15  FILLER                  PIC X(01).               00046700
046800             15  WS-DRBN-DAY             PIC X(02).               00046800
046900             15  FILLER                  PIC X(01).               00046900
047000             15  WS-DRBN-HOUR            PIC X(02).               00047000
047100             15  FILLER                  PIC X(01).               00047100
047200             15  WS-DRBN-MINUTE          PIC X(02).               00047200
047300             15  FILLER                  PIC X(01).               00047300
047400             15  WS-DRBN-SECOND          PIC X(02).               00047400
047500             15  FILLER                  PIC X(01).               00047500
047600             15  WS-DRBN-MILISECS        PIC X(06).               00047600
047700                                                                  00047700
047800         10  WS-CURR-DRBN-TMSTMP-LESS-1  PIC X(26).               00047800
047900         10  WS-CURR-DRBN-TMSTMP-LESS-1-R REDEFINES               00047900
048000             WS-CURR-DRBN-TMSTMP-LESS-1.                          00048000
048100             15  WS-DRBN-YEAR-LESS-1     PIC 9(04).               00048100
048200             15  FILLER                  PIC X(22).               00048200
048300                                                                  00048300
048400         10  WS-VEH-BDT-MDL-YR-Y         PIC 9(04).99.            00048400
048500         10  WS-VEH-BDT-MDL-YR-Y-RDF                              00048500
048600             REDEFINES WS-VEH-BDT-MDL-YR-Y.                       00048600
048700             15 WS-VEH-BDT-MDL-YR-CC     PIC X(02).               00048700
048800             15 WS-VEH-BDT-MDL-YR-YY     PIC X(02).               00048800
048900             15 WS-VEH-BDT-MDL-YR-FILLE  PIC X(01).               00048900
049000             15 WS-VEH-BDT-MDL-YR-QTR    PIC X(02).               00049000
049100         10  WS-CURR-MODEL-YY            PIC S9(04)V99 COMP-3.    00049100
049200         10  WS-VST-GBL-LOC-C-REFORMAT   PIC 9(06).               00049200
049300         10  WS-DLR-SUPER-DLR-C-REFORMAT PIC 9(06).               00049300
049400         10  WS-DTL-VEH-GBL-DLR-C-REFORMAT                        00049400
049500                                         PIC 9(06).               00049500
049600         10  WS-PROCESS-SQLCODE-EDIT     PIC +++++.               00049600
049700         10  AUDIT-RECORD-MSG.                                    00049700
049800             15  AUDIT-LABEL-MSG         PIC X(10).               00049800
049900             15  AUDIT-DATA-MSG          PIC X(70).               00049900
050000                                                                  00050000
050100     05  WS-VALID-VARIABLES.                                      00050100
050200         10  WS-WERS-VL-C                PIC  X(02).              00050200
050300             88  WS-VALID-VEH-LINE-CDS   VALUE "KI", "K5", "DB".  00050300
050400                                                                  00050400
050500******************************************************************00050500
050600* DO NOT PUT ANY COPYBOOKS WITH AN 01 LEVEL IN THIS SECTION. THIS*00050600
050700* AREA IS USED STRICTLY FOR DATA TO BE SAVED IN THE CHKP AREA.   *00050700
050800******************************************************************00050800
050900                                                                  00050900
051000 COPY CPEWHUB.                                                    00051000
051100*E & G HUB HEADER/TRAILER LAYOUT                                  00051100
051200                                                                  00051200
051300 COPY CPEWVNCT.                                                   00051300
051400*VINCENT HEADER/TRAILER LAYOUT                                    00051400
051500                                                                  00051500
051600                                                                  00051600
051700******************************************************************00051700
051800* RECORD DESCRIPTIONS FOR GSAM FILES                             *00051800
051900******************************************************************00051900
052000                                                                  00052000
052100 01  SYSPARM-RECORD.                                              00052100
052200     05  SYSPARM-DATA-SRC                PIC X(02).               00052200
052300     05  FILLER                          PIC X(78).               00052300
052400                                                                  00052400
052500 01  WS-VINCENT-OUTPUT-RECORD            PIC X(1000).             00052500
052600                                                                  00052600
052700 01  WS-VINCENT-DETAIL-RECORD.                                    00052700
052800     05  WS-DTL-HUB-LINE-NBR             PIC 9(06).               00052800
052900     05  WS-DTL-HUB-REC-ID               PIC X(25).               00052900
053000     05  WS-DTL-HUB-REC-ID-NBR REDEFINES                          00053000
053100         WS-DTL-HUB-REC-ID.                                       00053100
053200         10  WS-DTL-REC-ID-ZEROS         PIC 9(16).               00053200
053300         10  WS-DTL-REC-ID-NBR           PIC 9(09).               00053300
053400     05  WS-DTL-HUB-REC-TYPE             PIC X(03).               00053400
053500     05  WS-DTL-HUB-REC-SEQ-NBR          PIC 9(03).               00053500
053600     05  WS-DTL-VIN-FULL-C               PIC X(17).               00053600
053700     05  WS-DTL-DTA-DATA-SRC-C           PIC X(02).               00053700
053800     05  WS-DTL-BDT-MDL-YR-Y             PIC X(02).               00053800
053900     05  WS-DTL-GEVIS-VEH-LINE-C         PIC X(02).               00053900
054000     05  WS-DTL-LCL-BDYTYP-C             PIC X(05).               00054000
054100     05  WS-DTL-CUR-STA-STATUS-C         PIC X(03).               00054100
054200     05  WS-DTL-VEH-DIVISION-C           PIC X(01).               00054200
054300     05  WS-DTL-WMI-WMI-C                PIC X(03).               00054300
054400     05  WS-DTL-LCL-PLT-C                PIC X(03).               00054400
054500     05  WS-DTL-VWS-TOT-US-A             PIC S9(07)V99 COMP-3.    00054500
054600     05  WS-DTL-VEH-GBL-DLR-C            PIC X(06).               00054600
054700     05  WS-DTL-LAST-QAD-VST-GBL-LOC-C   PIC X(06).               00054700
054800     05  WS-DTL-CURR-VST-GBL-LOC-C       PIC X(06).               00054800
054900     05  WS-DTL-SHIP-TO-DLR-C            PIC X(06).               00054900
055000     05  WS-DTL-CURR-STOCKING-DLR-C      PIC X(06).               00055000
055100     05  WS-DTL-CURR-DLR-C               PIC X(06).               00055100
055200     05  WS-DTL-WDMO-FLEET-C             PIC X(05).               00055200
055300     05  WS-DTL-VRS-LCL-FLEET-C          PIC X(06).               00055300
055400     05  WS-DTL-VRS-CST-FIRST-N          PIC X(30).               00055400
055500     05  WS-DTL-VRS-CST-MID-INIT-X       PIC X(01).               00055500
055600     05  WS-DTL-VRS-CST-LAST-N           PIC X(30).               00055600
055700     05  WS-DTL-VRS-CST-ADDR-1-X         PIC X(40).               00055700
055800     05  WS-DTL-VRS-CST-ADD-DIV2-N       PIC X(40).               00055800
055900     05  WS-DTL-VRS-CST-ADD-DIV1-C       PIC X(02).               00055900
056000     05  WS-DTL-VRS-CST-POSTAL-C         PIC X(10).               00056000
056100     05  WS-DTL-VRS-SALESPERSON-C        PIC X(11).               00056100
056200     05  WS-DTL-VRS-TYP-LCL-CUST-C       PIC X(01).               00056200
056300     05  WS-DTL-VEH-WDMO-ORD-TYP         PIC X(01).               00056300
056400     05  WS-DTL-VEH-ORD-RCPT-Y           PIC X(08).               00056400
056500     05  WS-DTL-VEH-SCHD-VST-TARGET-Y    PIC X(08).               00056500
056600     05  WS-DTL-VEH-PRODUCE-VST-STAT-Y   PIC X(08).               00056600
056700     05  WS-DTL-VEH-RELEASE-VST-STAT-Y   PIC X(08).               00056700
056800     05  WS-DTL-VEH-ARRIVAL-VST-STAT-Y   PIC X(08).               00056800
056900     05  WS-DTL-VEH-INVOICE-VST-STAT-Y   PIC X(08).               00056900
057000     05  WS-DTL-VEH-STOCK-VST-STAT-Y     PIC X(08).               00057000
057100     05  WS-DTL-VEH-RETAIL-VST-STAT-Y    PIC X(08).               00057100
057200     05  WS-DTL-VEH-DELIVER-VST-STAT-Y   PIC X(08).               00057200
057300     05  WS-DTL-VEH-SLSRCPT-VST-STAT-Y   PIC X(08).               00057300
057400     05  WS-DTL-VEH-WARRANT-VST-STAT-Y   PIC X(08).               00057400
057500     05  WS-DTL-VEH-CATALOG-C            PIC X(15).               00057500
057600     05  WS-DTL-WERS-VEH-LINE-C          PIC X(02).               00057600
057700     05  WS-DTL-WERS-BODY-STYLE-C        PIC X(03).               00057700
057800     05  WS-DTL-WERS-BRAND-C             PIC X(01).               00057800
057900     05  WS-DTL-VEH-PO-Y                 PIC X(08).               00057900
058000     05  WS-DTL-FILLER-01                PIC X(590).              00058000
058100                                                                  00058100
058200     05  INPUT-OUTPUT-PARAMETERS           PIC X(4020).           00058200
058300                                                                  00058300
058400******************************************************************00058400
058500* MAIN DRIVING CURSOR TO SELECT ROWS FROM TABLE MEXW001 WHICH ARE 00058500
058600* 4 MODEL YEARS BACK AND 2 MODEL YEARS FORWARD FROM THE CURRENT   00058600
058700* YEAR.                                                           00058700
058800* NOTE: THE DATA SOURCE IS POPULATED FROM THE INPUT SYSPARM FILE. 00058800
058900******************************************************************00058900
059000                                                                  00059000
059100     EXEC SQL                                                     00059100
059200         DECLARE  MEXW001_CSR CURSOR WITH HOLD FOR                00059200
059300          SELECT  VEH_VIN_FULL_C                                  00059300
059400                 ,VEH_ORD_ID_C                                    00059400
059500                 ,DTA_DATA_SRC_C                                  00059500
059600                 ,BDT_MDL_YR_Y                                    00059600
059700                 ,WMI_WMI_C                                       00059700
059800                 ,VEH_LCL_PLT_C                                   00059800
059900                 ,VEH_LCL_BDYTYP_C                                00059900
060000                 ,VEH_GBL_ORD_DLR_C                               00060000
060100                 ,VEH_GBL_SHIP_TO_C                               00060100
060200                 ,VEH_ORD_RCPT_Y                                  00060200
060300                 ,VEH_WDMO_FLEET_C                                00060300
060400                 ,VEH_WDMO_ORD_TYP                                00060400
060500                 ,VEH_CATALOG_C                                   00060500
060600                 ,VEH_GBL_CATALOG_C                               00060600
060700                 ,VEH_PO_Y                                        00060700
060800                 ,VEH_GEVIS_VL_C                                  00060800
060900                 ,VEH.COUNTRY_ISO3_C                                    00
060910                 ,VEH.DLR_DLR_C
060920                 ,DLR.DLR_SUPER_DLR_C
061000            FROM  MEXW001_VEH_ORDER VEH                           00061000
061010               ,  MEXW035_DLR_MSTR  DLR
061100           WHERE  VEH.DTA_DATA_SRC_C    = :VEH-DTA-DATA-SRC-C           00
061200             AND  VEH.VEH_ORD_ID_C      > :WS-ORDER-ID-BLANK            00
061300             AND BDT_MDL_YR_Y BETWEEN :WS-CURR-MODEL-YY -4              00
061400                                  AND :WS-CURR-MODEL-YY +2              00
061500             AND VEH_ACTIVE_F       = :VEH-ACTIVE-F                     00
061600             AND VEH_VIN_FULL_C     > :WS-VEH-VIN-BLANK                 00
061610             AND VEH.DLR_DLR_C      = DLR.DLR_DLR_C
061620             AND DIV_DIV_C          = :LIT-EX
061630             AND SUB_SUBLVL1_C      = :LIT-WDM
061700         ORDER BY VEH_ORD_ID_C                                          00
061800                , DTA_DATA_SRC_C                                        00
061900         FOR READ ONLY                                            00061900
062000     END-EXEC                                                     00062000
062100                                                                  00062100
062200******************************************************************00062200
062300* THIS CURSOR WILL BE USED TO JOIN THE MEXW001 AND MEXW008 TABLES 00062300
062400* WHERE THE VEHICLE WAS SOLD WITHIN THE PAST 12 MONTHS AND THE    00062400
062500* MODEL YEAR IS OLDER THAN 4 YEARS.                               00062500
062600******************************************************************00062600
062700                                                                  00062700
062800     EXEC SQL                                                     00062800
062900         DECLARE  SALE_CHK_CSR CURSOR WITH HOLD FOR               00062900
063000          SELECT  VEH.VEH_VIN_FULL_C                              00063000
063100                 ,VEH.VEH_ORD_ID_C                                00063100
063200                 ,VEH.DTA_DATA_SRC_C                              00063200
063300                 ,VEH.BDT_MDL_YR_Y                                00063300
063400                 ,VEH.WMI_WMI_C                                   00063400
063500                 ,VEH.VEH_LCL_PLT_C                               00063500
063600                 ,VEH.VEH_LCL_BDYTYP_C                            00063600
063700                 ,VEH.VEH_GBL_ORD_DLR_C                           00063700
063800                 ,VEH.VEH_GBL_SHIP_TO_C                           00063800
063900                 ,VEH.VEH_ORD_RCPT_Y                              00063900
064000                 ,VEH.VEH_WDMO_FLEET_C                            00064000
064100                 ,VEH.VEH_WDMO_ORD_TYP                            00064100
064200                 ,VEH.VEH_CATALOG_C                               00064200
064300                 ,VEH.VEH_GBL_CATALOG_C                           00064300
064400                 ,VEH.VEH_PO_Y                                    00064400
064500                 ,VEH.VEH_GEVIS_VL_C                              00064500
064600                 ,VEH.COUNTRY_ISO3_C                              00064600
064610                 ,VEH.DLR_DLR_C
064620                 ,DLR.DLR_SUPER_DLR_C
064700            FROM  MEXW001_VEH_ORDER VEH                           00064700
064800                 ,MEXW008_VEH_RTL   VRS                           00064800
064810                 ,MEXW035_DLR_MSTR  DLR
064900           WHERE  VRS.DTA_DATA_SRC_C = :VRS-DTA-DATA-SRC-C        00064900
065000             AND  VRS.VRS_UPDT_S     > :WS-CURR-DRBN-TMSTMP-LESS-100065000
065100             AND  VRS.VRS_ACTIVE_F   = :VRS-ACTIVE-F              00065100
065200             AND  VEH.BDT_MDL_YR_Y   < :WS-CURR-MODEL-YY -4       00065200
065300             AND  VEH.VEH_VIN_FULL_C > :WS-VEH-VIN-BLANK          00065300
065400             AND  VEH.VEH_ORD_ID_C   = VRS.VEH_ORD_ID_C           00065400
065500             AND  VEH.DTA_DATA_SRC_C = VRS.DTA_DATA_SRC_C         00065500
065510             AND  VEH.DLR_DLR_C      = DLR.DLR_DLR_C
065520             AND  DIV_DIV_C          = :LIT-EX
065530             AND  SUB_SUBLVL1_C      = :LIT-WDM
065600         FOR READ ONLY                                            00065600
065700     END-EXEC                                                     00065700
065800                                                                  00065800
065900******************************************************************00065900
066000* THIS CURSOR WILL BE USED TO SELECT ONE ROW FROM TABLE MEXW031   00066000
066100* FOR NON 'NA' AND NON 'EA' DATA SOURCES.  THE RETRIEVED VALUES   00066100
066200* WILL BE USED IN PLACE OF THE LOCAL BODY STYLE CODE THAT WAS     00066200
066300* OBTAINED FROM TABLE MEXW001.                                    00066300
066400******************************************************************00066400
066500     EXEC SQL                                                     00066500
066600         DECLARE  MEXW031_CSR CURSOR WITH HOLD FOR                00066600
066700         SELECT  OPT_OPTION_C                                     00066700
066800                ,VPT_PROD_TYP_C                                   00066800
066900           FROM  MEXW031_CATMAP                                   00066900
067000          WHERE  DTA_DATA_SRC_C    = :CTM-DTA-DATA-SRC-C          00067000
067100            AND  CTM_LCL_CATALOG_C = :CTM-LCL-CATALOG-C           00067100
067200            AND  OFM_OPTION_FAM_C IN ("BS", "CA")                 00067200
067300            OPTIMIZE FOR 1 ROW                                    00067300
067400         FOR READ ONLY                                            00067400
067500     END-EXEC                                                     00067500
067600                                                                  00067600
067700******************************************************************00067700
067800* THIS CURSOR IS BEING USED IN ORDER TO RETRIEVE THE MOST RECENT  00067800
067900* WHOLESALE GLOBAL DEALER FROM TABLE MEXW003 USING A "40V" STATUS 00067900
068000* CODE AND THE FTC QAD CURRENT DATA SOURCE (WD).                  00068000
068100******************************************************************00068100
068200     EXEC SQL                                                     00068200
068300        DECLARE  MEXW003_40V_CSR CURSOR WITH HOLD FOR             00068300
068400         SELECT  VST_GBL_LOC_C                                    00068400
068500           FROM  MEXW003_VEH_STATUS                               00068500
068600          WHERE  VEH_ORD_ID_C       = :VST-VEH-ORD-ID-C           00068600
068700            AND  DTA_DATA_SRC_C     = :VST-DTA-DATA-SRC-C         00068700
068800            AND  STA_STATUS_C       = :VST-STA-STATUS-C           00068800
068900            AND  VST_ACTIVE_F       = :VST-ACTIVE-F               00068900
069000            AND  VST_STAT_TYP_C     = :VST-STAT-TYP-C             00069000
069100            AND  VST_CUR_DATA_SRC_C = :VST-CUR-DATA-SRC-C         00069100
069200       ORDER BY  VST_STAT_Y  DESC                                 00069200
069300                ,VST_STATIC_ISRT_REC_S  DESC                      00069300
069400         FOR READ ONLY                                            00069400
069500     END-EXEC                                                     00069500
069600                                                                  00069600
069700                                                                  00069700
069800******************************************************************00069800
069900*            LINKAGE SECTION                                      00069900
070000******************************************************************00070000
070100 LINKAGE SECTION.                                                 00070100
070200                                                                  00070200
070300 01  IO-PCB.                                                      00070300
070400     05  IO-PCB-LTERM            PIC X(08).                       00070400
070500     05  FILLER                  PIC X(02).                       00070500
070600     05  IO-PCB-STATUS           PIC X(02).                       00070600
070700     05  FILLER                  PIC X(28).                       00070700
070800                                                                  00070800
070900 01  SYSPARM-PCB.                                                 00070900
071000     05  SYSPARM-PCB-NAME        PIC X(08).                       00071000
071100     05  FILLER                  PIC X(02).                       00071100
071200     05  SYSPARM-PCB-STATUS      PIC X(02).                       00071200
071300     05  FILLER                  PIC X(28).                       00071300
071400                                                                  00071400
071500 01  VINCENT-PCB.                                                 00071500
071600     05  VINCENT-PCB-NAME        PIC X(08).                       00071600
071700     05  FILLER                  PIC X(02).                       00071700
071800     05  VINCENT-PCB-STATUS      PIC X(02).                       00071800
071900     05  FILLER                  PIC X(28).                       00071900
072000                                                                  00072000
072100******************************************************************00072100
072200*              P R O C E D U R E   D I V I S I O N               *00072200
072300******************************************************************00072300
072400 PROCEDURE DIVISION.                                              00072400
072500                                                                  00072500
072600******************************************************************00072600
072700*                        M A I N L I N E                         *00072700
073500******************************************************************00073500
073600 0000P-MAINLINE.                                                  00073600
073700                                                                  00073700
073800     ENTRY "DLITCBL" USING IO-PCB                                 00073800
073900                           SYSPARM-PCB                            00073900
074000                           VINCENT-PCB                            00074000
074100                                                                  00074100
074200     PERFORM 0100I-INITIALIZATION                                 00074200
074300     PERFORM 1000P-PROCESS UNTIL END-OF-SYSPARM-FILE              00074300
074400     PERFORM 0200I-CONCLUSION                                     00074400
074500     IF SEND-EMAIL                                                00074500
074600        MOVE 3 TO RETURN-CODE                                     00074600
074700     END-IF                                                       00074700
074800     GOBACK                                                       00074800
074900     .                                                            00074900
075000                                                                  00075000
075100 COPY CPESEBIC.                                                   00075100
075200*BMPSHELL INITIALIZATION AND CONCLUSION                           00075200
075300                                                                  00075300
075400******************************************************************00075400
075500* INITIALIZE THE CHECKPOINT SAVE AREA                            *00075500
075600******************************************************************00075600
075700 0300P-INITIALIZE-SAVE-AREA.                                      00075700
075800                                                                  00075800
075900      CONTINUE                                                    00075900
076000                                                                  00076000
076100* DO NOT INITIALIZE THE CHECKPOINT AREA SINCE THERE ARE VALUES    00076100
076200* HARDCODED IN THERE                                              00076200
076300      .                                                           00076300
076400                                                                  00076400
076500******************************************************************00076500
076600* INITIALIZE THE REPORT TITLES                                   *00076600
076700******************************************************************00076700
076800 0350P-INITIALIZE-REPORT-TITLES.                                  00076800
076900                                                                  00076900
077000      CONTINUE                                                    00077000
077100                                                                  00077100
077200     .                                                            00077200
077300                                                                  00077300
077400******************************************************************00077400
077500* PROGRAM SPECIFIC INITIALIZATION                                *00077500
077600******************************************************************00077600
077700 0400P-INITIALIZE-OTHER.                                          00077700
077800                                                                  00077800
077900     SET NOT-END-OF-SYSPARM-FILE                                  00077900
078000      TO TRUE                                                     00078000
078100     INITIALIZE  WS-VINCENT-DETAIL-RECORD                         00078100
078200                 WS-SWITCHES                                      00078200
078300                 WS-VARIABLES                                     00078300
078400                                                                  00078400
078500     PERFORM 7000C-OBTAIN-DRBN-TIMESTAMP                          00078500
078600     MOVE WS-DRBN-YEAR                                            00078600
078700       TO WS-CURR-MODEL-YY                                        00078700
078800                                                                  00078800
078900     PERFORM 7300C-GET-BATCH-NBR                                  00078900
079000                                                                  00079000
079100     MOVE GNT-ATTRIBUTE-DATA (1:5)                                00079100
079200       TO WS-PREV-BATCH-NBR                                       00079200
079300                                                                  00079300
079400     IF WS-PREV-BATCH-NBR = 99999                                 00079400
079500        MOVE 0                                                    00079500
079600          TO WS-PREV-BATCH-NBR                                    00079600
079700     END-IF                                                       00079700
079800                                                                  00079800
079900     COMPUTE WS-CURRENT-BATCH-NBR = WS-PREV-BATCH-NBR + 1         00079900
080000                                                                  00080000
080100     PERFORM 8000C-GET-SYSPARM-RECORD                             00080100
080200     IF END-OF-SYSPARM-FILE                                       00080200
080300        MOVE "MISSING SYSPARM RECORDS"                            00080300
080400          TO ABEND-MSG                                            00080400
080500        MOVE "PARAGRAPH 0400P"                                    00080500
080600          TO  ABEND-MSG-2                                         00080600
080700        PERFORM 9999I-ABEND                                       00080700
080800     END-IF                                                       00080800
080900                                                                  00080900
081000     PERFORM 7400C-POPULATE-HUB-HEADER                            00081000
081100     PERFORM 6000C-WRITE-VINCENT-RECORD                           00081100
081200     PERFORM 7500C-POPULATE-VINCENT-HEADER                        00081200
081300     PERFORM 6000C-WRITE-VINCENT-RECORD                           00081300
081400                                                                  00081400
081500     MOVE WS-CURR-DRBN-TIMESTAMP                                  00081500
081600       TO WS-CURR-DRBN-TMSTMP-LESS-1                              00081600
081700     SUBTRACT 1 FROM WS-DRBN-YEAR-LESS-1                          00081700
081800     .                                                            00081800
081900                                                                  00081900
082000******************************************************************00082000
082100* PROGRAM SPECIFIC CONCLUSION                                    *00082100
082200******************************************************************00082200
082300 0700P-CONCLUDE-OTHER.                                            00082300
082400                                                                  00082400
082500     PERFORM 7250C-UPDATE-TIMESTAMP                               00082500
082600     PERFORM 7350C-UPDATE-BATCH-NBR                               00082600
082700                                                                  00082700
082800     PERFORM 7550C-POPULATE-VINCENT-TRAILER                       00082800
082900     PERFORM 6000C-WRITE-VINCENT-RECORD                           00082900
083000     PERFORM 7450C-POPULATE-HUB-TRAILER                           00083000
083100     PERFORM 6000C-WRITE-VINCENT-RECORD                           00083100
083200     PERFORM 6020C-WRITE-AUDIT-DETAIL                             00083200
083300     .                                                            00083300
083400                                                                  00083400
083500******************************************************************00083500
083600* MAIN DRIVING PARAGRAPH CALLED FROM 0000P-MAINLINE.  A LOOP WILL 00083600
083700* BE PERFORMED WHICH WILL PROCESS ALL VEHICLES FOR A PRODUCTION   00083700
083800* SOURCE.  AT THE END OF THE LOOP, THE NEXT PRODUCTION SOURCE     00083800
083900* WILL BE READ IN.                                                00083900
084000******************************************************************00084000
084100 1000P-PROCESS.                                                   00084100
084200     PERFORM 2010C-OPEN-MEXW001-CSR                               00084200
084300     PERFORM 2020C-FETCH-MEXW001-CSR                              00084300
084400     PERFORM 2000C-PROCESS-GEVIS-VEHICLE                          00084400
084500        UNTIL MEXW001-NOT-FOUND                                   00084500
084600     PERFORM 2030C-CLOSE-MEXW001-CSR                              00084600
084700                                                                  00084700
084800     PERFORM 2100C-OPEN-SALE-CHK-CSR                              00084800
084900     PERFORM 2120C-FETCH-SALE-CHK-CSR                             00084900
085000     PERFORM 2040C-PROCESS-SALE-CHK-CSR                           00085000
085100        UNTIL SALE-CHK-NOT-FOUND                                  00085100
085200     PERFORM 2140C-CLOSE-SALE-CHK-CSR                             00085200
085300                                                                  00085300
085400     PERFORM 8000C-GET-SYSPARM-RECORD                             00085400
085500     .                                                            00085500
085600                                                                  00085600
085700 2000C-PROCESS-GEVIS-VEHICLE.                                     00085700
085800***************************************************************** 00085800
085900* THE FIRST STEP WILL BE TO DETERMINE WHETHER OR NOT THE          00085900
086000* VEHICLE'S CURRENT STOCKING DEALER IS WDMO BASED. IF IT IS,      00086000
086100* THEN FURTHER PROCESSING WILL CONTINUE.  IF IT IS NOT, THEN THE  00086100
086200* VEHICLE WILL BE SKIPPED AND THEN NEXT ONE WILL BE SELECTED.     00086200
086300* THIS PARAGRAPH WILL BE PERFORMED UNTIL THERE ARE NO MORE VEH-   00086300
086400* ICLES FOR A PRODCUTION SOURCE.                                  00086400
086500* NOTE: INITIALIZATION WILL OCCUR PRIOR TO THE PROCESSING OF THE  00086500
086600* NEXT VEHICLE.                                                   00086600
087100***************************************************************** 00087100
087200                                                                  00087200
087500     PERFORM 5000C-PROCESS-GEVIS-DETAIL-REC                             00
087700     PERFORM 2020C-FETCH-MEXW001-CSR                              00087700
087800     .                                                            00087800
087900                                                                  00087900
088000 2010C-OPEN-MEXW001-CSR.                                          00088000
088100***************************************************************** 00088100
088200* OPENS THE MAIN DRIVING CURSOR WHICH WILL PULL ROWS FROM TABLE   00088200
088300* MEXW001 THAT ARE 1 MODEL YEAR BACK AND 2 MODEL YEARS FORWARD    00088300
088400* FROM THE CURRENT YEAR.                                          00088400
088500***************************************************************** 00088500
088600                                                                  00088600
088700     MOVE SYSPARM-DATA-SRC                                        00088700
088800       TO VEH-DTA-DATA-SRC-C                                      00088800
088900     MOVE LIT-Y                                                   00088900
089000       TO VEH-ACTIVE-F                                            00089000
089100                                                                  00089100
089200     EXEC SQL                                                     00089200
089300         OPEN MEXW001_CSR                                         00089300
089400     END-EXEC                                                     00089400
089500                                                                  00089500
089600     MOVE SQLCODE TO SC-DB2-SQLCODE                               00089600
089700                                                                  00089700
089800     IF  NOT SC-DB2-SQLCODE-OK                                    00089800
089900         MOVE SQLCODE                                             00089900
090000           TO DB2-ABEND-SQLCODE                                   00090000
090100         MOVE "OPEN"                                              00090100
090200           TO DB2-ABEND-FUNCTION                                  00090200
090300         MOVE LIT-TBL-VEH-ORDER                                   00090300
090400           TO DB2-ABEND-TABLE                                     00090400
090500         MOVE DB2-ABEND-MSG                                       00090500
090600           TO ABEND-MSG                                           00090600
090700         MOVE "2010C"                                             00090700
090800           TO ABEND-PARAGRAPH                                     00090800
090900         PERFORM 9999I-ABEND                                      00090900
091000     END-IF                                                       00091000
091100     .                                                            00091100
091200                                                                  00091200
091300 2020C-FETCH-MEXW001-CSR.                                         00091300
091400***************************************************************** 00091400
091500* FETCHES A ROW FROM THE MAIN DRIVING CURSOR WHICH WILL PULL ROWS 00091500
091600* FROM TABLE MEXW001 THAT ARE 1 MODEL YEAR BACK AND 2 MODEL       00091600
091700* YEARS FORWARD FROM THE CURRENT YEAR.                            00091700
091800***************************************************************** 00091800
091900                                                                  00091900
092000     EXEC SQL                                                     00092000
092100         FETCH  MEXW001_CSR                                       00092100
092200          INTO                                                    00092200
092300                :VEH-VIN-FULL-C                                   00092300
092400               ,:VEH-ORD-ID-C                                     00092400
092500               ,:VEH-DTA-DATA-SRC-C                               00092500
092600               ,:VEH-BDT-MDL-YR-Y                                 00092600
092700               ,:VEH-WMI-WMI-C                                    00092700
092800               ,:VEH-LCL-PLT-C                                    00092800
092900               ,:VEH-LCL-BDYTYP-C                                 00092900
093000               ,:VEH-GBL-ORD-DLR-C                                00093000
093100               ,:VEH-GBL-SHIP-TO-C                                00093100
093200               ,:VEH-ORD-RCPT-Y                                   00093200
093300               ,:VEH-WDMO-FLEET-C                                 00093300
093400               ,:VEH-WDMO-ORD-TYP                                 00093400
093500               ,:VEH-CATALOG-C                                    00093500
093600               ,:VEH-GBL-CATALOG-C                                00093600
093700               ,:VEH-PO-Y                                         00093700
093800               ,:VEH-GEVIS-VL-C                                   00093800
093900               ,:VEH-COUNTRY-ISO3-C                               00093900
093910               ,:VEH-DLR-DLR-C
093920               ,:DLR-SUPER-DLR-C
094000     END-EXEC                                                     00094000
094100                                                                  00094100
094200     MOVE SQLCODE                                                 00094200
094300       TO SC-DB2-SQLCODE                                          00094300
094400                                                                  00094400
094500     EVALUATE TRUE                                                00094500
094600        WHEN SC-DB2-SQLCODE-OK                                    00094600
094700             ADD +1                                               00094700
094800              TO WS-NBR-ROWS-READ-MEXW001                         00094800
094900             SET MEXW001-FOUND                                    00094900
095000              TO TRUE                                             00095000
095100        WHEN SC-DB2-SQLCODE-END-OF-CURSOR                         00095100
095200             SET MEXW001-NOT-FOUND                                00095200
095300              TO TRUE                                             00095300
095400        WHEN OTHER                                                00095400
095500             MOVE SQLCODE                                         00095500
095600               TO DB2-ABEND-SQLCODE                               00095600
095700             MOVE "FETCH"                                         00095700
095800               TO DB2-ABEND-FUNCTION                              00095800
095900             MOVE LIT-TBL-VEH-ORDER                               00095900
096000               TO DB2-ABEND-TABLE                                 00096000
096100             MOVE DB2-ABEND-MSG                                   00096100
096200               TO ABEND-MSG                                       00096200
096300             MOVE "2020C"                                         00096300
096400               TO ABEND-PARAGRAPH                                 00096400
096500             PERFORM 9999I-ABEND                                  00096500
096600     END-EVALUATE                                                 00096600
096700     .                                                            00096700
096800                                                                  00096800
096900 2030C-CLOSE-MEXW001-CSR.                                         00096900
097000***************************************************************** 00097000
097100* CLOSES THE MAIN DRIVING CURSOR WHICH PULLS ROWS FROM TABLE      00097100
097200* MEXW001 THAT ARE 1 MODEL YEAR BACK AND 2 MODEL YEARS FORWARD    00097200
097300* FROM THE CURRENT YEAR.                                          00097300
097400***************************************************************** 00097400
097500                                                                  00097500
097600     EXEC SQL                                                     00097600
097700         CLOSE MEXW001_CSR                                        00097700
097800     END-EXEC                                                     00097800
097900                                                                  00097900
098000     MOVE SQLCODE TO SC-DB2-SQLCODE                               00098000
098100                                                                  00098100
098200     IF  NOT SC-DB2-SQLCODE-OK                                    00098200
098300         MOVE SQLCODE                                             00098300
098400           TO DB2-ABEND-SQLCODE                                   00098400
098500         MOVE "CLOSE"                                             00098500
098600           TO DB2-ABEND-FUNCTION                                  00098600
098700         MOVE LIT-TBL-VEH-ORDER                                   00098700
098800           TO DB2-ABEND-TABLE                                     00098800
098900         MOVE DB2-ABEND-MSG                                       00098900
099000           TO ABEND-MSG                                           00099000
099100         MOVE "2030C"                                             00099100
099200           TO ABEND-PARAGRAPH                                     00099200
099300         PERFORM 9999I-ABEND                                      00099300
099400     END-IF                                                       00099400
099500     .                                                            00099500
099600                                                                  00099600
099700 2040C-PROCESS-SALE-CHK-CSR.                                      00099700
099800***************************************************************** 00099800
099900* THIS PARAGRAPH IS USED TO PROCESS ROWS SELECTED FROM THE        00099900
100000* SALE_CHK_CSR WHICH CONTAINS VEHICLES THAT HAVE BEEN REPORTED    00100000
100100* AS SOLD WITHIN THE PAST 12 MONTHS AND THAT ARE OLDER THAN 1     00100100
100200* MODEL YEAR FROM THE CURRENT YEAR. FIRST, WE WILL VERIFY IF      00100200
100300* THE DEALER IS WDMO BASED AND IF IT IS, WE WILL THEN MOVE ALL    00100300
100400* DATA FOR THE VEHICLE TO THE OUTPUT RECORD.  AFTERWARDS, THE     00100400
100500* NEXT ROW WILL BE SELECTED FROM THE SALE_CHK_CSR.                00100500
100600***************************************************************** 00100600
100900     PERFORM 5000C-PROCESS-GEVIS-DETAIL-REC                             00
101100     PERFORM 2120C-FETCH-SALE-CHK-CSR                             00101100
101200     .                                                            00101200
127700                                                                  00127700
127800 2100C-OPEN-SALE-CHK-CSR.                                         00127800
127900***************************************************************** 00127900
128000* OPENS THE SALES CHECK CURSOR WHICH RETRIEVES ALL SALES THAT     00128000
128100* HAVE OCCURRED IN THE PAST 12 MONTHS THAT HAVE A MODEL YEAR THAT 00128100
128200* IS OLDER THAN 1 YEAR FROM THE CURRENT YEAR.                     00128200
128300***************************************************************** 00128300
128400                                                                  00128400
128500     MOVE SYSPARM-DATA-SRC                                        00128500
128600       TO VRS-DTA-DATA-SRC-C                                      00128600
128700     MOVE LIT-Y                                                   00128700
128800       TO VRS-ACTIVE-F                                            00128800
128900                                                                  00128900
129000     EXEC SQL                                                     00129000
129100         OPEN SALE_CHK_CSR                                        00129100
129200     END-EXEC                                                     00129200
129300                                                                  00129300
129400     MOVE SQLCODE TO SC-DB2-SQLCODE                               00129400
129500                                                                  00129500
129600     IF  NOT SC-DB2-SQLCODE-OK                                    00129600
129700         MOVE SQLCODE                                             00129700
129800           TO DB2-ABEND-SQLCODE                                   00129800
129900         MOVE "OPEN"                                              00129900
130000           TO DB2-ABEND-FUNCTION                                  00130000
130100         MOVE LIT-SALE-CHK-CSR                                    00130100
130200           TO DB2-ABEND-TABLE                                     00130200
130300         MOVE DB2-ABEND-MSG                                       00130300
130400           TO ABEND-MSG                                           00130400
130500         MOVE "2100C"                                             00130500
130600           TO ABEND-PARAGRAPH                                     00130600
130700         PERFORM 9999I-ABEND                                      00130700
130800     END-IF                                                       00130800
130900     .                                                            00130900
131000                                                                  00131000
131100 2120C-FETCH-SALE-CHK-CSR.                                        00131100
131200***************************************************************** 00131200
131300* FETCHES A ROW FROM THE SALES CHECK CURSOR WHICH RETRIEVES ALL   00131300
131400* SALES THAT HAVE OCCURRED IN THE PAST 12 MONTHS THAT HAVE A      00131400
131500* MODEL YEAR THAT IS OLDER THAN 1 YEAR FROM THE CURRENT YEAR.     00131500
131600***************************************************************** 00131600
131700                                                                  00131700
131800     EXEC SQL                                                     00131800
131900         FETCH  SALE_CHK_CSR                                      00131900
132000          INTO                                                    00132000
132100                :VEH-VIN-FULL-C                                   00132100
132200               ,:VEH-ORD-ID-C                                     00132200
132300               ,:VEH-DTA-DATA-SRC-C                               00132300
132400               ,:VEH-BDT-MDL-YR-Y                                 00132400
132500               ,:VEH-WMI-WMI-C                                    00132500
132600               ,:VEH-LCL-PLT-C                                    00132600
132700               ,:VEH-LCL-BDYTYP-C                                 00132700
132800               ,:VEH-GBL-ORD-DLR-C                                00132800
132900               ,:VEH-GBL-SHIP-TO-C                                00132900
133000               ,:VEH-ORD-RCPT-Y                                   00133000
133100               ,:VEH-WDMO-FLEET-C                                 00133100
133200               ,:VEH-WDMO-ORD-TYP                                 00133200
133300               ,:VEH-CATALOG-C                                    00133300
133400               ,:VEH-GBL-CATALOG-C                                00133400
133500               ,:VEH-PO-Y                                         00133500
133600               ,:VEH-GEVIS-VL-C                                   00133600
133700               ,:VEH-COUNTRY-ISO3-C                               00133700
133710               ,:VEH-DLR-DLR-C
133720               ,:DLR-SUPER-DLR-C
133800     END-EXEC                                                     00133800
133900                                                                  00133900
134000     MOVE SQLCODE                                                 00134000
134100       TO SC-DB2-SQLCODE                                          00134100
134200                                                                  00134200
134300     EVALUATE TRUE                                                00134300
134400        WHEN SC-DB2-SQLCODE-OK                                    00134400
134500             ADD +1                                               00134500
134600              TO WS-NBR-ROWS-READ-SALE-CHK                        00134600
134700             SET SALE-CHK-FOUND                                   00134700
134800              TO TRUE                                             00134800
134900        WHEN SC-DB2-SQLCODE-END-OF-CURSOR                         00134900
135000             SET SALE-CHK-NOT-FOUND                               00135000
135100              TO TRUE                                             00135100
135200        WHEN OTHER                                                00135200
135300             MOVE SQLCODE                                         00135300
135400               TO DB2-ABEND-SQLCODE                               00135400
135500             MOVE "FETCH"                                         00135500
135600               TO DB2-ABEND-FUNCTION                              00135600
135700             MOVE LIT-SALE-CHK-CSR                                00135700
135800               TO DB2-ABEND-TABLE                                 00135800
135900             MOVE DB2-ABEND-MSG                                   00135900
136000               TO ABEND-MSG                                       00136000
136100             MOVE "2120C"                                         00136100
136200               TO ABEND-PARAGRAPH                                 00136200
136300             PERFORM 9999I-ABEND                                  00136300
136400     END-EVALUATE                                                 00136400
136500     .                                                            00136500
136600                                                                  00136600
136700 2140C-CLOSE-SALE-CHK-CSR.                                        00136700
136800***************************************************************** 00136800
136900* CLOSES THE SALES CHECK CURSOR WHICH RETRIEVES ALL SALES THAT    00136900
137000* HAVE OCCURRED IN THE PAST 12 MONTHS THAT HAVE A MODEL YEAR THAT 00137000
137100* IS OLDER THAN 1 YEAR FROM THE CURRENT YEAR.                     00137100
137200***************************************************************** 00137200
137300                                                                  00137300
137400     EXEC SQL                                                     00137400
137500         CLOSE SALE_CHK_CSR                                       00137500
137600     END-EXEC                                                     00137600
137700                                                                  00137700
137800     MOVE SQLCODE TO SC-DB2-SQLCODE                               00137800
137900                                                                  00137900
138000     IF  NOT SC-DB2-SQLCODE-OK                                    00138000
138100         MOVE SQLCODE                                             00138100
138200           TO DB2-ABEND-SQLCODE                                   00138200
138300         MOVE "CLOSE"                                             00138300
138400           TO DB2-ABEND-FUNCTION                                  00138400
138500         MOVE LIT-SALE-CHK-CSR                                    00138500
138600           TO DB2-ABEND-TABLE                                     00138600
138700         MOVE DB2-ABEND-MSG                                       00138700
138800           TO ABEND-MSG                                           00138800
138900         MOVE "2140C"                                             00138900
139000           TO ABEND-PARAGRAPH                                     00139000
139100         PERFORM 9999I-ABEND                                      00139100
139200     END-IF                                                       00139200
139300     .                                                            00139300
139400                                                                  00139400
139500***************************************************************** 00139500
139600* AT THIS POINT, THE VEHICLE HAS BEEN IDENTIFED AS HAVING A       00139600
139700* CURRENT STOCKING DEALER THAT IS CLASSIFIED AS WDMO.  NOW, OTHER 00139700
139800* DATA WILL BE GATHERED FOR THE VEHICLE AND THEN MOVED AND        00139800
139900* WRITTEN TO THE OUTPUT FILE.                                     00139900
140000*                                                                 00140000
140100***************************************************************** 00140100
140200                                                                  00140200
140300 5000C-PROCESS-GEVIS-DETAIL-REC.                                  00140300
140400                                                                  00140400
140500     SET WERS-STRING-NOT-FOUND-SW     TO TRUE                     00140500
140600     INITIALIZE                          MEXW004-VEH-WERS-STRING  00140600
140700                                         VWR-WERS-STRING-X-TEXT   00140700
140800                                                                  00140800
140900     MOVE VEH-DTA-DATA-SRC-C          TO VWR-DTA-DATA-SRC-C       00140900
141000     MOVE VEH-ORD-ID-C                TO VWR-VEH-ORD-ID-C         00141000
141100                                                                  00141100
141200     PERFORM 7600C-SELECT-WERS-DATA-W004                          00141200
141300                                                                  00141300
141400     MOVE LIT-E                                                   00141400
141500       TO WS-DTL-VEH-DIVISION-C                                   00141500
141600                                                                  00141600
141700     PERFORM 5020C-MOVE-MEXW001-TO-DTL                            00141700
141800     PERFORM 5060C-OBTAIN-RETAIL-DATA                             00141800
141900     PERFORM 5040C-MOVE-CURR-STOCK-TO-DTL                         00141900
142000     PERFORM 5080C-OBTAIN-WHOLESALE-DATA                          00142000
142100     PERFORM 5100C-OBTAIN-WERS-DATA                               00142100
142200                                                                  00142200
142300     PERFORM 5120C-OBTAIN-MEXW003-20T                             00142300
142400     IF MEXW003-FOUND-20T                                         00142400
142500        STRING VST-STAT-Y (1:4)                                   00142500
142600               VST-STAT-Y (6:2)                                   00142600
142700               VST-STAT-Y (9:2)                                   00142700
142800          DELIMITED BY SIZE                                       00142800
142900          INTO WS-DTL-VEH-SCHD-VST-TARGET-Y                       00142900
143000        END-STRING                                                00143000
143100     END-IF                                                       00143100
143200                                                                  00143200
143300     PERFORM 5140C-OBTAIN-MEXW003-30R                             00143300
143400     IF MEXW003-FOUND-30R                                         00143400
143500        STRING VST-STAT-Y (1:4)                                   00143500
143600               VST-STAT-Y (6:2)                                   00143600
143700               VST-STAT-Y (9:2)                                   00143700
143800          DELIMITED BY SIZE                                       00143800
143900          INTO WS-DTL-VEH-PRODUCE-VST-STAT-Y                      00143900
144000        END-STRING                                                00144000
144100     ELSE                                                         00144100
144200        PERFORM 5160C-OBTAIN-MEXW003-30P                          00144200
144300        IF MEXW003-FOUND-30P                                      00144300
144400           STRING VST-STAT-Y (1:4)                                00144400
144500                  VST-STAT-Y (6:2)                                00144500
144600                  VST-STAT-Y (9:2)                                00144600
144700             DELIMITED BY SIZE                                    00144700
144800             INTO WS-DTL-VEH-PRODUCE-VST-STAT-Y                   00144800
144900           END-STRING                                             00144900
145000        END-IF                                                    00145000
145100     END-IF                                                       00145100
145200                                                                  00145200
145300     PERFORM 5180C-OBTAIN-MEXW003-30T                             00145300
145400     IF MEXW003-FOUND-30T                                         00145400
145500        STRING VST-STAT-Y (1:4)                                   00145500
145600               VST-STAT-Y (6:2)                                   00145600
145700               VST-STAT-Y (9:2)                                   00145700
145800          DELIMITED BY SIZE                                       00145800
145900          INTO WS-DTL-VEH-RELEASE-VST-STAT-Y                      00145900
146000        END-STRING                                                00146000
146100     END-IF                                                       00146100
146200                                                                  00146200
146300     PERFORM 5200C-OBTAIN-MEXW003-80F                             00146300
146400     IF MEXW003-FOUND-80F                                         00146400
146500        STRING VST-STAT-Y (1:4)                                   00146500
146600               VST-STAT-Y (6:2)                                   00146600
146700               VST-STAT-Y (9:2)                                   00146700
146800          DELIMITED BY SIZE                                       00146800
146900          INTO WS-DTL-VEH-ARRIVAL-VST-STAT-Y                      00146900
147000        END-STRING                                                00147000
147100     END-IF                                                       00147100
147200                                                                  00147200
147300     PERFORM 5220C-OPEN-40V-CSR                                   00147300
147400     PERFORM 5230C-FETCH-40V-ROW                                  00147400
147500     IF MEXW003-40V-CSR-ROW-FOUND                                 00147500
147600        MOVE VST-GBL-LOC-C                                        00147600
147700          TO WS-DTL-LAST-QAD-VST-GBL-LOC-C                        00147700
147800     END-IF                                                       00147800
147900                                                                  00147900
148000     PERFORM 5240C-CLOSE-40V-CSR                                  00148000
148100     IF   WS-COUNT-DTL-NBR  = 999999                              00148100
148200          MOVE ZERO                                               00148200
148300            TO WS-COUNT-DTL-NBR                                   00148300
148400     END-IF                                                       00148400
148500     IF   WS-COUNT-LINE-NBR = 999999                              00148500
148600          MOVE ZERO                                               00148600
148700            TO WS-COUNT-LINE-NBR                                  00148700
148800     END-IF                                                       00148800
148900                                                                  00148900
149000     IF MEXW027-FOUND                                             00149000
149100         INITIALIZE WS-DTL-HUB-REC-ID-NBR                         00149100
149200         ADD  +1                                                  00149200
149300          TO  WS-COUNT-DTL-NBR                                    00149300
149400              WS-COUNT-LINE-NBR                                   00149400
149500         MOVE WS-COUNT-LINE-NBR                                   00149500
149600           TO WS-DTL-REC-ID-NBR                                   00149600
149700              WS-DTL-HUB-LINE-NBR                                 00149700
149800         MOVE LIT-001                                             00149800
149900           TO WS-DTL-HUB-REC-SEQ-NBR                              00149900
150000         MOVE LIT-010                                             00150000
150100           TO WS-DTL-HUB-REC-TYPE                                 00150100
150200                                                                  00150200
150300         MOVE WS-VINCENT-DETAIL-RECORD                            00150300
150400           TO WS-VINCENT-OUTPUT-RECORD                            00150400
150500         PERFORM 6000C-WRITE-VINCENT-RECORD                       00150500
150600         PERFORM 9400I-INCREMENT-CHKP-COUNT                       00150600
150700     END-IF                                                       00150700
150800                                                                  00150800
150900     INITIALIZE  WS-VINCENT-DETAIL-RECORD                         00150900
151000     .                                                            00151000
151100                                                                  00151100
151200***************************************************************** 00151200
151300* DATA THAT WAS PREVIOUSLY FETCHED FROM TABLE MEXW001 WILL NOW    00151300
151400* BE MOVED TO THE OUTPUT RECORD.                                  00151400
151500* E-TRACKER 6726596 CHANGE:  THE BODY STYLE INFORMATION WILL BE   00151500
151600* RETRIEVED FROM TABLE MEXW031_CATMAP FOR NON 'NA' AND NON 'EA'   00151600
151700* SOURCES.                                                        00151700
151800* NOTE: IF THE NON 'NA' AND NON 'EA' SOURCES ARE NOT FOUND ON     00151800
151900* TABLE MEXW031, THEN WE WILL MOVE THE VEH-LCL-BDYTYP-C WHICH     00151900
152000* WAS RETRIEVED FROM TABLE MEXW001.                               00152000
152100*                                                                 00152100
152200* THE MEXW031-CSR WHEN EXECUTED, BRINGS BACK ONE ROW.             00152200
152300*                                                                 00152300
152400* BODY STYLE - VWR-WERS-STRING-TEXT(10:2) IS THE WERS OPTION      00152400
152500*              CODE FOR BODY STYLE FROM TABLE MEXW004             00152500
152600* WHEN MEXW031-CSR IS EXECUTED, IT ONLY BRINGS BACK ONE ROW       00152600
152700* FOR PROCESSING.                                                 00152700
152800*                                                                 00152800
152900***************************************************************** 00152900
153000 5020C-MOVE-MEXW001-TO-DTL.                                       00153000
153100                                                                  00153100
153200     MOVE VEH-VIN-FULL-C                                          00153200
153300       TO WS-DTL-VIN-FULL-C                                       00153300
153400     MOVE VEH-DTA-DATA-SRC-C                                      00153400
153500       TO WS-DTL-DTA-DATA-SRC-C                                   00153500
153600     MOVE VEH-BDT-MDL-YR-Y                                        00153600
153700       TO WS-VEH-BDT-MDL-YR-Y                                     00153700
153800     MOVE WS-VEH-BDT-MDL-YR-YY                                    00153800
153900       TO WS-DTL-BDT-MDL-YR-Y                                     00153900
154000     MOVE VEH-WMI-WMI-C                                           00154000
154100       TO WS-DTL-WMI-WMI-C                                        00154100
154200     MOVE VEH-LCL-PLT-C                                           00154200
154300       TO WS-DTL-LCL-PLT-C                                        00154300
154400                                                                  00154400
154500     IF  WERS-STRING-FOUND-SW                                     00154500
154600         MOVE VWR-WERS-STRING-X-TEXT(10:2)                        00154600
154700                                      TO WS-DTL-LCL-BDYTYP-C      00154700
154800     ELSE                                                         00154800
154900        PERFORM 5300C-OPEN-MEXW031-CSR                            00154900
155000        PERFORM 5320C-FETCH-MEXW031-CSR                           00155000
155100        PERFORM 5340C-CLOSE-MEXW031-CSR                           00155100
155200                                                                  00155200
155300        IF MEXW031-FOUND                                          00155300
155400           MOVE CTM-OPT-OPTION-C                                  00155400
155500             TO WS-DTL-LCL-BDYTYP-C                               00155500
155600        ELSE                                                      00155600
155700           MOVE VEH-LCL-BDYTYP-C                                  00155700
155800             TO WS-DTL-LCL-BDYTYP-C                               00155800
155900        END-IF                                                    00155900
156000                                                                  00156000
156100     END-IF                                                       00156100
156200                                                                  00156200
156300     MOVE VEH-GBL-ORD-DLR-C                                       00156300
156400       TO DLR-DLR-DLR-C                                           00156400
156500     PERFORM 5050C-GET-MEXW035-DATA                               00156500
156600     IF MEXW035-FOUND                                             00156600
156700                                                                  00156700
156800        IF DLR-SUPER-DLR-C = ZEROS                                00156800
156900           MOVE SPACES                                            00156900
157000             TO WS-DTL-VEH-GBL-DLR-C                              00157000
157100        ELSE                                                      00157100
157200           MOVE DLR-SUPER-DLR-C                                   00157200
157300             TO WS-DTL-VEH-GBL-DLR-C-REFORMAT                     00157300
157400           MOVE WS-DTL-VEH-GBL-DLR-C-REFORMAT                     00157400
157500             TO WS-DTL-VEH-GBL-DLR-C                              00157500
157600        END-IF                                                    00157600
158100     END-IF                                                       00158100
158200*    ----------------------------------------------------------   00158200
158300*    THE SHIP TO DEALER IS THE DEALER THAT WAS REPORTED AT THE    00158300
158400*    TIME OF THE ORDER, SO IF IT'S EQUAL TO SPACES, WE WILL USE   00158400
158500*    THE ORIGINAL ORDERING DEALER.                                00158500
158600*    ----------------------------------------------------------   00158600
158700     IF   VEH-GBL-SHIP-TO-C                                       00158700
158800        > SPACES                                                  00158800
158900          MOVE VEH-GBL-SHIP-TO-C                                  00158900
159000            TO WS-DTL-SHIP-TO-DLR-C                               00159000
159100     ELSE                                                         00159100
159200        MOVE WS-DTL-VEH-GBL-DLR-C                                 00159200
159300          TO WS-DTL-SHIP-TO-DLR-C                                 00159300
159400     END-IF                                                       00159400
159500     STRING VEH-ORD-RCPT-Y (1:4)                                  00159500
159600            VEH-ORD-RCPT-Y (6:2)                                  00159600
159700            VEH-ORD-RCPT-Y (9:2)                                  00159700
159800       DELIMITED BY SIZE                                          00159800
159900       INTO WS-DTL-VEH-ORD-RCPT-Y                                 00159900
160000     END-STRING                                                   00160000
160100     MOVE VEH-WDMO-FLEET-C                                        00160100
160200       TO WS-DTL-WDMO-FLEET-C                                     00160200
160300     MOVE VEH-WDMO-ORD-TYP                                        00160300
160400       TO WS-DTL-VEH-WDMO-ORD-TYP                                 00160400
160500     MOVE VEH-GBL-CATALOG-C                                       00160500
160600       TO WS-DTL-VEH-CATALOG-C                                    00160600
160700     IF VEH-PO-Y > '0001-01-01'                                   00160700
160800        STRING VEH-PO-Y (1:4)                                     00160800
160900               VEH-PO-Y (6:2)                                     00160900
161000               VEH-PO-Y (9:2)                                     00161000
161100          DELIMITED BY SIZE                                       00161100
161200          INTO WS-DTL-VEH-PO-Y                                    00161200
161300        END-STRING                                                00161300
161400     END-IF                                                       00161400
161500     MOVE VEH-GEVIS-VL-C                                          00161500
161600       TO WS-DTL-GEVIS-VEH-LINE-C                                 00161600
161700     .                                                            00161700
161800                                                                  00161800
161900                                                                  00161900
162000******************************************************************00162000
162100* THE CURRENT DEALER/STOCKING DEALER, CURRENT STATUS CODE AND     00162100
162200* CURRENT STATUS CODE DATE WERE RETRIEVED EARLIER.  NOW THE CUR-  00162200
162300* RENT VEHICLE'S STATUS CODE WILL BE USED TO OBTAIN THE VINCENT   00162300
162400* EQUIVALENT FROM TABLE MEXW027 USING "VI" AS THE PRODUCTION      00162400
162500* SOURCE.                                                         00162500
162600* NOTE: DURING DEVELOPMENT OF THIS PROGRAM, IT WAS DECIDED TO     00162600
162700* INSERT GLOBAL/LOCAL CODES ON THE MEXW027 CONVERSION TABLE,      00162700
162800* WITH THE VALUES THAT VINCENT USES FOR THEIR VRULES PROCESSING.  00162800
162900* RATHER THAN HARD CODING THE VALUES IN THIS PROGRAM AND THE      00162900
163000* STORED PROCEDURE (EXWWGEVP), IT IS BETTER TO MAKE A DIRECT CALL 00163000
163100* TO THE TABLE WHERE THE CODES CAN BE MORE EASILY CHANGED, SHOULD 00163100
163200* A CHANGE ARISE IN THE FUTURE.                                   00163200
163300* A CHECK HAS BEEN ADDED TO SEND VINCENT A STATUS CODE OF 600     00163300
163400* INSTEAD OF 800 WHEN THERE ARE NO SALES TYPE OR SALES DATE       00163400
163500* AVAILABLE.                                                      00163500
163600******************************************************************00163600
163700 5040C-MOVE-CURR-STOCK-TO-DTL.                                    00163700
163800                                                                  00163800
163900     INITIALIZE WS-MEXW027-SW                                     00163900
164000                                                                  00164000
164100     MOVE VEH-DLR-DLR-C                                           00164100
164400       TO DLR-DLR-DLR-C                                           00164400
164500     PERFORM 5050C-GET-MEXW035-DATA                               00164500
164510                                                                  00164700
164600     IF MEXW035-FOUND                                             00164600
164800        IF DLR-SUPER-DLR-C = ZEROS                                00164800
164900           MOVE SPACES                                            00164900
165000             TO WS-DTL-CURR-STOCKING-DLR-C                        00165000
165100                WS-DTL-CURR-DLR-C                                 00165100
165200        ELSE                                                      00165200
165300           MOVE DLR-SUPER-DLR-C                                   00165300
165400             TO WS-DLR-SUPER-DLR-C-REFORMAT                       00165400
165500           MOVE WS-DLR-SUPER-DLR-C-REFORMAT                       00165500
165600             TO WS-DTL-CURR-STOCKING-DLR-C                        00165600
165700                WS-DTL-CURR-DLR-C                                 00165700
165800        END-IF                                                    00165800
166400     END-IF                                                       00166400
166410
166420     PERFORM 7700C-SELECT-CURR-STAT-W003
166500                                                                  00166500
166600     IF WS-DTL-CURR-STOCKING-DLR-C  >                             00166600
166700        SPACES                                                    00166700
166800                                                                  00166800
166900        STRING VST-STAT-Y (1:4)                                   00166900
167000               VST-STAT-Y (6:2)                                   00167000
167100               VST-STAT-Y (9:2)                                   00167100
167200            DELIMITED BY SIZE                                     00167200
167300          INTO WS-DTL-VEH-STOCK-VST-STAT-Y                        00167300
167400        END-STRING                                                00167400
167500     END-IF                                                       00167500
167600                                                                  00167600
167700     IF CURR-STAT-FOUND-SW                                        00167700
167800                                                                  00167800
167900        PERFORM 5045C-SELECT-MEXW027-DATA                         00167900
168000                                                                  00168000
168100        IF MEXW027-NOT-FOUND                                      00168100
168200           PERFORM 9100C-MISSING-MEXW027-ROW                      00168200
168300        END-IF                                                    00168300
168400                                                                  00168400
168500        IF MEXW027-FOUND                                          00168500
168600           MOVE CNT-LCL-DATA-X (1:3)                              00168600
168700             TO WS-DTL-CUR-STA-STATUS-C                           00168700
168800        END-IF                                                    00168800
168900     END-IF                                                       00168900
169000                                                                  00169000
169100     IF WS-DTL-CUR-STA-STATUS-C = LIT-800                         00169100
169200        IF   VRS-TYP-LCL-CUST-C = "A4"                            00169200
169300             MOVE LIT-801                                         00169300
169400               TO WS-DTL-CUR-STA-STATUS-C                         00169400
169500        ELSE                                                      00169500
169600           IF   WS-DTL-VRS-TYP-LCL-CUST-C     = SPACES            00169600
169700             OR WS-DTL-VEH-SLSRCPT-VST-STAT-Y = SPACES            00169700
169800                MOVE LIT-600                                      00169800
169900                  TO WS-DTL-CUR-STA-STATUS-C                      00169900
170000           END-IF                                                 00170000
170100        END-IF                                                    00170100
170200     END-IF                                                       00170200
170300     .                                                            00170300
170400                                                                  00170400
170500******************************************************************00170500
170600* THE VINCENT EQUIVALENT STATUS CODE WILL NOW BE OBTAINED FOR THE 00170600
170700* CURRENT STATUS CODE THAT WAS RETRIEVED.                         00170700
170800* SPECIAL NOTE:  WHEN ADDING ROWS TO TABLE MEXW027 FOR VINCENT,   00170800
170900* THE GLOBAL STATUS CODES MUST BE UNIQUE. THE FOLLOWING RULE      00170900
171000* ALSO APPLIES- THERE CAN EXIST ONE LOCAL STATUS CODE THAT CAN    00171000
171100* BE ASSIGNED TO SEVERAL DIFFERENT GLOBAL STATUS CODES (I.E.      00171100
171200* LOCAL CODE = 600 HAS MULTIPLE GLOBAL CODES OF 80J & 90U).       00171200
171300******************************************************************00171300
171400 5045C-SELECT-MEXW027-DATA.                                       00171400
171500                                                                  00171500
171600     MOVE VST-STA-STATUS-C                                        00171600
171700       TO CNT-GBL-DATA-X                                          00171700
171800     MOVE LIT-STATUS                                              00171800
171900       TO CNT-CND-CNV-TYP-C                                       00171900
172000     MOVE LIT-VI                                                  00172000
172100       TO CNT-DTA-DATA-SRC-C                                      00172100
172200     EXEC SQL                                                     00172200
172300         SELECT  CNT_LCL_DATA_X                                   00172300
172400           INTO                                                   00172400
172500                 :CNT-LCL-DATA-X                                  00172500
172600           FROM  MEXW027_CONV                                     00172600
172700          WHERE  CND_CNV_TYP_C     = :CNT-CND-CNV-TYP-C           00172700
172800            AND  DTA_DATA_SRC_C    = :CNT-DTA-DATA-SRC-C          00172800
172900            AND  CNT_GBL_DATA_X    = :CNT-GBL-DATA-X              00172900
173000     END-EXEC                                                     00173000
173100                                                                  00173100
173200     MOVE SQLCODE                                                 00173200
173300       TO SC-DB2-SQLCODE                                          00173300
173400                                                                  00173400
173500     EVALUATE TRUE                                                00173500
173600         WHEN SC-DB2-SQLCODE-OK                                   00173600
173700              ADD +1                                              00173700
173800               TO WS-NBR-ROWS-READ-MEXW027                        00173800
173900              SET MEXW027-FOUND                                   00173900
174000               TO TRUE                                            00174000
174100                                                                  00174100
174200          WHEN SC-DB2-SQLCODE-NOT-FOUND                           00174200
174300               SET MEXW027-NOT-FOUND                              00174300
174400                TO TRUE                                           00174400
174500                                                                  00174500
174600         WHEN OTHER                                               00174600
174700              MOVE SQLCODE                                        00174700
174800                TO DB2-ABEND-SQLCODE                              00174800
174900              MOVE "SELECT"                                       00174900
175000                TO DB2-ABEND-FUNCTION                             00175000
175100              MOVE LIT-TBL-CONV                                   00175100
175200                TO DB2-ABEND-TABLE                                00175200
175300              MOVE DB2-ABEND-MSG                                  00175300
175400                TO ABEND-MSG                                      00175400
175500              MOVE "5045C"                                        00175500
175600                TO ABEND-PARAGRAPH                                00175600
175700              PERFORM 9999I-ABEND                                 00175700
175800     END-EVALUATE                                                 00175800
175900     .                                                            00175900
176000                                                                  00176000
176100 5050C-GET-MEXW035-DATA.                                          00176100
176200******************************************************************00176200
176300* A CALL WILL BE PLACED TO TABLE MEXW035 IN EITHER OF TWO SIT-    00176300
176400* UATIONS.  1) TO OBTAIN THE SUPER DEALER CODE WHICH WILL BE      00176400
176500* USED IN PLACE OF THE GLOBAL ORDERING DEALER CODE AND/OR GLOBAL  00176500
176600* CURRENT STOCKING DEALER CODE.  2)  TO DETERMINE WHETHER OR NOT  00176600
176700* THE CURRENT STOCKING DEALER IS WDMO BASED.                      00176700
176800******************************************************************00176800
176900     EXEC SQL                                                     00176900
177000         SELECT                                                   00177000
177100                 SUB_SUBLVL1_C                                    00177100
177200                ,DLR_SUPER_DLR_C                                  00177200
177300           INTO                                                   00177300
177400                :DLR-SUB-SUBLVL1-C                                00177400
177500               ,:DLR-SUPER-DLR-C                                  00177500
177600           FROM  MEXW035_DLR_MSTR                                 00177600
177700          WHERE  DLR_DLR_C           = :DLR-DLR-DLR-C             00177700
177800     END-EXEC                                                     00177800
177900                                                                  00177900
178000     MOVE SQLCODE                                                 00178000
178100       TO SC-DB2-SQLCODE                                          00178100
178200                                                                  00178200
178300     EVALUATE TRUE                                                00178300
178400         WHEN SC-DB2-SQLCODE-OK                                   00178400
178500              ADD 1                                               00178500
178600               TO WS-NBR-ROWS-READ-MEXW035                        00178600
178700              SET MEXW035-FOUND                                   00178700
178800               TO TRUE                                            00178800
178900                                                                  00178900
179000         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00179000
179100              SET MEXW035-NOT-FOUND                               00179100
179200               TO TRUE                                            00179200
179300              PERFORM 9000C-MISSING-MEXW035-ROW                   00179300
179400                                                                  00179400
179500         WHEN OTHER                                               00179500
179600              MOVE SQLCODE                                        00179600
179700                TO DB2-ABEND-SQLCODE                              00179700
179800              MOVE "SELECT"                                       00179800
179900                TO DB2-ABEND-FUNCTION                             00179900
180000              MOVE LIT-TBL-DLR-MSTR                               00180000
180100                TO DB2-ABEND-TABLE                                00180100
180200              MOVE DB2-ABEND-MSG                                  00180200
180300                TO ABEND-MSG                                      00180300
180400              MOVE "5050C"                                        00180400
180500                TO ABEND-PARAGRAPH                                00180500
180600              PERFORM 9999I-ABEND                                 00180600
180700     END-EVALUATE                                                 00180700
180800     .                                                            00180800
180900                                                                  00180900
181000******************************************************************00181000
181100* A JOIN WILL BE DONE ON TABLES MEXW003 & MEXW008 TO OBTAIN       00181100
181200* VARIOUS RETAIL DATA (IF THE VEHICLE IS IN RETAIL STATUS).       00181200
181300* NOTE: THE RETAILED STATUS DATE WILL BE USED TO POPULATE THE     00181300
181400* DELIVERY DATE WHICH IS THE SAME.                                00181400
181500******************************************************************00181500
181600 5060C-OBTAIN-RETAIL-DATA.                                        00181600
181700                                                                  00181700
181800     PERFORM 5065C-SELECT-MEXW008-90V-DATA                        00181800
181900     IF MEXW008-FOUND-90V                                         00181900
182000        STRING VST-STAT-Y (1:4)                                   00182000
182100               VST-STAT-Y (6:2)                                   00182100
182200               VST-STAT-Y (9:2)                                   00182200
182300          DELIMITED BY SIZE                                       00182300
182400          INTO WS-DTL-VEH-RETAIL-VST-STAT-Y                       00182400
182500        END-STRING                                                00182500
182600        MOVE WS-DTL-VEH-RETAIL-VST-STAT-Y                         00182600
182700          TO WS-DTL-VEH-DELIVER-VST-STAT-Y                        00182700
182800        PERFORM 5070C-POPULATE-RETAIL-OUTPUT                      00182800
182900     END-IF                                                       00182900
183000     .                                                            00183000
183100                                                                  00183100
183200******************************************************************00183200
183300* A JOIN WILL BE DONE ON TABLES MEXW003 & MEXW008 TO OBTAIN       00183300
183400* VARIOUS RETAILED DATA (IF THE VEHICLE HAS REACHED RETAIL STATUS)00183400
183500******************************************************************00183500
183600 5065C-SELECT-MEXW008-90V-DATA.                                   00183600
183700                                                                  00183700
183800     MOVE VEH-ORD-ID-C                                            00183800
183900       TO VST-VEH-ORD-ID-C                                        00183900
184000     MOVE VEH-DTA-DATA-SRC-C                                      00184000
184100       TO VST-DTA-DATA-SRC-C                                      00184100
184200     MOVE LIT-90V                                                 00184200
184300       TO VST-STA-STATUS-C                                        00184300
184400     MOVE LIT-Y                                                   00184400
184500       TO VST-LAST-OCCUR-F                                        00184500
184600          VST-ACTIVE-F                                            00184600
184700                                                                  00184700
184800     EXEC SQL                                                     00184800
184900         SELECT                                                   00184900
185000                 A.VST_STAT_Y                                     00185000
185100                ,B.VRS_LCL_FLEET_C                                00185100
185200                ,B.VRS_CST_FIRST_N                                00185200
185300                ,B.VRS_CST_BUS_1_N                                00185300
185400                ,B.VRS_CST_BUS_2_N                                00185400
185500                ,B.VRS_CST_MID_INIT_X                             00185500
185600                ,B.VRS_CST_LAST_N                                 00185600
185700                ,B.VRS_CST_ADDR_1_X                               00185700
185800                ,B.VRS_CST_ADD_DIV2_N                             00185800
185900                ,B.VRS_CST_ADD_DIV1_C                             00185900
186000                ,B.VRS_CST_POSTAL_C                               00186000
186100                ,B.VRS_SALESPERSON_C                              00186100
186200                ,B.VRS_TYP_LCL_CUST_C                             00186200
186300                ,B.VRS_RPT_SALE_Y                                 00186300
186400                ,B.VRS_WARR_STRT_Y                                00186400
186500           INTO                                                   00186500
186600                 :VST-STAT-Y                                      00186600
186700                ,:VRS-LCL-FLEET-C                                 00186700
186800                ,:VRS-CST-FIRST-N                                 00186800
186900                ,:VRS-CST-BUS-1-N                                 00186900
187000                ,:VRS-CST-BUS-2-N                                 00187000
187100                ,:VRS-CST-MID-INIT-X                              00187100
187200                ,:VRS-CST-LAST-N                                  00187200
187300                ,:VRS-CST-ADDR-1-X                                00187300
187400                ,:VRS-CST-ADD-DIV2-N                              00187400
187500                ,:VRS-CST-ADD-DIV1-C                              00187500
187600                ,:VRS-CST-POSTAL-C                                00187600
187700                ,:VRS-SALESPERSON-C                               00187700
187800                ,:VRS-TYP-LCL-CUST-C                              00187800
187900                ,:VRS-RPT-SALE-Y                                  00187900
188000                ,:VRS-WARR-STRT-Y                                 00188000
188100           FROM  MEXW003_VEH_STATUS A                             00188100
188200                ,MEXW008_VEH_RTL B                                00188200
188300          WHERE  A.VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C          00188300
188400            AND  A.DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C        00188400
188500            AND  A.STA_STATUS_C      = :VST-STA-STATUS-C          00188500
188600            AND  A.VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F          00188600
188700            AND  A.VST_ACTIVE_F      = :VST-ACTIVE-F              00188700
188800            AND  A.VST_ACTIVE_F      = B.VRS_ACTIVE_F             00188800
188900            AND  A.STA_STATUS_C      = B.STA_STATUS_C             00188900
189000            AND  A.VEH_ORD_ID_C      = B.VEH_ORD_ID_C             00189000
189100            AND  A.DTA_DATA_SRC_C    = B.DTA_DATA_SRC_C           00189100
189200            AND  SUBSTR(A.VST_LCL_LOC_C, 1,7)                     00189200
189300                                     = B.VRS_LCL_DLR_C            00189300
189400            AND  A.VST_STAT_Y        = B.VRS_RETAIL_Y             00189400
189500     END-EXEC                                                     00189500
189600                                                                  00189600
189700     MOVE SQLCODE                                                 00189700
189800       TO SC-DB2-SQLCODE                                          00189800
189900                                                                  00189900
190000     EVALUATE TRUE                                                00190000
190100         WHEN SC-DB2-SQLCODE-OK                                   00190100
190200              ADD +1                                              00190200
190300               TO WS-NBR-ROWS-READ-MEXW008                        00190300
190400              SET MEXW008-FOUND-90V                               00190400
190500               TO TRUE                                            00190500
190600                                                                  00190600
190700         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00190700
190800              SET MEXW008-NOT-FOUND-90V                           00190800
190900               TO TRUE                                            00190900
191000                                                                  00191000
191100         WHEN OTHER                                               00191100
191200              MOVE SQLCODE                                        00191200
191300                TO DB2-ABEND-SQLCODE                              00191300
191400              MOVE "SELECT"                                       00191400
191500                TO DB2-ABEND-FUNCTION                             00191500
191600              MOVE LIT-TBL-MEXW003-08                             00191600
191700                TO DB2-ABEND-TABLE                                00191700
191800              MOVE DB2-ABEND-MSG                                  00191800
191900                TO ABEND-MSG                                      00191900
192000              MOVE "5065C"                                        00192000
192100                TO ABEND-PARAGRAPH                                00192100
192200              PERFORM 9999I-ABEND                                 00192200
192300     END-EVALUATE                                                 00192300
192400     .                                                            00192400
192500                                                                  00192500
192600******************************************************************00192600
192700* IF A 90V STATUS WAS FOUND FOR THE VEHICLE, THEN VARIOUS RETAIL  00192700
192800* SALES DATA WILL BE MOVED TO CORRESPONDING OUTPUT FIELDS.  IF    00192800
192900* THE 90V STATUS WAS NOT FOUND FOR THE VEHICLE, THEN SPACES WILL  00192900
193000* BE MOVED TO THOSE OUTPUT FIELDS.                                00193000
193100* PER CUSTOMER, IF CUSTOMER FIRST NAME & LAST NAME IS BLANK, THEN 00193100
193200* THE BUSINESS NAME WILL BE MOVED TO THE FIRST NAME FIELD         00193200
193300******************************************************************00193300
193400 5070C-POPULATE-RETAIL-OUTPUT.                                    00193400
193500                                                                  00193500
193600     MOVE VRS-LCL-FLEET-C                                         00193600
193700       TO WS-DTL-VRS-LCL-FLEET-C                                  00193700
193800                                                                  00193800
193900     IF    VRS-CST-FIRST-N = SPACES                               00193900
194000       AND VRS-CST-LAST-N  = SPACES                               00194000
194100          MOVE VRS-CST-BUS-1-N (1:30)                             00194100
194200            TO WS-DTL-VRS-CST-FIRST-N                             00194200
194300          MOVE VRS-CST-BUS-2-N (1:30)                             00194300
194400            TO WS-DTL-VRS-CST-LAST-N                              00194400
194500                                                                  00194500
194600     ELSE                                                         00194600
194700                                                                  00194700
194800          MOVE VRS-CST-FIRST-N                                    00194800
194900            TO WS-DTL-VRS-CST-FIRST-N                             00194900
195000          MOVE VRS-CST-MID-INIT-X                                 00195000
195100            TO WS-DTL-VRS-CST-MID-INIT-X                          00195100
195200          MOVE VRS-CST-LAST-N                                     00195200
195300            TO WS-DTL-VRS-CST-LAST-N                              00195300
195400     END-IF                                                       00195400
195500                                                                  00195500
195600     MOVE VRS-CST-ADDR-1-X                                        00195600
195700       TO WS-DTL-VRS-CST-ADDR-1-X                                 00195700
195800     MOVE VRS-CST-ADD-DIV2-N                                      00195800
195900       TO WS-DTL-VRS-CST-ADD-DIV2-N                               00195900
196000     MOVE VRS-CST-ADD-DIV1-C                                      00196000
196100       TO WS-DTL-VRS-CST-ADD-DIV1-C                               00196100
196200     MOVE VRS-CST-POSTAL-C                                        00196200
196300       TO WS-DTL-VRS-CST-POSTAL-C                                 00196300
196400     MOVE VRS-SALESPERSON-C                                       00196400
196500       TO WS-DTL-VRS-SALESPERSON-C                                00196500
196600                                                                  00196600
196700     PERFORM 5075C-POPULATE-CONCEPS-SLSTYP                        00196700
196800                                                                  00196800
196900*--- VEHICLE SALES RECEIPT DATE- IF IT EXISTS ( > 0001-01-01)     00196900
197000     IF VRS-RPT-SALE-Y > '0001-01-01'                             00197000
197100        STRING VRS-RPT-SALE-Y (1:4)                               00197100
197200               VRS-RPT-SALE-Y (6:2)                               00197200
197300               VRS-RPT-SALE-Y (9:2)                               00197300
197400            DELIMITED BY SIZE                                     00197400
197500          INTO WS-DTL-VEH-SLSRCPT-VST-STAT-Y                      00197500
197600        END-STRING                                                00197600
197700     END-IF                                                       00197700
197800*    ----------------------------------------------------------   00197800
197900*    IF VEHICLE WARRANTY START DATE DOES NOT EXIST (0001-01-01)   00197900
198000*    WE WILL USE THE RETAIL SALES DATE, IF THE RETAIL SALES       00198000
198100*    DATE EXISTS (> THAN 0001-01-01).                             00198100
198200*    ----------------------------------------------------------   00198200
198300     IF   VRS-WARR-STRT-Y > '0001-01-01'                          00198300
198400          STRING VRS-WARR-STRT-Y (1:4)                            00198400
198500                 VRS-WARR-STRT-Y (6:2)                            00198500
198600                 VRS-WARR-STRT-Y (9:2)                            00198600
198700             DELIMITED BY SIZE                                    00198700
198800              INTO WS-DTL-VEH-WARRANT-VST-STAT-Y                  00198800
198900          END-STRING                                              00198900
199000     ELSE                                                         00199000
199100          IF VRS-RPT-SALE-Y  > '0001-01-01'                       00199100
199200             MOVE WS-DTL-VEH-SLSRCPT-VST-STAT-Y                   00199200
199300               TO WS-DTL-VEH-WARRANT-VST-STAT-Y                   00199300
199400          END-IF                                                  00199400
199500     END-IF                                                       00199500
199600     .                                                            00199600
199700                                                                  00199700
199800******************************************************************00199800
199900* THE GEVIS CUSTOMER TYPE CODE WILL BE CONVERTED TO A CONCEPS     00199900
200000* SALES TYPE CODE.                                                00200000
200100******************************************************************00200100
200200 5075C-POPULATE-CONCEPS-SLSTYP.                                   00200200
200300                                                                  00200300
200400     EVALUATE VRS-TYP-LCL-CUST-C                                  00200400
200500         WHEN "A1"                                                00200500
200600         WHEN "0 "                                                00200600
200700             MOVE "0"                                             00200700
200800               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00200800
200900                                                                  00200900
201000         WHEN "A2"                                                00201000
201100         WHEN "R "                                                00201100
201200             MOVE "R"                                             00201200
201300               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00201300
201400                                                                  00201400
201500         WHEN "A3"                                                00201500
201600         WHEN "L "                                                00201600
201700             MOVE "L"                                             00201700
201800               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00201800
201900                                                                  00201900
202000         WHEN "A4"                                                00202000
202100             MOVE " "                                             00202100
202200               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00202200
202300                                                                  00202300
202400         WHEN "A5"                                                00202400
202500         WHEN "E "                                                00202500
202600             MOVE "E"                                             00202600
202700               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00202700
202800                                                                  00202800
202900         WHEN "F1"                                                00202900
203000         WHEN "7 "                                                00203000
203100             MOVE "7"                                             00203100
203200               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00203200
203300                                                                  00203300
203400         WHEN "F2"                                                00203400
203500         WHEN "3 "                                                00203500
203600             MOVE "3"                                             00203600
203700               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00203700
203800                                                                  00203800
203900         WHEN "F3"                                                00203900
204000         WHEN "T "                                                00204000
204100             MOVE "T"                                             00204100
204200               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00204200
204300                                                                  00204300
204400         WHEN "F4"                                                00204400
204500         WHEN "4 "                                                00204500
204600             MOVE "4"                                             00204600
204700               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00204700
204800                                                                  00204800
204900         WHEN "L2"                                                00204900
205000         WHEN "L4"                                                00205000
205100         WHEN "D "                                                00205100
205200             MOVE "D"                                             00205200
205300               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00205300
205400                                                                  00205400
205500         WHEN "L1"                                                00205500
205600         WHEN "L3"                                                00205600
205700         WHEN "6 "                                                00205700
205800             MOVE "6"                                             00205800
205900               TO WS-DTL-VRS-TYP-LCL-CUST-C                       00205900
206000     END-EVALUATE                                                 00206000
206100     .                                                            00206100
206200                                                                  00206200
206300******************************************************************00206300
206400* TABLES MEXW003 & MEXW007 WILL BE JOINED IN ORDER TO OBTAIN      00206400
206500* VARIOUS WHOLESALE INFORMATION, IF THE VEHICLE HAS REACHED THAT  00206500
206600* STAGE.                                                          00206600
206700* NOTE: THE VEHICLE TOTAL AMOUNT MUST BE IN UNITED STATES DOLLAR  00206700
206800* CURRENCY (USD).  IF IT IS NOT, THEN ZERO WILL BE MOVED TO THE   00206800
206900* FIELD.                                                          00206900
207000******************************************************************00207000
207100 5080C-OBTAIN-WHOLESALE-DATA.                                     00207100
207200                                                                  00207200
207300     PERFORM 5085C-SELECT-MEXW003-40V                             00207300
207400     IF MEXW003-FOUND-40V                                         00207400
207500        MOVE VST-GBL-LOC-C                                        00207500
207600          TO WS-DTL-CURR-VST-GBL-LOC-C                            00207600
207700        STRING VST-STAT-Y (1:4)                                   00207700
207800               VST-STAT-Y (6:2)                                   00207800
207900               VST-STAT-Y (9:2)                                   00207900
208000          DELIMITED BY SIZE                                       00208000
208100          INTO WS-DTL-VEH-INVOICE-VST-STAT-Y                      00208100
208200        END-STRING                                                00208200
208300        IF VWS-CUR-CURRENCY-C = LIT-USD                           00208300
208400           MOVE VWS-TOT-LCL-A                                     00208400
208500             TO WS-DTL-VWS-TOT-US-A                               00208500
208600        ELSE                                                      00208600
208700           MOVE ZERO                                              00208700
208800             TO WS-DTL-VWS-TOT-US-A                               00208800
208900        END-IF                                                    00208900
209000     END-IF                                                       00209000
209100     .                                                            00209100
209200                                                                  00209200
209300******************************************************************00209300
209400* A JOIN ON TABLES MEXW003 & MEXW007 WILL BE DONE INTO ORDER TO   00209400
209500* RETRIEVE THE CURRENT INVOICE DEALER, THE INVOICING PREPARATION  00209500
209600* DATE, THE CURRENCY CODE AND THE VEHICLE TOTAL AMOUNT.           00209600
209700******************************************************************00209700
209800 5085C-SELECT-MEXW003-40V.                                        00209800
209900                                                                  00209900
210000     MOVE VEH-ORD-ID-C                                            00210000
210100       TO VST-VEH-ORD-ID-C                                        00210100
210200     MOVE VEH-DTA-DATA-SRC-C                                      00210200
210300       TO VST-DTA-DATA-SRC-C                                      00210300
210400     MOVE LIT-40V                                                 00210400
210500       TO VST-STA-STATUS-C                                        00210500
210600     MOVE LIT-Y                                                   00210600
210700       TO VST-LAST-OCCUR-F                                        00210700
210800          VST-ACTIVE-F                                            00210800
210900                                                                  00210900
211000     EXEC SQL                                                     00211000
211100         SELECT A.VST_GBL_LOC_C                                   00211100
211200               ,A.VST_STAT_Y                                      00211200
211300               ,B.VWS_TOT_LCL_A                                   00211300
211400               ,B.CUR_CURRENCY_C                                  00211400
211500          INTO                                                    00211500
211600                :VST-GBL-LOC-C                                    00211600
211700               ,:VST-STAT-Y                                       00211700
211800               ,:VWS-TOT-LCL-A                                    00211800
211900               ,:VWS-CUR-CURRENCY-C                               00211900
212000          FROM  MEXW003_VEH_STATUS A                              00212000
212100               ,MEXW007_VEH_WHS B                                 00212100
212200         WHERE  A.VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C           00212200
212300           AND  A.DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C         00212300
212400           AND  A.STA_STATUS_C      = :VST-STA-STATUS-C           00212400
212500           AND  A.VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F           00212500
212600           AND  A.VST_ACTIVE_F      = :VST-ACTIVE-F               00212600
212700           AND  A.VST_ACTIVE_F      = B.VWS_ACTIVE_F              00212700
212800           AND  A.STA_STATUS_C      = B.STA_STATUS_C              00212800
212900           AND  A.VEH_ORD_ID_C      = B.VEH_ORD_ID_C              00212900
213000           AND  A.DTA_DATA_SRC_C    = B.DTA_DATA_SRC_C            00213000
213100           AND  A.VST_STAT_Y        = B.VWS_DATE_Y                00213100
213200           AND  SUBSTR(A.VST_LCL_LOC_C, 1,7)                      00213200
213300                                    = B.VWS_LCL_DLR_C             00213300
213400     END-EXEC                                                     00213400
213500                                                                  00213500
213600     MOVE SQLCODE                                                 00213600
213700       TO SC-DB2-SQLCODE                                          00213700
213800                                                                  00213800
213900     EVALUATE TRUE                                                00213900
214000         WHEN SC-DB2-SQLCODE-OK                                   00214000
214100              ADD +1                                              00214100
214200               TO WS-NBR-ROWS-READ-MEXW007                        00214200
214300              SET MEXW003-FOUND-40V                               00214300
214400               TO TRUE                                            00214400
214500                                                                  00214500
214600         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00214600
214700              SET MEXW003-NOT-FOUND-40V                           00214700
214800               TO TRUE                                            00214800
214900                                                                  00214900
215000         WHEN OTHER                                               00215000
215100              MOVE SQLCODE                                        00215100
215200                TO DB2-ABEND-SQLCODE                              00215200
215300              MOVE "SELECT"                                       00215300
215400                TO DB2-ABEND-FUNCTION                             00215400
215500              MOVE LIT-TBL-MEXW003-07                             00215500
215600                TO DB2-ABEND-TABLE                                00215600
215700              MOVE DB2-ABEND-MSG                                  00215700
215800                TO ABEND-MSG                                      00215800
215900              MOVE "5085C"                                        00215900
216000                TO ABEND-PARAGRAPH                                00216000
216100              PERFORM 9999I-ABEND                                 00216100
216200     END-EVALUATE                                                 00216200
216300     .                                                            00216300
216400                                                                  00216400
216500******************************************************************00216500
216600* THE WERS VEHICLE LINE CODE WILL BE OBTAINED FROM TABLE MEXW034  00216600
216700* OR FROM TABLE MEXW004_WERS_VL_STRING.                           00216700
216800* IF 'EA' OR 'NA' SOURCED, THE WERS VEHICLE LINE IS OBTAINED FROM 00216800
216900* MEXW034 DB2 TABLE USING THE PROD SOURCE AND GEVIS VEHICLE LINE, 00216900
217000* WHICH WAS OBTAINED FROM MEXW001 DB2 TABLE.                      00217000
217100* FOR ALL OTHER SOURCES, IF THE ORDER IS FOUND ON MEXW004 DB2     00217100
217200* TABLE, USE THE WERS VEHICLE LINE FROM MEXW004 DB2 TABLE AND     00217200
217300* GEVIS VEHICLE LINE FROM MEXW034 DB2 TABLE WERS PRODUCT TYPE CODE00217300
217400* AND WERS BODY USE TO MAKE UP THE WERS BODY STYLE.               00217400
217500* IF NOT FOUND ON MEXW004 DB2 TABLE, USE WERS VEHICLE LINE        00217500
217600* FROM MEXW0032 (CATALOG CODE), PRODUCT TYPE AND WERS BODY USE    00217600
217700* TO MAKE UP WERS BODY STYLE.                                     00217700
217800* IF NOT FOUND ON MEXW004 OR MEXW031/MEXW032 DB2 TABLES, WE ARE   00217800
217900* ASSUMING THE ORDER IS FROM HISTORY FOR 'NA' AND 'EA', USE       00217900
218000* MEXW034 DB2 TABLE PRODUCT TYPE CODE AND BODY TYPE FROM MEXW033  00218000
218100* USE TO MAKE UP THE BODY STYLE.                                  00218100
218200******************************************************************00218200
218300 5100C-OBTAIN-WERS-DATA.                                          00218300
218400                                                                  00218400
218500     SET MEXW034-NOT-FOUND                                        00218500
218600      TO TRUE                                                     00218600
218700                                                                  00218700
218800     IF VEH-DTA-DATA-SRC-C = LIT-EA OR LIT-NA                     00218800
218900        IF VEH-GEVIS-VL-C  > "  "                                 00218900
219000           PERFORM 5110C-SELECT-W034-DATA                         00219000
219100        END-IF                                                    00219100
219200                                                                  00219200
219300        IF MEXW034-FOUND                                          00219300
219400           MOVE VLN-WERS-VL-C                                     00219400
219500             TO WS-DTL-WERS-VEH-LINE-C                            00219500
219600           MOVE VLN-WERS-BRAND-C (2:1)                            00219600
219700             TO WS-DTL-WERS-BRAND-C                               00219700
219800        END-IF                                                    00219800
219900                                                                  00219900
220000     ELSE                                                         00220000
220100                                                                  00220100
220200         IF  WERS-STRING-FOUND-SW                                 00220200
220300             PERFORM 5102C-WERS-STRING-PROCESS                    00220300
220400                                                                  00220400
220500         ELSE                                                     00220500
220600             PERFORM 5112C-SELECT-MEXW032-WERS-VL                 00220600
220700                                                                  00220700
220800             IF  MEXW032-FOUND                                    00220800
220900                 PERFORM 5104C-CATALOG-CODE-PROCESS               00220900
221000                                                                  00221000
221100             END-IF                                               00221100
221200         END-IF                                                   00221200
221300     END-IF                                                       00221300
221400                                                                  00221400
221500     MOVE SPACES                      TO WS-DTL-WERS-BODY-STYLE-C 00221500
221600                                                                  00221600
221700     IF  WERS-STRING-FOUND-SW                                     00221700
221800         STRING VWR-WERS-PRD-TP-C                                 00221800
221900              , VWR-WERS-STRING-X-TEXT(10:2)                      00221900
222000                  DELIMITED BY SIZE INTO WS-DTL-WERS-BODY-STYLE-C 00222000
222100         END-STRING                                               00222100
222200                                                                  00222200
222300     ELSE                                                         00222300
222400         IF  MEXW031-FOUND                                        00222400
222500             STRING CTM-VPT-PROD-TYP-C                            00222500
222600                  , CTM-OPT-OPTION-C                              00222600
222700                  DELIMITED BY SIZE INTO WS-DTL-WERS-BODY-STYLE-C 00222700
222800             END-STRING                                           00222800
222900                                                                  00222900
223000         ELSE                                                     00223000
223100             IF  VEH-DTA-DATA-SRC-C  =  LIT-EA  OR  LIT-NA        00223100
223200                 PERFORM 5115C-SELECT-MEXW033-DATA                00223200
223300                                                                  00223300
223400                 IF  MEXW033-FOUND                                00223400
223500                     IF  BDT-WERS-BDY-TYP-C  >  SPACES            00223500
223600                         STRING VLN-WERS-PRD-TP-C                 00223600
223700                              , BDT-WERS-BDY-TYP-C                00223700
223800                         DELIMITED BY SIZE                        00223800
223900                                    INTO WS-DTL-WERS-BODY-STYLE-C 00223900
224000                        END-STRING                                00224000
224100                                                                  00224100
224200                     END-IF                                       00224200
224300                 END-IF                                           00224300
224400             END-IF                                               00224400
224500         END-IF                                                   00224500
224600     END-IF                                                       00224600
224700     .                                                            00224700
224800                                                                  00224800
224900******************************************************************00224900
225000* PROCESS FEATURE DATA FROM WERS STRING W004 TABLE                00225000
225100*                                                                 00225100
225200* EVALUATE WERS VEHICLE LINE.  THESE ARE HANDLED AS               00225200
225300* EXEPTIONS AS THEY CAN APPEAR MUTIPLE TIMES FOR                  00225300
225400* DIFFERENT GEVIS VEHICLE LINES.                                  00225400
225500*                                                                 00225500
225600******************************************************************00225600
225700 5102C-WERS-STRING-PROCESS.                                       00225700
225800                                                                  00225800
225900     MOVE VWR-WERS-VL-C               TO WS-WERS-VL-C             00225900
226000                                                                  00226000
226100     IF  WS-VALID-VEH-LINE-CDS                                    00226100
226200         EVALUATE VWR-WERS-VL-C                                   00226200
226300             WHEN "KI"                                            00226300
226400             WHEN "K5"                                            00226400
226500                  MOVE "L5"           TO VLN-GEVIS-VL-C           00226500
226600                  MOVE "AB"           TO VLN-WERS-BRAND-C         00226600
226700                  SET MEXW034-FOUND   TO TRUE                     00226700
226800                                                                  00226800
226900             WHEN "DB"                                            00226900
227000                  MOVE "DB"           TO VLN-GEVIS-VL-C           00227000
227100                  MOVE "AB"           TO VLN-WERS-BRAND-C         00227100
227200                  SET MEXW034-FOUND   TO TRUE                     00227200
227300                                                                  00227300
227400         END-EVALUATE                                             00227400
227500     ELSE                                                         00227500
227600         PERFORM 5110C-SELECT-W034-DATA                           00227600
227700                                                                  00227700
227800     END-IF                                                       00227800
227900                                                                  00227900
228000     IF  MEXW034-FOUND                                            00228000
228100         MOVE VLN-GEVIS-VL-C          TO WS-DTL-GEVIS-VEH-LINE-C  00228100
228200         MOVE VWR-WERS-VL-C           TO WS-DTL-WERS-VEH-LINE-C   00228200
228300         MOVE VLN-WERS-BRAND-C (2:1)  TO WS-DTL-WERS-BRAND-C      00228300
228400                                                                  00228400
228500     ELSE                                                         00228500
228600         MOVE VEH-GEVIS-VL-C          TO WS-DTL-GEVIS-VEH-LINE-C  00228600
228700         MOVE VWR-WERS-VL-C           TO WS-DTL-WERS-VEH-LINE-C   00228700
228800         MOVE SPACES                  TO WS-DTL-WERS-BRAND-C      00228800
228900                                                                  00228900
229000     END-IF                                                       00229000
229100                                                                  00229100
229200     .                                                            00229200
229300                                                                  00229300
229400******************************************************************00229400
229500* PROCESS CATALOG CODE                                            00229500
229600*                                                                 00229600
229700* EVALUATE CATALOG CODE VEHICLE LINE.  THESE ARE HANDLED AS       00229700
229800* EXEPTIONS AS THEY CAN APPEAR MUTIPLE TIMES FOR                  00229800
229900* DIFFERENT GEVIS VEHICLE LINES.                                  00229900
230000*                                                                 00230000
230100******************************************************************00230100
230200 5104C-CATALOG-CODE-PROCESS.                                      00230200
230300                                                                  00230300
230400     MOVE CTG-VHL-VEH-LINE-C          TO WS-WERS-VL-C             00230400
230500                                                                  00230500
230600     IF  WS-VALID-VEH-LINE-CDS                                    00230600
230700         EVALUATE CTG-VHL-VEH-LINE-C                              00230700
230800             WHEN "KI"                                            00230800
230900             WHEN "K5"                                            00230900
231000                  MOVE "L5"           TO VLN-GEVIS-VL-C           00231000
231100                  MOVE "AB"           TO VLN-WERS-BRAND-C         00231100
231200                  SET MEXW034-FOUND   TO TRUE                     00231200
231300                                                                  00231300
231400             WHEN "DB"                                            00231400
231500                  MOVE "DB"           TO VLN-GEVIS-VL-C           00231500
231600                  MOVE "AB"           TO VLN-WERS-BRAND-C         00231600
231700                  SET MEXW034-FOUND   TO TRUE                     00231700
231800                                                                  00231800
231900         END-EVALUATE                                             00231900
232000                                                                  00232000
232100     ELSE                                                         00232100
232200          PERFORM 5114C-SELECT-MEXW034-GEVIS-VL                   00232200
232300                                                                  00232300
232400     END-IF                                                       00232400
232500                                                                  00232500
232600     IF MEXW034-FOUND                                             00232600
232700          MOVE VLN-GEVIS-VL-C         TO WS-DTL-GEVIS-VEH-LINE-C  00232700
232800          MOVE CTG-VHL-VEH-LINE-C     TO WS-DTL-WERS-VEH-LINE-C   00232800
232900          MOVE VLN-WERS-BRAND-C (2:1) TO WS-DTL-WERS-BRAND-C      00232900
233000                                                                  00233000
233100     END-IF                                                       00233100
233200                                                                  00233200
233300     .                                                            00233300
233400                                                                  00233400
233500******************************************************************00233500
233600* RETRIEVES THE WERS VEHICLE LINE DATA USING THE GEVIS VEHICLE    00233600
233700* LINE CODE AND PRODUCTION SOURCE.                                00233700
233800* NOTE: THIS ONLY APPLIES TO 'NA' AND 'EA' DATA SOURCES.          00233800
233900******************************************************************00233900
234000 5110C-SELECT-W034-DATA.                                          00234000
234100                                                                  00234100
234200     MOVE VEH-DTA-DATA-SRC-C                                      00234200
234300       TO VLN-DTA-DATA-SRC-C                                      00234300
234400     MOVE VEH-GEVIS-VL-C                                          00234400
234500       TO VLN-GEVIS-VL-C                                          00234500
234600     MOVE LIT-Y                                                   00234600
234700       TO VLN-ACTIVE-F                                            00234700
234800                                                                  00234800
234900     EXEC SQL                                                     00234900
235000         SELECT   VLN_WERS_VL_C                                   00235000
235100                 ,VLN_WERS_PRD_TP_C                               00235100
235200                 ,VLN_WERS_BRAND_C                                00235200
235300           INTO                                                   00235300
235400                 :VLN-WERS-VL-C                                   00235400
235500                ,:VLN-WERS-PRD-TP-C                               00235500
235600                ,:VLN-WERS-BRAND-C                                00235600
235700           FROM  MEXW034_VL_BRAND                                 00235700
235800          WHERE  DTA_DATA_SRC_C    = :VLN-DTA-DATA-SRC-C          00235800
235900            AND  VLN_GEVIS_VL_C    = :VLN-GEVIS-VL-C              00235900
236000            AND  VLN_ACTIVE_F      = :VLN-ACTIVE-F                00236000
236100     END-EXEC                                                     00236100
236200                                                                  00236200
236300     MOVE SQLCODE                                                 00236300
236400       TO SC-DB2-SQLCODE                                          00236400
236500                                                                  00236500
236600     EVALUATE TRUE                                                00236600
236700         WHEN SC-DB2-SQLCODE-OK                                   00236700
236800              ADD +1                                              00236800
236900               TO WS-NBR-ROWS-READ-MEXW034                        00236900
237000              SET MEXW034-FOUND                                   00237000
237100               TO TRUE                                            00237100
237200                                                                  00237200
237300         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00237300
237400              SET MEXW034-NOT-FOUND                               00237400
237500               TO TRUE                                            00237500
237600                                                                  00237600
237700         WHEN OTHER                                               00237700
237800              MOVE SQLCODE                                        00237800
237900                TO DB2-ABEND-SQLCODE                              00237900
238000              MOVE "SELECT"                                       00238000
238100                TO DB2-ABEND-FUNCTION                             00238100
238200              MOVE LIT-TBL-VL-BRAND                               00238200
238300                TO DB2-ABEND-TABLE                                00238300
238400              MOVE DB2-ABEND-MSG                                  00238400
238500                TO ABEND-MSG                                      00238500
238600              MOVE "5110C"                                        00238600
238700                TO ABEND-PARAGRAPH                                00238700
238800              PERFORM 9999I-ABEND                                 00238800
238900     END-EVALUATE                                                 00238900
239000     .                                                            00239000
239100                                                                  00239100
239200******************************************************************00239200
239300* BY USING THE DATA OBTAINED FROM TABLE MEXW001 IN THE WHERE      00239300
239400* CLAUSE, THE WERS VEHICLE LINE WILL NOW BE SELECTED.             00239400
239500* NOTE: THIS ONLY APPLIES TO NON 'NA' AND NON 'EA' DATA SOURCES.  00239500
239600******************************************************************00239600
239700 5112C-SELECT-MEXW032-WERS-VL.                                    00239700
239800     MOVE VEH-DTA-DATA-SRC-C                                      00239800
239900       TO CTG-DTA-DATA-SRC-C                                      00239900
240000     MOVE VEH-CATALOG-C                                           00240000
240100       TO CTG-LCL-CATALOG-C                                       00240100
240200                                                                  00240200
240300     EXEC SQL                                                     00240300
240400       SELECT  VHL_VEH_LINE_C                                     00240400
240500              ,VPT_PROD_TYP_C                                     00240500
240600         INTO :CTG-VHL-VEH-LINE-C                                 00240600
240700             ,:CTG-VPT-PROD-TYP-C                                 00240700
240800         FROM  MEXW032_CATALOG                                    00240800
240900        WHERE DTA_DATA_SRC_C    =  :CTG-DTA-DATA-SRC-C            00240900
241000          AND CTG_LCL_CATALOG_C =  :CTG-LCL-CATALOG-C             00241000
241100     END-EXEC                                                     00241100
241200                                                                  00241200
241300     MOVE SQLCODE                                                 00241300
241400       TO SC-DB2-SQLCODE                                          00241400
241500                                                                  00241500
241600     EVALUATE TRUE                                                00241600
241700         WHEN SC-DB2-SQLCODE-OK                                   00241700
241800              ADD +1                                              00241800
241900               TO WS-NBR-ROWS-READ-MEXW032                        00241900
242000              SET MEXW032-FOUND                                   00242000
242100               TO TRUE                                            00242100
242200                                                                  00242200
242300         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00242300
242400              SET MEXW032-NOT-FOUND                               00242400
242500               TO TRUE                                            00242500
242600                                                                  00242600
242700         WHEN OTHER                                               00242700
242800              MOVE SQLCODE                                        00242800
242900                TO DB2-ABEND-SQLCODE                              00242900
243000              MOVE "SELECT"                                       00243000
243100                TO DB2-ABEND-FUNCTION                             00243100
243200              MOVE LIT-TBL-CATALOG                                00243200
243300                TO DB2-ABEND-TABLE                                00243300
243400              MOVE DB2-ABEND-MSG                                  00243400
243500                TO ABEND-MSG                                      00243500
243600              MOVE "5112C"                                        00243600
243700                TO ABEND-PARAGRAPH                                00243700
243800              PERFORM 9999I-ABEND                                 00243800
243900     END-EVALUATE                                                 00243900
244000     .                                                            00244000
244100                                                                  00244100
244200******************************************************************00244200
244300* RETRIEVES THE GEVIS VEHICLE LINE DATA USING THE DATA SOURCE AND 00244300
244400* WERS VEHICLE LINE CODE.                                         00244400
244500* NOTE: THIS ONLY APPLIES TO NON 'NA' AND NON 'EA' DATA SOURCES.  00244500
244600******************************************************************00244600
244700 5114C-SELECT-MEXW034-GEVIS-VL.                                   00244700
244800     MOVE VEH-DTA-DATA-SRC-C                                      00244800
244900       TO VLN-DTA-DATA-SRC-C                                      00244900
245000     MOVE CTG-VHL-VEH-LINE-C                                      00245000
245100       TO VLN-WERS-VL-C                                           00245100
245200     MOVE LIT-Y                                                   00245200
245300       TO VLN-ACTIVE-F                                            00245300
245400     MOVE CTG-VPT-PROD-TYP-C          TO VLN-WERS-PRD-TP-C        00245400
245500                                                                  00245500
245600     EXEC SQL                                                     00245600
245700        SELECT  VLN_GEVIS_VL_C                                    00245700
245800               ,VLN_WERS_PRD_TP_C                                 00245800
245900               ,VLN_WERS_BRAND_C                                  00245900
246000          INTO                                                    00246000
246100               :VLN-GEVIS-VL-C                                    00246100
246200              ,:VLN-WERS-PRD-TP-C                                 00246200
246300              ,:VLN-WERS-BRAND-C                                  00246300
246400          FROM  MEXW034_VL_BRAND                                  00246400
246500         WHERE  DTA_DATA_SRC_C    = :VLN-DTA-DATA-SRC-C           00246500
246600           AND  VLN_WERS_VL_C     = :VLN-WERS-VL-C                00246600
246700           AND  VLN_ACTIVE_F      = :VLN-ACTIVE-F                 00246700
246800           AND  VLN_WERS_PRD_TP_C = :VLN-WERS-PRD-TP-C            00246800
246900     END-EXEC                                                     00246900
247000                                                                  00247000
247100     MOVE SQLCODE                                                 00247100
247200       TO SC-DB2-SQLCODE                                          00247200
247300                                                                  00247300
247400     EVALUATE TRUE                                                00247400
247500         WHEN SC-DB2-SQLCODE-OK                                   00247500
247600              ADD +1                                              00247600
247700               TO WS-NBR-ROWS-READ-MEXW034                        00247700
247800              SET MEXW034-FOUND                                   00247800
247900               TO TRUE                                            00247900
248000                                                                  00248000
248100         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00248100
248200              SET MEXW034-NOT-FOUND                               00248200
248300               TO TRUE                                            00248300
248400                                                                  00248400
248500         WHEN OTHER                                               00248500
248600              MOVE SQLCODE                                        00248600
248700                TO DB2-ABEND-SQLCODE                              00248700
248800              MOVE "SELECT"                                       00248800
248900                TO DB2-ABEND-FUNCTION                             00248900
249000              MOVE LIT-TBL-VL-BRAND                               00249000
249100                TO DB2-ABEND-TABLE                                00249100
249200              MOVE DB2-ABEND-MSG                                  00249200
249300                TO ABEND-MSG                                      00249300
249400              MOVE "5114C"                                        00249400
249500                TO ABEND-PARAGRAPH                                00249500
249600              PERFORM 9999I-ABEND                                 00249600
249700     END-EVALUATE                                                 00249700
249800     .                                                            00249800
249900                                                                  00249900
250000******************************************************************00250000
250100* BY USING THE DATA OBTAINED FROM TABLE MEXW001 IN THE WHERE      00250100
250200* CLAUSE, THE WERS BODY TYPE WILL NOW BE OBTAINED.                00250200
250300******************************************************************00250300
250400 5115C-SELECT-MEXW033-DATA.                                       00250400
250500                                                                  00250500
250600     MOVE VEH-DTA-DATA-SRC-C                                      00250600
250700       TO BDT-PROD-SRC-C                                          00250700
250800     MOVE VEH-BDT-MDL-YR-Y                                        00250800
250900       TO BDT-START-YR-R                                          00250900
251000          BDT-END-YR-R                                            00251000
251100     MOVE VEH-LCL-BDYTYP-C                                        00251100
251200       TO BDT-BDY-TYP-C                                           00251200
251300                                                                  00251300
251400     EXEC SQL                                                     00251400
251500                                                                  00251500
251600         SELECT  BDT_WERS_BDY_TYP_C                               00251600
251700           INTO                                                   00251700
251800                 :BDT-WERS-BDY-TYP-C                              00251800
251900           FROM  MEXW033_BODY_TYPE                                00251900
252000          WHERE  BDT_PROD_SRC_C  = :BDT-PROD-SRC-C                00252000
252100            AND  BDT_BDY_TYP_C   = :BDT-BDY-TYP-C                 00252100
252200            AND  BDT_START_YR_R <= :BDT-START-YR-R                00252200
252300            AND  BDT_END_YR_R   >= :BDT-END-YR-R                  00252300
252400     END-EXEC                                                     00252400
252500                                                                  00252500
252600     MOVE SQLCODE                                                 00252600
252700       TO SC-DB2-SQLCODE                                          00252700
252800     EVALUATE TRUE                                                00252800
252900         WHEN SC-DB2-SQLCODE-OK                                   00252900
253000              ADD +1                                              00253000
253100               TO WS-NBR-ROWS-READ-MEXW033                        00253100
253200              SET MEXW033-FOUND                                   00253200
253300               TO TRUE                                            00253300
253400                                                                  00253400
253500         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00253500
253600              SET MEXW033-NOT-FOUND                               00253600
253700               TO TRUE                                            00253700
253800                                                                  00253800
253900         WHEN OTHER                                               00253900
254000              MOVE SQLCODE                                        00254000
254100                TO DB2-ABEND-SQLCODE                              00254100
254200              MOVE "SELECT"                                       00254200
254300                TO DB2-ABEND-FUNCTION                             00254300
254400              MOVE LIT-TBL-BODY-TYPE                              00254400
254500                TO DB2-ABEND-TABLE                                00254500
254600              MOVE DB2-ABEND-MSG                                  00254600
254700                TO ABEND-MSG                                      00254700
254800              MOVE "5115C"                                        00254800
254900                TO ABEND-PARAGRAPH                                00254900
255000              PERFORM 9999I-ABEND                                 00255000
255100     END-EVALUATE                                                 00255100
255200     .                                                            00255200
255300                                                                  00255300
255400******************************************************************00255400
255500* A ROW CONTAINING THE MOST RECENT 20T STATUS CODE WHICH CONSISTS 00255500
255600* OF THE DATE THAT THE VEHICLE WAS PRODUCED WILL BE RETRIEVED.    00255600
255700******************************************************************00255700
255800 5120C-OBTAIN-MEXW003-20T.                                        00255800
255900                                                                  00255900
256000     MOVE VEH-ORD-ID-C                                            00256000
256100       TO VST-VEH-ORD-ID-C                                        00256100
256200     MOVE VEH-DTA-DATA-SRC-C                                      00256200
256300       TO VST-DTA-DATA-SRC-C                                      00256300
256400     MOVE LIT-20T                                                 00256400
256500       TO VST-STA-STATUS-C                                        00256500
256600     MOVE LIT-Y                                                   00256600
256700       TO VST-LAST-OCCUR-F                                        00256700
256800          VST-ACTIVE-F                                            00256800
256900                                                                  00256900
257000     EXEC SQL                                                     00257000
257100         SELECT  VST_STAT_Y                                       00257100
257200           INTO                                                   00257200
257300                 :VST-STAT-Y                                      00257300
257400           FROM  MEXW003_VEH_STATUS                               00257400
257500          WHERE  VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C            00257500
257600            AND  DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C          00257600
257700            AND  STA_STATUS_C      = :VST-STA-STATUS-C            00257700
257800            AND  VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F            00257800
257900            AND  VST_ACTIVE_F      = :VST-ACTIVE-F                00257900
258000     END-EXEC                                                     00258000
258100                                                                  00258100
258200     MOVE SQLCODE                                                 00258200
258300       TO SC-DB2-SQLCODE                                          00258300
258400                                                                  00258400
258500     EVALUATE TRUE                                                00258500
258600         WHEN SC-DB2-SQLCODE-OK                                   00258600
258700              ADD +1                                              00258700
258800               TO WS-NBR-ROWS-READ-MEXW003                        00258800
258900              SET MEXW003-FOUND-20T                               00258900
259000               TO TRUE                                            00259000
259100                                                                  00259100
259200         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00259200
259300              SET MEXW003-NOT-FOUND-20T                           00259300
259400               TO TRUE                                            00259400
259500                                                                  00259500
259600         WHEN OTHER                                               00259600
259700              MOVE SQLCODE                                        00259700
259800                TO DB2-ABEND-SQLCODE                              00259800
259900              MOVE "SELECT"                                       00259900
260000                TO DB2-ABEND-FUNCTION                             00260000
260100              MOVE LIT-TBL-VEH-STATUS                             00260100
260200                TO DB2-ABEND-TABLE                                00260200
260300              MOVE DB2-ABEND-MSG                                  00260300
260400                TO ABEND-MSG                                      00260400
260500              MOVE "5120C"                                        00260500
260600                TO ABEND-PARAGRAPH                                00260600
260700              PERFORM 9999I-ABEND                                 00260700
260800     END-EVALUATE                                                 00260800
260900     .                                                            00260900
261000                                                                  00261000
261100******************************************************************00261100
261200* RETRIEVES THE MOST RECENT 30R STATUS CODE WHICH CONSISTS OF THE 00261200
261300* DATE THAT THE VEHICLE WAS PRODUCED AND PASSED THE PLANT INSPEC- 00261300
261400* TION. IF NOT FOUND, THEN A 30P STATUS CODE WILL BE SELECTED.    00261400
261500* THE 30P CONSISTS OF THE DATE THAT THE VEHICLE WAS PRODUCED, BUT 00261500
261600* INSPECTION DID NOT OCCUR.                                       00261600
261700******************************************************************00261700
261800 5140C-OBTAIN-MEXW003-30R.                                        00261800
261900                                                                  00261900
262000     MOVE VEH-ORD-ID-C                                            00262000
262100       TO VST-VEH-ORD-ID-C                                        00262100
262200     MOVE VEH-DTA-DATA-SRC-C                                      00262200
262300       TO VST-DTA-DATA-SRC-C                                      00262300
262400     MOVE LIT-30R                                                 00262400
262500       TO VST-STA-STATUS-C                                        00262500
262600     MOVE LIT-Y                                                   00262600
262700       TO VST-LAST-OCCUR-F                                        00262700
262800          VST-ACTIVE-F                                            00262800
262900                                                                  00262900
263000     EXEC SQL                                                     00263000
263100         SELECT  VST_STAT_Y                                       00263100
263200           INTO                                                   00263200
263300                 :VST-STAT-Y                                      00263300
263400           FROM  MEXW003_VEH_STATUS                               00263400
263500          WHERE  VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C            00263500
263600            AND  DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C          00263600
263700            AND  STA_STATUS_C      = :VST-STA-STATUS-C            00263700
263800            AND  VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F            00263800
263900            AND  VST_ACTIVE_F      = :VST-ACTIVE-F                00263900
264000     END-EXEC                                                     00264000
264100                                                                  00264100
264200     MOVE SQLCODE                                                 00264200
264300       TO SC-DB2-SQLCODE                                          00264300
264400                                                                  00264400
264500     EVALUATE TRUE                                                00264500
264600         WHEN SC-DB2-SQLCODE-OK                                   00264600
264700              ADD +1                                              00264700
264800               TO WS-NBR-ROWS-READ-MEXW003                        00264800
264900              SET MEXW003-FOUND-30R                               00264900
265000               TO TRUE                                            00265000
265100                                                                  00265100
265200         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00265200
265300              SET MEXW003-NOT-FOUND-30R                           00265300
265400               TO TRUE                                            00265400
265500                                                                  00265500
265600         WHEN OTHER                                               00265600
265700              MOVE SQLCODE                                        00265700
265800                TO DB2-ABEND-SQLCODE                              00265800
265900              MOVE "SELECT"                                       00265900
266000                TO DB2-ABEND-FUNCTION                             00266000
266100              MOVE LIT-TBL-VEH-STATUS                             00266100
266200                TO DB2-ABEND-TABLE                                00266200
266300              MOVE DB2-ABEND-MSG                                  00266300
266400                TO ABEND-MSG                                      00266400
266500              MOVE "5140C"                                        00266500
266600                TO ABEND-PARAGRAPH                                00266600
266700              PERFORM 9999I-ABEND                                 00266700
266800     END-EVALUATE                                                 00266800
266900     .                                                            00266900
267000                                                                  00267000
267100******************************************************************00267100
267200* RETRIEVES THE MOST RECENT 30P STATUS CODE WHICH CONSISTS OF THE 00267200
267300* DATE THAT THE VEHICLE WAS PRODUCED, BUT NOT INSPECTED.          00267300
267400******************************************************************00267400
267500 5160C-OBTAIN-MEXW003-30P.                                        00267500
267600                                                                  00267600
267700     MOVE VEH-ORD-ID-C                                            00267700
267800       TO VST-VEH-ORD-ID-C                                        00267800
267900     MOVE VEH-DTA-DATA-SRC-C                                      00267900
268000       TO VST-DTA-DATA-SRC-C                                      00268000
268100     MOVE LIT-30P                                                 00268100
268200       TO VST-STA-STATUS-C                                        00268200
268300     MOVE LIT-Y                                                   00268300
268400       TO VST-LAST-OCCUR-F                                        00268400
268500          VST-ACTIVE-F                                            00268500
268600                                                                  00268600
268700     EXEC SQL                                                     00268700
268800         SELECT  VST_STAT_Y                                       00268800
268900           INTO                                                   00268900
269000                 :VST-STAT-Y                                      00269000
269100           FROM  MEXW003_VEH_STATUS                               00269100
269200          WHERE  VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C            00269200
269300            AND  DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C          00269300
269400            AND  STA_STATUS_C      = :VST-STA-STATUS-C            00269400
269500            AND  VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F            00269500
269600            AND  VST_ACTIVE_F      = :VST-ACTIVE-F                00269600
269700     END-EXEC                                                     00269700
269800                                                                  00269800
269900     MOVE SQLCODE                                                 00269900
270000       TO SC-DB2-SQLCODE                                          00270000
270100                                                                  00270100
270200     EVALUATE TRUE                                                00270200
270300         WHEN SC-DB2-SQLCODE-OK                                   00270300
270400              ADD +1                                              00270400
270500               TO WS-NBR-ROWS-READ-MEXW003                        00270500
270600              SET MEXW003-FOUND-30P                               00270600
270700               TO TRUE                                            00270700
270800                                                                  00270800
270900         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00270900
271000              SET MEXW003-NOT-FOUND-30P                           00271000
271100               TO TRUE                                            00271100
271200                                                                  00271200
271300         WHEN OTHER                                               00271300
271400              MOVE SQLCODE                                        00271400
271500                TO DB2-ABEND-SQLCODE                              00271500
271600              MOVE "SELECT"                                       00271600
271700                TO DB2-ABEND-FUNCTION                             00271700
271800              MOVE LIT-TBL-VEH-STATUS                             00271800
271900                TO DB2-ABEND-TABLE                                00271900
272000              MOVE DB2-ABEND-MSG                                  00272000
272100                TO ABEND-MSG                                      00272100
272200              MOVE "5160C"                                        00272200
272300                TO ABEND-PARAGRAPH                                00272300
272400              PERFORM 9999I-ABEND                                 00272400
272500     END-EVALUATE                                                 00272500
272600     .                                                            00272600
272700                                                                  00272700
272800******************************************************************00272800
272900* RETRIEVES THE MOST RECENT 30T STATUS CODE WHICH CONSISTS OF THE 00272900
273000* DATE THAT THE VEHICLE WAS RELEASED FROM THE ASSEMBLY PLANT.     00273000
273100******************************************************************00273100
273200 5180C-OBTAIN-MEXW003-30T.                                        00273200
273300                                                                  00273300
273400     MOVE VEH-ORD-ID-C                                            00273400
273500       TO VST-VEH-ORD-ID-C                                        00273500
273600     MOVE VEH-DTA-DATA-SRC-C                                      00273600
273700       TO VST-DTA-DATA-SRC-C                                      00273700
273800     MOVE LIT-30T                                                 00273800
273900       TO VST-STA-STATUS-C                                        00273900
274000     MOVE LIT-Y                                                   00274000
274100       TO VST-LAST-OCCUR-F                                        00274100
274200          VST-ACTIVE-F                                            00274200
274300                                                                  00274300
274400     EXEC SQL                                                     00274400
274500         SELECT  VST_STAT_Y                                       00274500
274600           INTO                                                   00274600
274700                 :VST-STAT-Y                                      00274700
274800           FROM  MEXW003_VEH_STATUS                               00274800
274900          WHERE  VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C            00274900
275000            AND  DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C          00275000
275100            AND  STA_STATUS_C      = :VST-STA-STATUS-C            00275100
275200            AND  VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F            00275200
275300            AND  VST_ACTIVE_F      = :VST-ACTIVE-F                00275300
275400     END-EXEC                                                     00275400
275500                                                                  00275500
275600     MOVE SQLCODE                                                 00275600
275700       TO SC-DB2-SQLCODE                                          00275700
275800                                                                  00275800
275900     EVALUATE TRUE                                                00275900
276000         WHEN SC-DB2-SQLCODE-OK                                   00276000
276100              ADD +1                                              00276100
276200               TO WS-NBR-ROWS-READ-MEXW003                        00276200
276300              SET MEXW003-FOUND-30T                               00276300
276400               TO TRUE                                            00276400
276500                                                                  00276500
276600         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00276600
276700              SET MEXW003-NOT-FOUND-30T                           00276700
276800               TO TRUE                                            00276800
276900                                                                  00276900
277000         WHEN OTHER                                               00277000
277100              MOVE SQLCODE                                        00277100
277200                TO DB2-ABEND-SQLCODE                              00277200
277300              MOVE "SELECT"                                       00277300
277400                TO DB2-ABEND-FUNCTION                             00277400
277500              MOVE LIT-TBL-VEH-STATUS                             00277500
277600                TO DB2-ABEND-TABLE                                00277600
277700              MOVE DB2-ABEND-MSG                                  00277700
277800                TO ABEND-MSG                                      00277800
277900              MOVE "5180C"                                        00277900
278000                TO ABEND-PARAGRAPH                                00278000
278100              PERFORM 9999I-ABEND                                 00278100
278200     END-EVALUATE                                                 00278200
278300     .                                                            00278300
278400                                                                  00278400
278500******************************************************************00278500
278600* RETRIEVES THE MOST RECENT 80F STATUS CODE WHICH CONSISTS OF THE 00278600
278700* DATE THAT THE VEHICLE HAS ARRIVED AT THE FINAL DESTINATION.     00278700
278800******************************************************************00278800
278900 5200C-OBTAIN-MEXW003-80F.                                        00278900
279000     MOVE VEH-ORD-ID-C                                            00279000
279100       TO VST-VEH-ORD-ID-C                                        00279100
279200     MOVE VEH-DTA-DATA-SRC-C                                      00279200
279300       TO VST-DTA-DATA-SRC-C                                      00279300
279400     MOVE LIT-80F                                                 00279400
279500       TO VST-STA-STATUS-C                                        00279500
279600     MOVE LIT-Y                                                   00279600
279700       TO VST-LAST-OCCUR-F                                        00279700
279800          VST-ACTIVE-F                                            00279800
279900                                                                  00279900
280000     EXEC SQL                                                     00280000
280100         SELECT  VST_STAT_Y                                       00280100
280200           INTO                                                   00280200
280300                 :VST-STAT-Y                                      00280300
280400           FROM  MEXW003_VEH_STATUS                               00280400
280500          WHERE  VEH_ORD_ID_C      = :VST-VEH-ORD-ID-C            00280500
280600            AND  DTA_DATA_SRC_C    = :VST-DTA-DATA-SRC-C          00280600
280700            AND  STA_STATUS_C      = :VST-STA-STATUS-C            00280700
280800            AND  VST_LAST_OCCUR_F  = :VST-LAST-OCCUR-F            00280800
280900            AND  VST_ACTIVE_F      = :VST-ACTIVE-F                00280900
281000     END-EXEC                                                     00281000
281100                                                                  00281100
281200     MOVE SQLCODE                                                 00281200
281300       TO SC-DB2-SQLCODE                                          00281300
281400                                                                  00281400
281500     EVALUATE TRUE                                                00281500
281600         WHEN SC-DB2-SQLCODE-OK                                   00281600
281700              ADD +1                                              00281700
281800               TO WS-NBR-ROWS-READ-MEXW003                        00281800
281900              SET MEXW003-FOUND-80F                               00281900
282000               TO TRUE                                            00282000
282100                                                                  00282100
282200         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00282200
282300              SET MEXW003-NOT-FOUND-80F                           00282300
282400               TO TRUE                                            00282400
282500                                                                  00282500
282600         WHEN OTHER                                               00282600
282700              MOVE SQLCODE                                        00282700
282800                TO DB2-ABEND-SQLCODE                              00282800
282900              MOVE "SELECT"                                       00282900
283000                TO DB2-ABEND-FUNCTION                             00283000
283100              MOVE LIT-TBL-VEH-STATUS                             00283100
283200                TO DB2-ABEND-TABLE                                00283200
283300              MOVE DB2-ABEND-MSG                                  00283300
283400                TO ABEND-MSG                                      00283400
283500              MOVE "5200C"                                        00283500
283600                TO ABEND-PARAGRAPH                                00283600
283700              PERFORM 9999I-ABEND                                 00283700
283800     END-EVALUATE                                                 00283800
283900     .                                                            00283900
284000                                                                  00284000
284100******************************************************************00284100
284200* AT THIS POINT, A CURSOR WILL BE CREATED USING TABLE MEXW003 TO  00284200
284300* SELECT ALL 40V STATUS CODES WITH AN FTC QAD CURRENT DATA SOURCE 00284300
284400* (WD). THE NEWEST ROW CONTAINS THE WHOLESALE GLOBAL DEALER CODE  00284400
284500* TO SEND TO VINCENT. AN "ORDER BY VST_STAT_Y DESC" IS USED       00284500
284600* TO ACCOMPLISH THIS, WITH THE STATIC TIMESTAMP BREAKING ANY TIES.00284600
284700******************************************************************00284700
284800 5220C-OPEN-40V-CSR.                                              00284800
284900                                                                  00284900
285000     MOVE VEH-ORD-ID-C                                            00285000
285100       TO VST-VEH-ORD-ID-C                                        00285100
285200     MOVE VEH-DTA-DATA-SRC-C                                      00285200
285300       TO VST-DTA-DATA-SRC-C                                      00285300
285400     MOVE LIT-40V                                                 00285400
285500       TO VST-STA-STATUS-C                                        00285500
285600     MOVE LIT-D                                                   00285600
285700       TO VST-STAT-TYP-C                                          00285700
285800     MOVE LIT-Y                                                   00285800
285900       TO VST-ACTIVE-F                                            00285900
286000     MOVE LIT-WD                                                  00286000
286100       TO VST-CUR-DATA-SRC-C                                      00286100
286200                                                                  00286200
286300     EXEC SQL                                                     00286300
286400        OPEN MEXW003_40V_CSR                                      00286400
286500     END-EXEC                                                     00286500
286600                                                                  00286600
286700     MOVE SQLCODE                                                 00286700
286800       TO SC-DB2-SQLCODE                                          00286800
286900                                                                  00286900
287000     EVALUATE TRUE                                                00287000
287100         WHEN SC-DB2-SQLCODE-OK                                   00287100
287200              CONTINUE                                            00287200
287300                                                                  00287300
287400         WHEN OTHER                                               00287400
287500              MOVE SQLCODE                                        00287500
287600                TO DB2-ABEND-SQLCODE                              00287600
287700              MOVE "OPEN"                                         00287700
287800                TO DB2-ABEND-FUNCTION                             00287800
287900              MOVE LIT-TBL-VEH-STATUS                             00287900
288000                TO DB2-ABEND-TABLE                                00288000
288100              MOVE DB2-ABEND-MSG                                  00288100
288200                TO ABEND-MSG                                      00288200
288300              MOVE "5220C"                                        00288300
288400                TO ABEND-PARAGRAPH                                00288400
288500              PERFORM 9999I-ABEND                                 00288500
288600     END-EVALUATE                                                 00288600
288700     .                                                            00288700
288800                                                                  00288800
288900******************************************************************00288900
289000* FETCHES A ROW FROM MEXW003_40V_CSR WHICH WILL RETRIEVE THE      00289000
289100* MOST RECENT FTC QAD (WD) WHOLESALE GLOBAL DEALER CODE.          00289100
289200******************************************************************00289200
289300 5230C-FETCH-40V-ROW.                                             00289300
289400                                                                  00289400
289500     EXEC SQL                                                     00289500
289600        FETCH  MEXW003_40V_CSR                                    00289600
289700         INTO   :VST-GBL-LOC-C                                    00289700
289800     END-EXEC                                                     00289800
289900                                                                  00289900
290000     MOVE SQLCODE                                                 00290000
290100       TO SC-DB2-SQLCODE                                          00290100
290200                                                                  00290200
290300     EVALUATE TRUE                                                00290300
290400         WHEN SC-DB2-SQLCODE-OK                                   00290400
290500              ADD +1                                              00290500
290600               TO WS-NBR-ROWS-READ-MEXW003                        00290600
290700              SET MEXW003-40V-CSR-ROW-FOUND                       00290700
290800               TO TRUE                                            00290800
290900                                                                  00290900
291000         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00291000
291100              SET MEXW003-40V-CSR-ROW-NOT-FOUND                   00291100
291200               TO TRUE                                            00291200
291300                                                                  00291300
291400         WHEN OTHER                                               00291400
291500              MOVE SQLCODE                                        00291500
291600                TO DB2-ABEND-SQLCODE                              00291600
291700              MOVE "FETCH"                                        00291700
291800                TO DB2-ABEND-FUNCTION                             00291800
291900              MOVE LIT-TBL-VEH-STATUS                             00291900
292000                TO DB2-ABEND-TABLE                                00292000
292100              MOVE DB2-ABEND-MSG                                  00292100
292200                TO ABEND-MSG                                      00292200
292300              MOVE "5230C"                                        00292300
292400                TO ABEND-PARAGRAPH                                00292400
292500              PERFORM 9999I-ABEND                                 00292500
292600     END-EVALUATE                                                 00292600
292700     .                                                            00292700
292800                                                                  00292800
292900******************************************************************00292900
293000* CLOSES THE MEXW003_40V_CSR WHICH WAS USED TO RETRIEVE THE       00293000
293100* MOST RECENT FTC QAD (WD) WHOLESALE GLOBAL DEALER CODE.          00293100
293200******************************************************************00293200
293300 5240C-CLOSE-40V-CSR.                                             00293300
293400                                                                  00293400
293500     EXEC SQL                                                     00293500
293600        CLOSE MEXW003_40V_CSR                                     00293600
293700     END-EXEC                                                     00293700
293800                                                                  00293800
293900     MOVE SQLCODE                                                 00293900
294000       TO SC-DB2-SQLCODE                                          00294000
294100                                                                  00294100
294200     EVALUATE TRUE                                                00294200
294300         WHEN SC-DB2-SQLCODE-OK                                   00294300
294400              CONTINUE                                            00294400
294500                                                                  00294500
294600         WHEN OTHER                                               00294600
294700              MOVE SQLCODE                                        00294700
294800                TO DB2-ABEND-SQLCODE                              00294800
294900              MOVE "CLOSE"                                        00294900
295000                TO DB2-ABEND-FUNCTION                             00295000
295100              MOVE LIT-TBL-VEH-STATUS                             00295100
295200                TO DB2-ABEND-TABLE                                00295200
295300              MOVE DB2-ABEND-MSG                                  00295300
295400                TO ABEND-MSG                                      00295400
295500              MOVE "5240C"                                        00295500
295600                TO ABEND-PARAGRAPH                                00295600
295700              PERFORM 9999I-ABEND                                 00295700
295800     END-EVALUATE                                                 00295800
295900     .                                                            00295900
296000                                                                  00296000
296100******************************************************************00296100
296200* A CURSOR WILL BE CREATED USING TABLE MEXW031.  ALL NON 'NA' AND 00296200
296300* NON 'EA' SOURCES WILL SELECT FROM IT.  THE RETRIEVED VALUES     00296300
296400* WILL BE SENT IN PLACE OF THE LOCAL BODY STYLE CODE THAT WAS     00296400
296500* OBTAINED FROM TABLE MEXW001_VEH_ORDER.                          00296500
296600******************************************************************00296600
296700 5300C-OPEN-MEXW031-CSR.                                          00296700
296800                                                                  00296800
296900     MOVE VEH-DTA-DATA-SRC-C                                      00296900
297000       TO CTM-DTA-DATA-SRC-C                                      00297000
297100     MOVE VEH-CATALOG-C                                           00297100
297200       TO CTM-LCL-CATALOG-C                                       00297200
297300                                                                  00297300
297400     EXEC SQL                                                     00297400
297500        OPEN MEXW031_CSR                                          00297500
297600     END-EXEC                                                     00297600
297700                                                                  00297700
297800     MOVE SQLCODE                                                 00297800
297900       TO SC-DB2-SQLCODE                                          00297900
298000                                                                  00298000
298100     EVALUATE TRUE                                                00298100
298200         WHEN SC-DB2-SQLCODE-OK                                   00298200
298300              CONTINUE                                            00298300
298400                                                                  00298400
298500         WHEN OTHER                                               00298500
298600              MOVE SQLCODE                                        00298600
298700                TO DB2-ABEND-SQLCODE                              00298700
298800              MOVE "OPEN"                                         00298800
298900                TO DB2-ABEND-FUNCTION                             00298900
299000              MOVE LIT-TBL-CATMAP                                 00299000
299100                TO DB2-ABEND-TABLE                                00299100
299200              MOVE DB2-ABEND-MSG                                  00299200
299300                TO ABEND-MSG                                      00299300
299400              MOVE "5300C"                                        00299400
299500                TO ABEND-PARAGRAPH                                00299500
299600              PERFORM 9999I-ABEND                                 00299600
299700     END-EVALUATE                                                 00299700
299800     .                                                            00299800
299900                                                                  00299900
300000******************************************************************00300000
300100* FETCHES A ROW FROM MEXW031_CSR WHICH WILL RETRIEVE OPTION CODE  00300100
300200* AND PRODUCT TYPE WHICH WILL BE COMBINED AND THEN USED TO POP-   00300200
300300* ULATE THE WERS BODY STYLE CODE FOR NON 'NA' AND NON 'EA' DATA   00300300
300400* SOURCES.                                                        00300400
300500******************************************************************00300500
300600 5320C-FETCH-MEXW031-CSR.                                         00300600
300700                                                                  00300700
300800     EXEC SQL                                                     00300800
300900        FETCH  MEXW031_CSR                                        00300900
301000         INTO   :CTM-OPT-OPTION-C                                 00301000
301100               ,:CTM-VPT-PROD-TYP-C                               00301100
301200     END-EXEC                                                     00301200
301300                                                                  00301300
301400     MOVE SQLCODE                                                 00301400
301500       TO SC-DB2-SQLCODE                                          00301500
301600                                                                  00301600
301700     EVALUATE TRUE                                                00301700
301800         WHEN SC-DB2-SQLCODE-OK                                   00301800
301900              ADD +1                                              00301900
302000               TO WS-NBR-ROWS-READ-MEXW031                        00302000
302100              SET MEXW031-FOUND                                   00302100
302200               TO TRUE                                            00302200
302300                                                                  00302300
302400         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00302400
302500              SET MEXW031-NOT-FOUND                               00302500
302600               TO TRUE                                            00302600
302700                                                                  00302700
302800         WHEN OTHER                                               00302800
302900              MOVE SQLCODE                                        00302900
303000                TO DB2-ABEND-SQLCODE                              00303000
303100              MOVE "FETCH"                                        00303100
303200                TO DB2-ABEND-FUNCTION                             00303200
303300              MOVE LIT-TBL-CATMAP                                 00303300
303400                TO DB2-ABEND-TABLE                                00303400
303500              MOVE DB2-ABEND-MSG                                  00303500
303600                TO ABEND-MSG                                      00303600
303700              MOVE "5320C"                                        00303700
303800                TO ABEND-PARAGRAPH                                00303800
303900              PERFORM 9999I-ABEND                                 00303900
304000     END-EVALUATE                                                 00304000
304100     .                                                            00304100
304200                                                                  00304200
304300******************************************************************00304300
304400* CLOSES CURSOR MEXW031_CSE WHICH RETRIEVED THE OPTION CODE AND   00304400
304500* PRODUCT TYPE FOR NON 'NA' AND NON 'EA' DATA SOURCES.            00304500
304600******************************************************************00304600
304700 5340C-CLOSE-MEXW031-CSR.                                         00304700
304800                                                                  00304800
304900     EXEC SQL                                                     00304900
305000        CLOSE MEXW031_CSR                                         00305000
305100     END-EXEC                                                     00305100
305200                                                                  00305200
305300     MOVE SQLCODE                                                 00305300
305400       TO SC-DB2-SQLCODE                                          00305400
305500                                                                  00305500
305600     EVALUATE TRUE                                                00305600
305700         WHEN SC-DB2-SQLCODE-OK                                   00305700
305800              CONTINUE                                            00305800
305900                                                                  00305900
306000         WHEN OTHER                                               00306000
306100              MOVE SQLCODE                                        00306100
306200                TO DB2-ABEND-SQLCODE                              00306200
306300              MOVE "CLOSE"                                        00306300
306400                TO DB2-ABEND-FUNCTION                             00306400
306500              MOVE LIT-TBL-CATMAP                                 00306500
306600                TO DB2-ABEND-TABLE                                00306600
306700              MOVE DB2-ABEND-MSG                                  00306700
306800                TO ABEND-MSG                                      00306800
306900              MOVE "5340C"                                        00306900
307000                TO ABEND-PARAGRAPH                                00307000
307100              PERFORM 9999I-ABEND                                 00307100
307200     END-EVALUATE                                                 00307200
307300     .                                                            00307300
307400                                                                  00307400
307500***************************************************************** 00307500
307600* WRITES A RECORD TO THE GSAM OUTPUT FILE.                        00307600
307700***************************************************************** 00307700
307800 6000C-WRITE-VINCENT-RECORD.                                      00307800
307900                                                                  00307900
308000     CALL "CBLTDLI" USING SL-FUNC-ISRT                            00308000
308100                          VINCENT-PCB                             00308100
308200                          WS-VINCENT-OUTPUT-RECORD                00308200
308300                                                                  00308300
308400     MOVE VINCENT-PCB-STATUS                                      00308400
308500       TO SC-IMS-STAT                                             00308500
308600                                                                  00308600
308700     IF  SC-IMS-STAT-OK                                           00308700
308800         ADD +1                                                   00308800
308900          TO WS-NBR-OUTPUT-RECS-WRITTEN                           00308900
309000     ELSE                                                         00309000
309100         MOVE VINCENT-PCB-STATUS                                  00309100
309200           TO IMS-ABEND-STATUS                                    00309200
309300         MOVE SL-FUNC-ISRT                                        00309300
309400           TO IMS-ABEND-FUNCTION                                  00309400
309500         MOVE VINCENT-PCB-NAME                                    00309500
309600           TO IMS-ABEND-PCB-NAME                                  00309600
309700         MOVE IMS-ABEND-MSG                                       00309700
309800           TO ABEND-MSG                                           00309800
309900         MOVE "6000C"                                             00309900
310000           TO ABEND-PARAGRAPH                                     00310000
310100         PERFORM 9999I-ABEND                                      00310100
310200     END-IF                                                       00310200
310300     .                                                            00310300
310400                                                                  00310400
310500******************************************************************00310500
310600* THIS PARAGRAPH WILL WRITE ALL THE AUDIT INFORMATION OUT TO THE  00310600
310700* AUDIT REPORT.                                                   00310700
310800******************************************************************00310800
310900 6020C-WRITE-AUDIT-DETAIL.                                        00310900
311000                                                                  00311000
311100     MOVE SPACES                                                  00311100
311200       TO AUDIT-RECORD                                            00311200
311300     WRITE AUDIT-RECORD                                           00311300
311400                                                                  00311400
311500     MOVE ALL "="                                                 00311500
311600       TO AUDIT-RECORD                                            00311600
311700     WRITE AUDIT-RECORD                                           00311700
311800                                                                  00311800
311900     MOVE SPACES                                                  00311900
312000       TO AUDIT-RECORD                                            00312000
312100     WRITE AUDIT-RECORD                                           00312100
312200                                                                  00312200
312300     MOVE "TTL ROWS READ FROM MEXW001 :"                          00312300
312400       TO AUDIT-LABEL                                             00312400
312500     MOVE WS-NBR-ROWS-READ-MEXW001                                00312500
312600       TO AUDIT-DATA                                              00312600
312700     WRITE AUDIT-RECORD                                           00312700
312800                                                                  00312800
312900     MOVE "TTL ROWS READ FROM SALE-CHK :"                         00312900
313000       TO AUDIT-LABEL                                             00313000
313100     MOVE WS-NBR-ROWS-READ-SALE-CHK                               00313100
313200       TO AUDIT-DATA                                              00313200
313300     WRITE AUDIT-RECORD                                           00313300
313400                                                                  00313400
313500     MOVE "TTL ROWS READ FROM MEXW003 :"                          00313500
313600       TO AUDIT-LABEL                                             00313600
313700     MOVE WS-NBR-ROWS-READ-MEXW003                                00313700
313800       TO AUDIT-DATA                                              00313800
313900     WRITE AUDIT-RECORD                                           00313900
314000                                                                  00314000
314100     MOVE "TTL ROWS READ FROM MEXW004 :"                          00314100
314200       TO AUDIT-LABEL                                             00314200
314300     MOVE WS-NBR-ROWS-READ-MEXW004                                00314300
314400       TO AUDIT-DATA                                              00314400
314500     WRITE AUDIT-RECORD                                           00314500
314600                                                                  00314600
314700     MOVE "TTL ROWS READ FROM MEXW007 :"                          00314700
314800       TO AUDIT-LABEL                                             00314800
314900     MOVE WS-NBR-ROWS-READ-MEXW007                                00314900
315000       TO AUDIT-DATA                                              00315000
315100     WRITE AUDIT-RECORD                                           00315100
315200                                                                  00315200
315300     MOVE "TTL ROWS READ FROM MEXW008 :"                          00315300
315400       TO AUDIT-LABEL                                             00315400
315500     MOVE WS-NBR-ROWS-READ-MEXW008                                00315500
315600       TO AUDIT-DATA                                              00315600
315700     WRITE AUDIT-RECORD                                           00315700
315800                                                                  00315800
315900     MOVE "TTL ROWS READ FROM MEXW027 :"                          00315900
316000       TO AUDIT-LABEL                                             00316000
316100     MOVE WS-NBR-ROWS-READ-MEXW027                                00316100
316200       TO AUDIT-DATA                                              00316200
316300     WRITE AUDIT-RECORD                                           00316300
316400                                                                  00316400
316500     MOVE "TTL ROWS READ FROM MEXW031 :"                          00316500
316600       TO AUDIT-LABEL                                             00316600
316700     MOVE WS-NBR-ROWS-READ-MEXW031                                00316700
316800       TO AUDIT-DATA                                              00316800
316900     WRITE AUDIT-RECORD                                           00316900
317000                                                                  00317000
317100     MOVE "TTL ROWS READ FROM MEXW032 :"                          00317100
317200       TO AUDIT-LABEL                                             00317200
317300     MOVE WS-NBR-ROWS-READ-MEXW032                                00317300
317400       TO AUDIT-DATA                                              00317400
317500     WRITE AUDIT-RECORD                                           00317500
317600                                                                  00317600
317700     MOVE "TTL ROWS READ FROM MEXW033 :"                          00317700
317800       TO AUDIT-LABEL                                             00317800
317900     MOVE WS-NBR-ROWS-READ-MEXW033                                00317900
318000       TO AUDIT-DATA                                              00318000
318100     WRITE AUDIT-RECORD                                           00318100
318200                                                                  00318200
318300     MOVE "TTL ROWS READ FROM MEXW034 :"                          00318300
318400       TO AUDIT-LABEL                                             00318400
318500     MOVE WS-NBR-ROWS-READ-MEXW034                                00318500
318600       TO AUDIT-DATA                                              00318600
318700     WRITE AUDIT-RECORD                                           00318700
318800                                                                  00318800
318900     MOVE "TTL ROWS READ FROM MEXW035 :"                          00318900
319000       TO AUDIT-LABEL                                             00319000
319100     MOVE WS-NBR-ROWS-READ-MEXW035                                00319100
319200       TO AUDIT-DATA                                              00319200
319300     WRITE AUDIT-RECORD                                           00319300
319400                                                                  00319400
319500     MOVE "TTL SYSPARM RECORDS READ   :"                          00319500
319600       TO AUDIT-LABEL                                             00319600
319700     MOVE WS-NBR-SYSPARM-RECS-READ                                00319700
319800       TO AUDIT-DATA                                              00319800
319900     WRITE AUDIT-RECORD                                           00319900
321200                                                                  00321200
321300     MOVE "TTL MEXW027 ROWS NOT FOUND :"                          00321300
321400       TO AUDIT-LABEL                                             00321400
321500     MOVE WS-NBR-MEXW027-NOTFOUND-CALLS                           00321500
321600       TO AUDIT-DATA                                              00321600
321700     WRITE AUDIT-RECORD                                           00321700
321800                                                                  00321800
321900     MOVE "TTL MEXW035 ROWS NOT FOUND :"                          00321900
322000       TO AUDIT-LABEL                                             00322000
322100     MOVE WS-NBR-MEXW035-NOTFOUND-CALLS                           00322100
322200       TO AUDIT-DATA                                              00322200
322300     WRITE AUDIT-RECORD                                           00322300
322400                                                                  00322400
322500     MOVE "TTL OUTPUT RECORDS WRITTEN :"                          00322500
322600       TO AUDIT-LABEL                                             00322600
322700     MOVE WS-NBR-OUTPUT-RECS-WRITTEN                              00322700
322800       TO AUDIT-DATA                                              00322800
322900     WRITE AUDIT-RECORD                                           00322900
323000     .                                                            00323000
323100                                                                  00323100
323200******************************************************************00323200
323300* OBTAINS THE CURRENT DEARBORN TIMESTAMP, PART OF WHICH WILL BE   00323300
323400* USED IN THE MAIN DRIVING CURSOR AND THE E & G HEADER/TRAILER    00323400
323500* ALONG WITH THE VINCENT HEADER.                                  00323500
323600******************************************************************00323600
323700 7000C-OBTAIN-DRBN-TIMESTAMP.                                     00323700
323800                                                                  00323800
323900     EXEC SQL                                                     00323900
324000        SET  :WS-CURR-DRBN-TIMESTAMP  = CURRENT TIMESTAMP         00324000
324100     END-EXEC                                                     00324100
324200                                                                  00324200
324300     MOVE SQLCODE TO SC-DB2-SQLCODE                               00324300
324400                                                                  00324400
324500     EVALUATE TRUE                                                00324500
324600         WHEN SC-DB2-SQLCODE-OK                                   00324600
324700              CONTINUE                                            00324700
324800                                                                  00324800
324900         WHEN OTHER                                               00324900
325000              MOVE SQLCODE                                        00325000
325100                TO DB2-ABEND-SQLCODE                              00325100
325200              MOVE "SELECT"                                       00325200
325300                TO DB2-ABEND-FUNCTION                             00325300
325400              MOVE LIT-TBL-GENERIC                                00325400
325500                TO DB2-ABEND-TABLE                                00325500
325600              MOVE DB2-ABEND-MSG                                  00325600
325700                TO ABEND-MSG                                      00325700
325800              MOVE "7000C"                                        00325800
325900                TO ABEND-PARAGRAPH                                00325900
326000              PERFORM 9999I-ABEND                                 00326000
326100     END-EVALUATE                                                 00326100
326200     .                                                            00326200
326300                                                                  00326300
326400******************************************************************00326400
326500* UPDATE THE TIMESTAMP ON THE MEXS016 TABLE WITH THE TIME THAT    00326500
326600* THE JOB STARTED.  THIS VALUE WILL BE READ IN THE NEXT TIME THIS 00326600
326700* PROGRAM IS EXECUTED.                                            00326700
326800******************************************************************00326800
326900 7250C-UPDATE-TIMESTAMP.                                          00326900
327000                                                                  00327000
327100      MOVE LIT-SYSTEM-ID                                          00327100
327200        TO GNT-SYSTEM-CD                                          00327200
327300      MOVE LIT-TABLE-ID                                           00327300
327400        TO GNT-TABLE-ID                                           00327400
327500      MOVE LIT-KEY-DATA-TIMESTAMP                                 00327500
327600        TO GNT-KEY-DATA                                           00327600
327700                                                                  00327700
327800      EXEC SQL                                                    00327800
327900          UPDATE MEXS016_GENERIC2                                 00327900
328000          SET    GNT_ATTRIBUTE_DATA = :WS-CURR-DRBN-TIMESTAMP     00328000
328100          WHERE  GNT_SYSTEM_CD      = :GNT-SYSTEM-CD              00328100
328200          AND    GNT_TABLE_ID       = :GNT-TABLE-ID               00328200
328300          AND    GNT_KEY_DATA       = :GNT-KEY-DATA               00328300
328400      END-EXEC                                                    00328400
328500                                                                  00328500
328600      MOVE SQLCODE TO SC-DB2-SQLCODE                              00328600
328700                                                                  00328700
328800     EVALUATE TRUE                                                00328800
328900         WHEN SC-DB2-SQLCODE-OK                                   00328900
329000              CONTINUE                                            00329000
329100                                                                  00329100
329200         WHEN OTHER                                               00329200
329300              MOVE SQLCODE                                        00329300
329400                TO DB2-ABEND-SQLCODE                              00329400
329500              MOVE "UPDATE"                                       00329500
329600                TO DB2-ABEND-FUNCTION                             00329600
329700              MOVE LIT-TBL-GENERIC                                00329700
329800                TO DB2-ABEND-TABLE                                00329800
329900              MOVE DB2-ABEND-MSG                                  00329900
330000                TO ABEND-MSG                                      00330000
330100              MOVE "7250C"                                        00330100
330200                TO ABEND-PARAGRAPH                                00330200
330300              PERFORM 9999I-ABEND                                 00330300
330400     END-EVALUATE                                                 00330400
330500     .                                                            00330500
330600                                                                  00330600
330700******************************************************************00330700
330800* SELECT THE PREVIOUS RUN'S OUTPUT FILE BATCH NUMBER.             00330800
330900******************************************************************00330900
331000 7300C-GET-BATCH-NBR.                                             00331000
331100                                                                  00331100
331200      MOVE LIT-SYSTEM-ID                                          00331200
331300        TO GNT-SYSTEM-CD                                          00331300
331400      MOVE LIT-TABLE-ID                                           00331400
331500        TO GNT-TABLE-ID                                           00331500
331600      MOVE LIT-KEY-DATA-BATCHCTL                                  00331600
331700        TO GNT-KEY-DATA                                           00331700
331800                                                                  00331800
331900     EXEC SQL                                                     00331900
332000         SELECT GNT_ATTRIBUTE_DATA                                00332000
332100         INTO  :GNT-ATTRIBUTE-DATA                                00332100
332200         FROM   MEXS016_GENERIC2                                  00332200
332300         WHERE  GNT_SYSTEM_CD = :GNT-SYSTEM-CD                    00332300
332400         AND    GNT_TABLE_ID  = :GNT-TABLE-ID                     00332400
332500         AND    GNT_KEY_DATA  = :GNT-KEY-DATA                     00332500
332600     END-EXEC                                                     00332600
332700                                                                  00332700
332800     MOVE SQLCODE                                                 00332800
332900               TO SC-DB2-SQLCODE                                  00332900
333000                                                                  00333000
333100     EVALUATE TRUE                                                00333100
333200         WHEN SC-DB2-SQLCODE-OK                                   00333200
333300              SET BATCHCTL-FOUND                                  00333300
333400               TO TRUE                                            00333400
333500                                                                  00333500
333600         WHEN SC-DB2-SQLCODE-INVALID-DATE                         00333600
333700              SET BATCHCTL-NOT-FOUND                              00333700
333800               TO TRUE                                            00333800
333900                                                                  00333900
334000         WHEN OTHER                                               00334000
334100              MOVE SQLCODE                                        00334100
334200                TO DB2-ABEND-SQLCODE                              00334200
334300              MOVE "SELECT"                                       00334300
334400                TO DB2-ABEND-FUNCTION                             00334400
334500              MOVE LIT-TBL-GENERIC                                00334500
334600                TO DB2-ABEND-TABLE                                00334600
334700              MOVE DB2-ABEND-MSG                                  00334700
334800                TO ABEND-MSG                                      00334800
334900              MOVE "7300C"                                        00334900
335000                TO ABEND-PARAGRAPH                                00335000
335100              PERFORM 9999I-ABEND                                 00335100
335200     END-EVALUATE                                                 00335200
335300     .                                                            00335300
335400                                                                  00335400
335500******************************************************************00335500
335600* UPDATE THE OUTPUT FILE'S BATCH NUMBER BY +1.                    00335600
335700******************************************************************00335700
335800 7350C-UPDATE-BATCH-NBR.                                          00335800
335900                                                                  00335900
336000      MOVE LIT-SYSTEM-ID                                          00336000
336100        TO GNT-SYSTEM-CD                                          00336100
336200      MOVE LIT-TABLE-ID                                           00336200
336300        TO GNT-TABLE-ID                                           00336300
336400      MOVE LIT-KEY-DATA-BATCHCTL                                  00336400
336500        TO GNT-KEY-DATA                                           00336500
336600      MOVE WS-CURRENT-BATCH-NBR                                   00336600
336700        TO GNT-ATTRIBUTE-DATA                                     00336700
336800                                                                  00336800
336900      EXEC SQL                                                    00336900
337000          UPDATE MEXS016_GENERIC2                                 00337000
337100          SET    GNT_ATTRIBUTE_DATA = :GNT-ATTRIBUTE-DATA         00337100
337200          WHERE  GNT_SYSTEM_CD      = :GNT-SYSTEM-CD              00337200
337300          AND    GNT_TABLE_ID       = :GNT-TABLE-ID               00337300
337400          AND    GNT_KEY_DATA       = :GNT-KEY-DATA               00337400
337500      END-EXEC                                                    00337500
337600                                                                  00337600
337700      MOVE SQLCODE TO SC-DB2-SQLCODE                              00337700
337800                                                                  00337800
337900     EVALUATE TRUE                                                00337900
338000         WHEN SC-DB2-SQLCODE-OK                                   00338000
338100              CONTINUE                                            00338100
338200                                                                  00338200
338300         WHEN OTHER                                               00338300
338400              MOVE SQLCODE                                        00338400
338500                TO DB2-ABEND-SQLCODE                              00338500
338600              MOVE "UPDATE"                                       00338600
338700                TO DB2-ABEND-FUNCTION                             00338700
338800              MOVE LIT-TBL-GENERIC                                00338800
338900                TO DB2-ABEND-TABLE                                00338900
339000              MOVE DB2-ABEND-MSG                                  00339000
339100                TO ABEND-MSG                                      00339100
339200              MOVE "7350C"                                        00339200
339300                TO ABEND-PARAGRAPH                                00339300
339400              PERFORM 9999I-ABEND                                 00339400
339500     END-EVALUATE                                                 00339500
339600     .                                                            00339600
339700                                                                  00339700
339800******************************************************************00339800
339900* POPULATES THE HUB HEADER TO THE OUTPUT FILE.                    00339900
340000******************************************************************00340000
340100 7400C-POPULATE-HUB-HEADER.                                       00340100
340200                                                                  00340200
340300      MOVE WS-LAYOUT-ID                                           00340300
340400        TO HUB-HDR-LAYOUT-ID                                      00340400
340500      MOVE WS-ENTITY-CD                                           00340500
340600        TO HUB-HDR-ENTITY-CODE                                    00340600
340700      MOVE WS-LAYOUT-ID                                           00340700
340800        TO HUB-HDR-LAYOUT-ID                                      00340800
340900      MOVE WS-CURR-DRBN-TIMESTAMP                                 00340900
341000        TO HUB-HDR-TIMESTAMP                                      00341000
341100      MOVE WS-CURRENT-BATCH-NBR                                   00341100
341200        TO HUB-HDR-BATCH-NBR                                      00341200
341300      MOVE WS-PROCESS-ID                                          00341300
341400        TO HUB-HDR-PROCESS-ID                                     00341400
341500      MOVE ZERO                                                   00341500
341600        TO HUB-HDR-TOTAL-REC-CNT                                  00341600
341700      MOVE SPACES                                                 00341700
341800        TO HUB-HDR-PRIMARY-CONTACT                                00341800
341900           HUB-HDR-SECOND-CONTACT                                 00341900
342000     MOVE HUB-HEADER                                              00342000
342100       TO WS-VINCENT-OUTPUT-RECORD                                00342100
342200      .                                                           00342200
342300                                                                  00342300
342400******************************************************************00342400
342500* POPULATES THE HUB TRAILER IN THE OUTPUT FILE.                   00342500
342600******************************************************************00342600
342700 7450C-POPULATE-HUB-TRAILER.                                      00342700
342800                                                                  00342800
342900      MOVE WS-ENTITY-CD                                           00342900
343000        TO HUB-TRL-ENTITY-CODE                                    00343000
343100      MOVE WS-LAYOUT-ID                                           00343100
343200        TO HUB-TRL-LAYOUT-ID                                      00343200
343300      MOVE WS-CURR-DRBN-TIMESTAMP                                 00343300
343400        TO HUB-TRL-TIMESTAMP                                      00343400
343500      MOVE WS-CURRENT-BATCH-NBR                                   00343500
343600        TO HUB-TRL-BATCH-NBR                                      00343600
343700      MOVE WS-PROCESS-ID                                          00343700
343800        TO HUB-TRL-PROCESS-ID                                     00343800
343900      MOVE WS-COUNT-DTL-NBR                                       00343900
344000        TO HUB-TRL-TOTAL-REC-CNT                                  00344000
344100      MOVE SPACES                                                 00344100
344200        TO HUB-TRL-PRIMARY-CONTACT                                00344200
344300           HUB-TRL-SECOND-CONTACT                                 00344300
344400     MOVE HUB-TRAILER                                             00344400
344500       TO WS-VINCENT-OUTPUT-RECORD                                00344500
344600      .                                                           00344600
344700                                                                  00344700
344800******************************************************************00344800
344900* POPULATES THE VINCENT HEADER IN THE OUTPUT FILE.                00344900
345000******************************************************************00345000
345100 7500C-POPULATE-VINCENT-HEADER.                                   00345100
345200                                                                  00345200
345300      INITIALIZE VNT-HDR-HUB-REC-ID-NBR                           00345300
345400      MOVE 1                                                      00345400
345500        TO VNT-HDR-HUB-LINE-NBR                                   00345500
345600           VNT-HDR-REC-ID-NBR                                     00345600
345700           WS-COUNT-LINE-NBR                                      00345700
345800      STRING                                                      00345800
345900          WS-DRBN-YEAR                                            00345900
346000          WS-DRBN-MONTH                                           00346000
346100          WS-DRBN-DAY                                             00346100
346200          DELIMITED BY SIZE                                       00346200
346300        INTO                                                      00346300
346400          VNT-HDR-CURR-DATE                                       00346400
346500      END-STRING                                                  00346500
346600      STRING                                                      00346600
346700          WS-DRBN-HOUR                                            00346700
346800          WS-DRBN-MINUTE                                          00346800
346900          WS-DRBN-SECOND                                          00346900
347000          DELIMITED BY SIZE                                       00347000
347100        INTO                                                      00347100
347200          VNT-HDR-CURR-TIME                                       00347200
347300      END-STRING                                                  00347300
347400      MOVE LIT-WDMSALEM                                           00347400
347500        TO VNT-HDR-REC-TYPE                                       00347500
347600      MOVE WS-CURRENT-BATCH-NBR                                   00347600
347700        TO VNT-HDR-CURR-BATCH-NBR                                 00347700
347800      MOVE WS-PREV-BATCH-NBR                                      00347800
347900        TO VNT-HDR-PREV-BATCH-NBR                                 00347900
348000      MOVE LOW-VALUES                                             00348000
348100        TO VNT-HDR-LOW-VALUES                                     00348100
348200      MOVE VINCENT-HEADER                                         00348200
348300        TO WS-VINCENT-OUTPUT-RECORD                               00348300
348400      .                                                           00348400
348500                                                                  00348500
348600******************************************************************00348600
348700* POPULATES THE VINCENT TRAILER IN THE OUTPUT FILE.               00348700
348800******************************************************************00348800
348900 7550C-POPULATE-VINCENT-TRAILER.                                  00348900
349000                                                                  00349000
349100      INITIALIZE VNT-TRL-HUB-REC-ID-NBR                           00349100
349200      ADD  1                                                      00349200
349300        TO WS-COUNT-LINE-NBR                                      00349300
349400      MOVE WS-COUNT-LINE-NBR                                      00349400
349500        TO VNT-TRL-HUB-LINE-NBR                                   00349500
349600           VNT-TRL-REC-ID-NBR                                     00349600
349700      MOVE LIT-999                                                00349700
349800        TO VNT-TRL-HUB-REC-TYPE                                   00349800
349900      MOVE LIT-WDMSALEM                                           00349900
350000        TO VNT-TRL-REC-TYPE                                       00350000
350100      MOVE WS-CURRENT-BATCH-NBR                                   00350100
350200        TO VNT-TRL-CURR-BATCH-NBR                                 00350200
350300      MOVE WS-COUNT-DTL-NBR                                       00350300
350400        TO VNT-TRL-COUNTER                                        00350400
350500      MOVE VINCENT-TRAILER                                        00350500
350600        TO WS-VINCENT-OUTPUT-RECORD                               00350600
350700      .                                                           00350700
350800                                                                  00350800
350900******************************************************************00350900
351000* SELECTS WERS STRING FROM MEXW004_VEH_WERS_STRING DB2 TABLE      00351000
351100******************************************************************00351100
351200 7600C-SELECT-WERS-DATA-W004.                                     00351200
351300                                                                  00351300
351400     EXEC SQL                                                     00351400
351500         SELECT  VWR_WERS_STRING_X                                00351500
351600                ,VWR_WERS_VL_C                                    00351600
351700                ,VWR_WERS_PRD_TP_C                                00351700
351800                ,VWR_MAJ_FEAT_DFNED_F                             00351800
351900           INTO :VWR-WERS-STRING-X                                00351900
352000               ,:VWR-WERS-VL-C                                    00352000
352100               ,:VWR-WERS-PRD-TP-C                                00352100
352200               ,:VWR-MAJ-FEAT-DFNED-F                             00352200
352300           FROM  MEXW004_VEH_WERS_STRING                          00352300
352400          WHERE  VEH_ORD_ID_C     =  :VWR-VEH-ORD-ID-C            00352400
352500            AND  DTA_DATA_SRC_C   =  :VWR-DTA-DATA-SRC-C          00352500
352600     END-EXEC                                                     00352600
352700                                                                  00352700
352800     MOVE SQLCODE                     TO SC-DB2-SQLCODE           00352800
352900                                                                  00352900
353000     EVALUATE TRUE                                                00353000
353100         WHEN SC-DB2-SQLCODE-OK                                   00353100
353200              IF VWR-WERS-STRING-X-TEXT    > SPACES    AND        00353200
353300                 VWR-MAJ-FEAT-DFNED-F      = LIT-Y                00353300
353400                 SET WERS-STRING-FOUND-SW     TO TRUE             00353400
353500                 ADD +1                       TO                  00353500
353600                                      WS-NBR-ROWS-READ-MEXW004    00353600
353700              END-IF                                              00353700
353800                                                                  00353800
353900         WHEN SC-DB2-SQLCODE-NOT-FOUND                            00353900
354000              SET WERS-STRING-NOT-FOUND-SW                        00354000
354100                                      TO TRUE                     00354100
354200                                                                  00354200
354300         WHEN OTHER                                               00354300
354400              PERFORM 7620C-WRITE-MEXW004-AUDIT-RPT               00354400
354500              MOVE SC-DB2-SQLCODE     TO DB2-ABEND-SQLCODE        00354500
354600              MOVE "SELECT"           TO DB2-ABEND-FUNCTION       00354600
354700              MOVE LIT-TBL-MEXW004    TO DB2-ABEND-TABLE          00354700
354800              MOVE DB2-ABEND-MSG      TO ABEND-MSG                00354800
354900              MOVE "7600C"            TO ABEND-PARAGRAPH          00354900
355000                                                                  00355000
355100              PERFORM 9999I-ABEND                                 00355100
355200                                                                  00355200
355300     END-EVALUATE                                                 00355300
355400                                                                  00355400
355500     .                                                            00355500
355600                                                                  00355600
355700/*****************************************************************00355700
355800* WRITE AUDIT REPORT FOR MEXW004_VEH_WERS_STRING TABLE           *00355800
355900******************************************************************00355900
356000 7620C-WRITE-MEXW004-AUDIT-RPT.                                   00356000
356100                                                                  00356100
356200     MOVE SPACES                     TO AUDIT-RECORD              00356200
356300                                                                  00356300
356400     MOVE " VWR-VEH-ORD-ID-C: "      TO AUDIT-LABEL               00356400
356500     MOVE VWR-VEH-ORD-ID-C           TO AUDIT-DATA                00356500
356600                                                                  00356600
356700     WRITE AUDIT-RECORD                                           00356700
356800     MOVE SPACES                     TO AUDIT-RECORD              00356800
356900                                                                  00356900
357000     MOVE " VWR-DTA-DATA-SRC-C: "    TO AUDIT-LABEL               00357000
357100     MOVE VWR-DTA-DATA-SRC-C         TO AUDIT-DATA                00357100
357200                                                                  00357200
357300     WRITE AUDIT-RECORD                                           00357300
357400     MOVE SPACES                     TO AUDIT-RECORD              00357400
357500                                                                  00357500
357600     .                                                            00357600
357700                                                                  00357700
357701******************************************************************
357702* SELECT CURRENT STATUS FROM MEXW003_VEH_STATUS                  *
357703******************************************************************
357704 7700C-SELECT-CURR-STAT-W003.
357705
357706     EXEC SQL                                                     003514
357707         SELECT  STA_STATUS_C                                     003515
357708              ,  VST_STAT_Y
357709           INTO :VST-STA-STATUS-C
357710              , :VST-STAT-Y
357711           FROM  MEXW003_VEH_STATUS                               003523
357712          WHERE  VEH_ORD_ID_C     =  :VST-VEH-ORD-ID-C            003524
357713            AND  DTA_DATA_SRC_C   =  :VST-DTA-DATA-SRC-C          003525
357714            AND  VST_CUR_STAT_F   =  :LIT-Y
357715            AND  VST_ACTIVE_F     =  :LIT-Y
357716     END-EXEC                                                     003526
357717                                                                  003527
357718     MOVE SQLCODE                     TO SC-DB2-SQLCODE           003528
357719                                                                  003529
357720     EVALUATE TRUE                                                003530
357721         WHEN SC-DB2-SQLCODE-OK                                   003531
357722              SET CURR-STAT-FOUND-SW  TO TRUE                     003532
357723                                                                  003538
357724         WHEN SC-DB2-SQLCODE-NOT-FOUND                            003539
357725              SET CURR-STAT-NOT-FOUND-SW                          003540
357726                                      TO TRUE
357727                                                                  003542
357728         WHEN OTHER                                               003543
357729              MOVE SC-DB2-SQLCODE     TO DB2-ABEND-SQLCODE        003545
357730              MOVE "SELECT"           TO DB2-ABEND-FUNCTION       003546
357731              MOVE LIT-TBL-VEH-STATUS TO DB2-ABEND-TABLE          003547
357732              MOVE DB2-ABEND-MSG      TO ABEND-MSG                003548
357733              MOVE "7700C"            TO ABEND-PARAGRAPH          003549
357734
357735              MOVE SPACES             TO AUDIT-RECORD
357736              WRITE AUDIT-RECORD
357737
357738              MOVE SPACES             TO AUDIT-RECORD
357739              STRING "ABEND: 7700C-SELECT-CURR-STAT-W003 "
357740              DELIMITED BY SIZE     INTO AUDIT-RECORD
357741              END-STRING
357742              WRITE AUDIT-RECORD
357743
357744              MOVE SPACES             TO AUDIT-RECORD
357745              WRITE AUDIT-RECORD
357746
357747              MOVE SPACES             TO AUDIT-RECORD
357748              STRING "VST-VEH-ORD-ID-C  : ", VST-VEH-ORD-ID-C
357749              DELIMITED BY SIZE     INTO AUDIT-RECORD
357750              END-STRING
357751              WRITE AUDIT-RECORD
357752
357753              MOVE SPACES             TO AUDIT-RECORD
357755              STRING "VST-DTA-DATA-SRC-C: ", VST-DTA-DATA-SRC-C
357756              DELIMITED BY SIZE     INTO AUDIT-RECORD
357757              END-STRING
357758              WRITE AUDIT-RECORD
357759
357760              MOVE SPACES             TO AUDIT-RECORD
357762              STRING "VST-CURR-STAT-F   : ", LIT-Y
357763              DELIMITED BY SIZE     INTO AUDIT-RECORD
357764              END-STRING
357765              WRITE AUDIT-RECORD
357766
357767              MOVE SPACES             TO AUDIT-RECORD
357769              STRING "VST-ACTIVE-F      : ", LIT-Y
357770              DELIMITED BY SIZE     INTO AUDIT-RECORD
357771              END-STRING
357772              WRITE AUDIT-RECORD
357773
357774              MOVE SPACES             TO AUDIT-RECORD
357775              WRITE AUDIT-RECORD
357776
357777              PERFORM 9999I-ABEND                                 003551
357778                                                                  003552
357779     END-EVALUATE                                                 003553
357780     .
357790                                                                  00357700
357800******************************************************************00357800
357900* READS THE INPUT SYSPARM FILE TO OBTAIN THE PRODUCTION SOURCE.   00357900
358000******************************************************************00358000
358100 8000C-GET-SYSPARM-RECORD.                                        00358100
358200                                                                  00358200
358300     CALL "CBLTDLI" USING SL-FUNC-GN                              00358300
358400                          SYSPARM-PCB                             00358400
358500                          SYSPARM-RECORD                          00358500
358600                                                                  00358600
358700     MOVE SYSPARM-PCB-STATUS                                      00358700
358800       TO SC-IMS-STAT                                             00358800
358900                                                                  00358900
359000     EVALUATE TRUE                                                00359000
359100         WHEN SC-IMS-STAT-OK                                      00359100
359200              ADD +1                                              00359200
359300               TO WS-NBR-SYSPARM-RECS-READ                        00359300
359400              SET NOT-END-OF-SYSPARM-FILE                         00359400
359500               TO TRUE                                            00359500
359600         WHEN SC-IMS-STAT-END-OF-DB                               00359600
359700              SET END-OF-SYSPARM-FILE                             00359700
359800               TO TRUE                                            00359800
359900         WHEN OTHER                                               00359900
360000              MOVE SYSPARM-PCB-STATUS                             00360000
360100                TO IMS-ABEND-STATUS                               00360100
360200              MOVE SL-FUNC-GN                                     00360200
360300                TO IMS-ABEND-FUNCTION                             00360300
360400              MOVE SYSPARM-PCB-NAME                               00360400
360500                TO IMS-ABEND-PCB-NAME                             00360500
360600              MOVE IMS-ABEND-MSG                                  00360600
360700                TO ABEND-MSG                                      00360700
360800              MOVE "8000C"                                        00360800
360900                TO ABEND-PARAGRAPH                                00360900
361000              PERFORM 9999I-ABEND                                 00361000
361100     END-EVALUATE                                                 00361100
361200     .                                                            00361200
361300                                                                  00361300
361400******************************************************************00361400
361500* IF A CALL TO TABLE MEXW035 RESULTED IN A SQL +100 (NOT FOUND)   00361500
361600* CONDITION, THE INFORMATION WILL BE WRITTEN OUT TO THE AUDIT     00361600
361700* REPORT AND RETURN-CODE WILL BE SET TO 3, SO THAT AN EMAIL       00361700
361800* MESSAGE WILL BE SENT TO THE GEVIS HELPDESK TO INFORM THEM TO    00361800
361900* LOOK AT THE AUDIT REPORT.                                       00361900
362000******************************************************************00362000
362100 9000C-MISSING-MEXW035-ROW.                                       00362100
362200                                                                  00362200
362300     MOVE SPACES                                                  00362300
362400       TO AUDIT-RECORD                                            00362400
362500     WRITE AUDIT-RECORD                                           00362500
362600                                                                  00362600
362700     MOVE "MISSING DEALER ON MEXW035:  "                          00362700
362800       TO AUDIT-LABEL                                             00362800
362900     WRITE AUDIT-RECORD                                           00362900
363000                                                                  00363000
363100     MOVE "DEALER CODE:         "                                 00363100
363200       TO AUDIT-LABEL                                             00363200
363300     MOVE DLR-DLR-DLR-C                                           00363300
363400       TO AUDIT-DATA                                              00363400
363500     WRITE AUDIT-RECORD                                           00363500
363600                                                                  00363600
363700     MOVE "ASSOCIATED VIN:      "                                 00363700
363800       TO AUDIT-LABEL                                             00363800
363900     MOVE VEH-VIN-FULL-C                                          00363900
364000       TO AUDIT-DATA                                              00364000
364100     WRITE AUDIT-RECORD                                           00364100
364200                                                                  00364200
364300     ADD 1                                                        00364300
364400      TO WS-NBR-MEXW035-NOTFOUND-CALLS                            00364400
364500     .                                                            00364500
364600                                                                  00364600
364700******************************************************************00364700
364800* IF A CALL TO TABLE MEXW027 RESULTED IN A SQL +100 (NOT FOUND)   00364800
364900* CONDITION, THE INFORMATION WILL BE WRITTEN OUT TO THE AUDIT     00364900
365000* REPORT AND RETURN-CODE WILL BE SET TO 3, SO THAT AN EMAIL       00365000
365100* MESSAGE WILL BE SENT TO THE GEVIS HELPDESK TO INFORM THEM TO    00365100
365200* LOOK AT THE AUDIT REPORT.                                       00365200
365300******************************************************************00365300
365400 9100C-MISSING-MEXW027-ROW.                                       00365400
365500                                                                  00365500
365600     MOVE SPACES                                                  00365600
365700       TO AUDIT-RECORD                                            00365700
365800     WRITE AUDIT-RECORD                                           00365800
365900                                                                  00365900
366000     MOVE "MISSING STATUS ON MEXW027:  "                          00366000
366100       TO AUDIT-LABEL                                             00366100
366200     MOVE PL-SPACE                                                00366200
366300       TO AUDIT-DATA                                              00366300
366400     WRITE AUDIT-RECORD                                           00366400
366500                                                                  00366500
366600     MOVE "STATUS CODE:         "                                 00366600
366700       TO AUDIT-LABEL                                             00366700
366800     MOVE CNT-GBL-DATA-X                                          00366800
366900       TO AUDIT-DATA                                              00366900
367000     WRITE AUDIT-RECORD                                           00367000
367100                                                                  00367100
367200     MOVE "ASSOCIATED VIN:      "                                 00367200
367300       TO AUDIT-LABEL                                             00367300
367400     MOVE VEH-VIN-FULL-C                                          00367400
367500       TO AUDIT-DATA                                              00367500
367600     WRITE AUDIT-RECORD                                           00367600
367700                                                                  00367700
367710     SET SEND-EMAIL
367720      TO TRUE
367730                                                                  00367700
367800     ADD 1                                                        00367800
367900      TO WS-NBR-MEXW027-NOTFOUND-CALLS                            00367900
368000     .                                                            00368000
368100                                                                  00368100
368200******************************************************************00368200
368300* CALLS COREDUMP TO FORCE AN ABEND CAUSED BY AN ERROR.            00368300
368400******************************************************************00368400
368500 9999C-CALL-COREDUMP.                                             00368500
368600                                                                  00368600
368700     CALL "COREDUMP"                                              00368700
368800     .                                                            00368800
368900                                                                  00368900
369000 COPY CPESEBCR.                                                   00369000
369100*BMPSHELL CALLED ROUTINES                                         00369100
369200                                                                  00369200
